[
  {
    "id": "stop-greedy-goblins-and-get-diabolical-goodies-starting-july-1",
    "title": "Stop Greedy Goblins and Get Diabolical Goodies Starting July 1",
    "date": "2025-06-26",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24213953/stop-greedy-goblins-and-get-diabolical-goodies-starting-july-1",
    "summaries": {
      "Warrior": {
        "summary": "<ul>\n<li><strong>Greedy Emissary Event (July 1 - July 29):</strong> Encounter more Treasure Goblins in Stormwind, Orgrimmar, Dornogal, and The Undermine for rewards like the Inarius' Charger mount.</li>\n<li><strong>Collector's Bounty Buff (July 1 - July 29):</strong> Increased drop rates (up to 10x, some 25x) and doubled transmog loot chances in pre-Dragonflight legacy raids and dungeons for mounts, specific raid items (Eye of Sulfuras, Bindings of the Windseeker, Warglaives of Azzinoth, Thori'dal, The Stars' Fury), and the Golden Hearthstone Card.</li>\n<li><strong>Undermine Portals:</strong> Killing Undermine rares or defeating certain bosses in the Liberation of Undermine raid can trigger portals. Portal Storms spawn additional portals with enhanced affixes.</li>\n<li><strong>Treasure Goblin Customization:</strong> Use Elixirs on goblin summoning portals to add specific affixes, increasing goblin spawns and difficulty.</li>\n<li><strong>Diabolical Rewards:</strong> Earn Hellstone Shards from Hellcaller Chests (guaranteed Hellstone Shards for the first ten) to purchase hellish armor sets, including recolors of classic Tier 2 armor sets for Warriors, from Hellhunter Baranar in Dornogal.</li>\n</ul>",
        "word_stats": {
          "original": 972,
          "summary": 158,
          "reduction_percent": 83.7
        }
      },
      "Mage": {
        "summary": "<ul>\n    <li><strong>Greedy Emissary Event (July 1 - July 29):</strong> Treasure Goblins will be more prevalent in Stormwind, Orgrimmar, Dornogal, and The Undermine.</li>\n    <li><strong>Collector's Bounty Buff (July 1 - July 29):</strong> Increased drop rates (up to 10x, one item 25x) and doubled transmog drop rates in pre-Dragonflight legacy raids and dungeons.</li>\n    <li><strong>Portals:</strong> Spawn hourly in Stormwind (Docks), Orgrimmar (entrance), and Dornogal (southeast exit). In The Undermine, portals can spawn from killing rares, raid bosses, or during Portal Storms (hourly).</li>\n    <li><strong>Treasure Goblin Affixes:</strong> Goblins now have affixes indicated by icons. Elixirs can be used at summoning portals to customize goblin affixes, with more affixes potentially spawning more goblins.</li>\n    <li><strong>Diabolical Rewards:</strong> Hellstone Shards are earned from Hellcaller Chests (dropped by Treasure Goblins) and event activities. These can be exchanged for rewards, including recolors of classic Tier 2 armor sets.</li>\n</ul>",
        "word_stats": {
          "original": 972,
          "summary": 137,
          "reduction_percent": 85.9
        }
      },
      "Rogue": {
        "summary": "Rogue armor set recolors are among the diabolical rewards available during the Greedy Emissary event. Players earn Hellstone Shards from Hellcaller Chests, which drop from Treasure Goblins or are obtained from event activities. These shards can be exchanged for the armor sets and other items. The Collector's Bounty buff also increases the drop rate of legacy mounts and specific items from pre-Dragonflight raids and dungeons by up to 10x, with transmog loot drop rates doubled.",
        "word_stats": {
          "original": 972,
          "summary": 75,
          "reduction_percent": 92.3
        }
      },
      "Priest": {
        "summary": "<ul>\n  <li>The Priest tier set recolors are part of the diabolical rewards from the Greedy Emissary event.</li>\n  <li>Hellstone Shards are earned from Hellcaller Chests, which drop from Treasure Goblins during the event.</li>\n  <li>These shards can be exchanged for various rewards, including the Priest armor set recolors, from Hellhunter Baranar in Dornogal.</li>\n  <li>The first ten Hellcaller Chests are guaranteed to contain Hellstone Shards; these chests can also yield Valorstones and other items.</li>\n</ul>",
        "word_stats": {
          "original": 972,
          "summary": 72,
          "reduction_percent": 92.6
        }
      },
      "Paladin": {
        "summary": "The Greedy Emissary event returns July 1st to July 29th, featuring increased Treasure Goblin spawns in Stormwind, Orgrimmar, Dornogal, and The Undermine. Players can earn Hellstone Shards from Hellcaller Chests to purchase rewards, including recolors of classic Tier 2 Paladin armor sets.\n\nThe Collector's Bounty buff also runs concurrently, increasing drop rates for pre-Dragonflight legacy mounts, the Eye of Sulfuras, Golden Hearthstone Card, Bindings of the Windseeker, Warglaives of Azzinoth, and Thori'dal, The Stars' Fury by up to 10x (or 25x for the Eye of Sulfuras). Transmog loot drop rates in legacy raids and dungeons are doubled. This buff can be toggled on and off at any innkeeper.\n\nIn The Undermine, Treasure Goblins can be triggered by killing rares or defeating specific bosses in the Liberation of Undermine raid. Portal Storms, occurring on the quarter-hour, spawn additional portals with enhanced affixes. Players can use Elixirs at portals to customize Goblin affixes, with more affixes increasing the number of goblins that can spawn. Rewards from Hellcaller Chests can also include Valorstones and other items.",
        "word_stats": {
          "original": 972,
          "summary": 173,
          "reduction_percent": 82.2
        }
      },
      "Hunter": {
        "summary": "<p>The Greedy Emissary event, running from July 1st to July 29th, introduces Treasure Goblins in Stormwind, Orgrimmar, Dornogal, and Undermine, offering new rewards like the Inarius' Charger mount. Currency earned, Hellstone Shards, can be exchanged for hellish armor sets, including recolors of classic Tier 2 sets, and other items.</p>\n\n<p>The Collector's Bounty buff also activates during this period, increasing drop rates by up to 10x (and some up to 25x) for pre-Dragonflight legacy mounts, along with doubled transmog loot rates in legacy raids and dungeons. Timewalking content and pets/toys are excluded.</p>\n\n<p>Portals will spawn hourly in Dornogal, Orgrimmar, and Stormwind. In the Undermine, portals can spawn from killing rares, defeating bosses in the Liberation of Undermine raid, or during Portal Storms that occur every 15 minutes and feature enhanced affixes.</p>\n\n<p>Treasure Goblins will now have affixes indicated by icons, which can be customized using Elixirs thrown at their summoning portals. These Elixirs add various effects, some beneficial (like the Rich Elixir granting increased Haste and Movement Speed), and others detrimental, potentially spawning additional enemies or environmental hazards.</p>",
        "word_stats": {
          "original": 972,
          "summary": 177,
          "reduction_percent": 81.8
        }
      },
      "Warlock": {
        "summary": "*   **Greedy Emissary Event:** Treasure Goblins are more frequent in Stormwind, Orgrimmar, Dornogal, and Undermine.\n    *   Earn Hellstone Shards from Hellcaller Chests dropped by Treasure Goblins and event activities.\n    *   Hellcaller Chests may contain Valorstones and other items.\n    *   Your first ten Hellcaller Chests are guaranteed to yield Hellstone Shards.\n    *   Exchange Hellstone Shards for rewards, including recolored Tier 2 armor sets.\n*   **Collector's Bounty:** Increased drop rates for pre-Dragonflight legacy mounts (up to 10x, some 25x) and doubled transmog loot in legacy raids and dungeons.\n*   **Portals:** Spawn hourly in Stormwind, Orgrimmar, and Dornogal. In the Undermine, killing rares or certain raid bosses can trigger portals, and Portal Storms spawn additional portals with affixes.\n*   **Treasure Goblin Affixes:** Treasure Goblins have affixes indicated by icons. Elixirs can be thrown at summoning portals to customize these affixes, potentially increasing the number of goblins that spawn.",
        "word_stats": {
          "original": 972,
          "summary": 145,
          "reduction_percent": 85.1
        }
      },
      "Death Knight": {
        "summary": "<ul><li>The <strong>Greedy Emissary event</strong> returns from July 1st to July 29th, featuring Treasure Goblins in Stormwind, Orgrimmar, Dornogal, and Undermine.</li><li>Players can earn <strong>Hellstone Shards</strong> from Hellcaller Chests to purchase rewards, including recolors of classic Tier 2 armor sets for Death Knights.</li><li>The <strong>Collector's Bounty buff</strong> also runs concurrently, increasing loot drop rates by up to 10x (and some up to 25x) and doubling transmog loot drops in pre-Dragonflight legacy raids and dungeons.</li><li>Portals spawn hourly in Stormwind, Orgrimmar, and Dornogal. In the Undermine, portals can be triggered by killing rares or defeating certain bosses in the Liberation of Undermine raid, with a chance to spawn Treasure Goblins.</li><li>Portal Storms in the Undermine can spawn five additional portals with enhanced affixes.</li><li>Treasure Goblins can have various affixes applied, which can be customized using Elixirs on summoning portals. These elixirs add affixes like Arcane, Blistering, Connected, Cursing, Deafening, Explosive, Healthy, Magma, Rallying, Rich, Storming, Tempestuous, Trapper, and Windforce.</li></ul>",
        "word_stats": {
          "original": 972,
          "summary": 152,
          "reduction_percent": 84.4
        }
      },
      "Druid": {
        "summary": "<ul>\n  <li>The Greedy Emissary event returns from July 1 to July 29, featuring increased Treasure Goblin spawns in Stormwind, Orgrimmar, Dornogal, and Undermine.</li>\n  <li>Players earn Hellstone Shards from Hellcaller Chests dropped by Treasure Goblins and event activities.</li>\n  <li>Hellstone Shards can be exchanged for rewards, including recolors of classic Tier 2 armor sets, such as the Druid set.</li>\n  <li>The Collector's Bounty buff, also active July 1-29, increases drop rates for pre-Dragonflight legacy mounts and specific raid items by up to 10x (or 25x for some), and doubles transmog loot in legacy dungeons and raids.</li>\n  <li>In the Undermine, Treasure Goblins can spawn from killing rares or defeating specific bosses in the Liberation of Undermine raid.</li>\n  <li>Portal Storms in the Undermine can spawn additional portals with enhanced affixes and a chance for more Treasure Goblins.</li>\n  <li>Players can influence Treasure Goblin spawns by using Elixirs on summoning portals, which add specific affixes and increase the number of goblins.</li>\n</ul>",
        "word_stats": {
          "original": 972,
          "summary": 155,
          "reduction_percent": 84.1
        }
      },
      "Monk": {
        "summary": "<ul><li>Monks can obtain recolored Tier 2 armor sets from Hellhunter Baranar in Dornogal by exchanging Hellstone Shards earned during the Greedy Emissary event.</li><li>Hellstone Shards are acquired from Hellcaller Chests, which drop from Treasure Goblins and during event activities.</li><li>The Collector's Bounty buff, active from July 1-29, increases drop rates for pre-Dragonflight legacy mounts by up to 10x (and one by 25x) and doubles transmog loot drops in legacy raids and dungeons.</li></ul>",
        "word_stats": {
          "original": 972,
          "summary": 70,
          "reduction_percent": 92.8
        }
      },
      "Evoker": {
        "summary": "<ul>\n  <li>The Greedy Emissary event runs from July 1 to July 29, featuring increased Treasure Goblin spawns in Stormwind, Orgrimmar, Dornogal, and Undermine.</li>\n  <li>Hellstone Shards are earned from Treasure Goblins and event activities, exchangeable for rewards including recolors of classic Tier 2 armor sets, with Evoker recolors available.</li>\n  <li>The Collector's Bounty buff also runs concurrently, increasing drop rates for pre-Dragonflight mounts, the Eye of Sulfuras, Golden Hearthstone Card, Bindings of the Windseeker, Warglaives of Azzinoth, and Thori'dal by up to 10x (or 25x for specific items) and doubling transmog drop rates in legacy raids and dungeons.</li>\n  <li>Portals spawn hourly in Stormwind, Orgrimmar, and Dornogal.</li>\n  <li>In the Undermine, portals can be triggered by killing rares or defeating specific bosses in the Liberation of Undermine raid. Portal Storms also spawn additional portals with enhanced affixes.</li>\n  <li>Treasure Goblins can have various affixes, which can be influenced by Elixirs tossed at summoning portals to customize goblin encounters and rewards.</li>\n</ul>",
        "word_stats": {
          "original": 972,
          "summary": 156,
          "reduction_percent": 84
        }
      },
      "Demon Hunter": {
        "summary": "<ul>\n<li>The Greedy Emissary event returns July 1st - July 29th, featuring increased Treasure Goblin spawns in Stormwind, Orgrimmar, Dornogal, and the Undermine.</li>\n<li>New rewards include the Inarius' Charger mount.</li>\n<li>Hellstone Shards are the currency, earned from Hellcaller Chests dropped by Treasure Goblins and event activities.</li>\n<li>Hellcaller Chests can also contain Valorstones.</li>\n<li>The Collector's Bounty buff also runs July 1st - July 29th, increasing drop rates by up to 10x (and one item 25x) for pre-Dragonflight mounts, Eye of Sulfuras, Golden Hearthstone Card, Bindings of the Windseeker, Warglaives of Azzinoth, and Thori'dal, The Stars' Fury in legacy raids and dungeons. Transmog loot drop rates are doubled.</li>\n<li>Demon Hunter armor set recolors of classic Tier 2 sets are available as rewards during the Greedy Emissary event.</li>\n</ul>",
        "word_stats": {
          "original": 972,
          "summary": 126,
          "reduction_percent": 87
        }
      },
      "Delves": {
        "summary": "The Greedy Emissary event runs from July 1st to July 29th, featuring increased Treasure Goblin spawns in Stormwind, Orgrimmar, Dornogal, and the Undermine. Players can earn Hellstone Shards from Hellcaller Chests dropped by Treasure Goblins to purchase rewards, including recolored Tier 2 armor sets, from Hellhunter Baranar in Dornogal.\n\nIn the Undermine, Treasure Goblins can spawn from killing rares or defeating certain bosses in the Liberation of Undermine raid. Portal Storms at the quarter-hour can spawn five additional portals with enhanced Affixes and a chance for Treasure Goblins.\n\nPlayers can influence the Affixes of Treasure Goblins by using Elixirs on their summoning portals, which can increase the number of goblins that spawn. A table details various Affixes and their corresponding Elixirs and effects.\n\nThe Collector's Bounty buff also runs during this period, increasing the drop rates of pre-Dragonflight legacy mounts by up to 25 times and doubling transmog loot drops in legacy raids and dungeons. Timewalking content and pets/toys are excluded. The Collector's Bounty buff can be toggled on and off at any innkeeper.",
        "word_stats": {
          "original": 972,
          "summary": 174,
          "reduction_percent": 82.1
        }
      },
      "Raiding": {
        "summary": "<ul><li>The Collector's Bounty buff increases drop rates for legacy mounts and specific raid items from pre-Dragonflight content by up to 10x (25x for some), and doubles transmog loot drops in legacy raids and dungeons.</li>\n<li>Timewalking content, Pets, and Toys are excluded from the Collector's Bounty buff.</li>\n<li>Portals spawn every 60 minutes on the hour in Stormwind, Orgrimmar, and Dornogal.</li>\n<li>In the Undermine, killing rares can trigger portals, and defeating certain bosses in the Liberation of Undermine raid has a chance to spawn portals.</li>\n<li>Portal Storms in the Undermine, occurring every quarter-hour, can spawn five enhanced portals with additional affixes.</li>\n<li>Treasure Goblins can have various affixes indicated by icons, and players can influence these affixes using special Elixirs on summoning portals.</li>\n<li>Hellstone Shards are earned from Treasure Goblins and event activities, redeemable for rewards like recolored Tier 2 armor sets.</li></ul>",
        "word_stats": {
          "original": 972,
          "summary": 139,
          "reduction_percent": 85.7
        }
      },
      "M+": {
        "summary": "The Greedy Emissary event returns July 1st to July 29th. Treasure Goblins will appear in Stormwind, Orgrimmar, Dornogal, and The Undermine.\n\nIn The Undermine, portals can spawn from killing rares or defeating certain bosses in the Liberation of Undermine raid. Portal Storms at the quarter-hour will spawn five additional portals with enhanced affixes, and may spawn Treasure Goblins.\n\nTreasure Goblins will have affixes indicated by icons. Players can use Elixirs on portals to customize these affixes, which in turn increases the number of goblins that can spawn. Affixes include effects like Arcane Overloads, Shadowflame damage, spawning Fallen, and creating pools of money that grant Haste and Movement Speed.\n\nHellstone Shards are earned from Hellcaller Chests dropped by Treasure Goblins and through event activities. These shards can be exchanged for rewards like recolored Tier 2 armor sets. Hellcaller Chests may also contain Valorstones and other items.",
        "word_stats": {
          "original": 972,
          "summary": 145,
          "reduction_percent": 85.1
        }
      },
      "PvP": {
        "summary": "The Greedy Emissary event returns from July 1st to July 29th, featuring increased Treasure Goblin spawns in Stormwind, Orgrimmar, Dornogal, and Undermine. Players can earn Hellstone Shards from Hellcaller Chests dropped by these goblins and other event activities. These shards can be exchanged for diabolical rewards, including recolored Tier 2 armor sets, from Hellhunter Baranar in Dornogal.\n\nThe Collector's Bounty buff also runs concurrently, increasing drop rates for pre-Dragonflight legacy mounts by up to 10x (and some specific items like the Eye of Sulfuras by 25x) and doubling transmog loot drop chances in legacy raids and dungeons. This buff is toggled via innkeepers.\n\nPortals spawn hourly in Stormwind, Orgrimmar, and Dornogal. In the Undermine, portals can be triggered by killing rares or during the Liberation of Undermine raid, with Portal Storms spawning additional, affixed portals every hour. Treasure Goblins in the Undermine may also spawn with various affixes, which can be customized using Elixirs, potentially increasing the number of goblins spawned.",
        "word_stats": {
          "original": 972,
          "summary": 161,
          "reduction_percent": 83.4
        }
      },
      "Open World": {
        "summary": "<ul>\n<li>The Greedy Emissary event returns July 1-29, featuring increased Treasure Goblin spawns in Stormwind, Orgrimmar, Dornogal, and the Undermine.</li>\n<li>Players can earn Hellstone Shards from Treasure Goblins and Hellcaller Chests to purchase new rewards, including recolors of Tier 2 armor sets and the Inarius' Charger mount.</li>\n<li>Portals spawn hourly on the hour in Stormwind (Docks), Orgrimmar (outside entrance), and Dornogal (southeast exit).</li>\n<li>In the Undermine, Portals can be triggered by killing rare enemies or defeating certain bosses in the Liberation of Undermine raid. Portal Storms occur at the quarter-hour, spawning additional Portals with affixes.</li>\n<li>Treasure Goblins now have visible affixes, and players can use Elixirs at summoning portals to customize these affixes, potentially increasing the number of goblins that spawn.</li>\n<li>The Collector's Bounty buff also runs July 1-29, increasing drop rates for pre-Dragonflight legacy mounts (up to 10x) and doubling transmog loot chances in pre-Dragonflight raids and dungeons.</li>\n<li>The Collector's Bounty buff can be toggled on or off at any innkeeper.</li>\n</ul>",
        "word_stats": {
          "original": 972,
          "summary": 163,
          "reduction_percent": 83.2
        }
      },
      "General": {
        "summary": "The Greedy Emissary event runs July 1-29, featuring more Treasure Goblins in capital cities and Dornogal, offering rewards like the Inarius' Charger mount.\n\nThe Collector's Bounty buff also runs during this time, increasing legacy mount drop rates by up to 10x (and some specific items up to 25x), and doubling transmog loot in pre-Dragonflight raids/dungeons.\n\nPortals spawn hourly in Stormwind, Orgrimmar, and Dornogal. Undermine has unique portal mechanics, including Portal Storms. Treasure Goblins can be customized with Elixirs, adding various affixes. Hellstone Shards, earned from chests and event activities, can be exchanged for diabolical rewards, including recolored Tier 2 armor sets.",
        "word_stats": {
          "original": 972,
          "summary": 101,
          "reduction_percent": 89.6
        }
      }
    }
  },
  {
    "id": "break-through-the-mists-of-pandaria-classic-on-july-21",
    "title": "Break Through the Mists of Pandaria Classic on July 21",
    "date": "2025-06-25",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24213954/break-through-the-mists-of-pandaria-classic-on-july-21",
    "summaries": {
      "Warrior": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Mage": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Rogue": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Priest": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Paladin": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Hunter": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Warlock": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Death Knight": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Druid": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Monk": {
        "summary": "The Mists of Pandaria Classic pre-patch introduces the Monk class. Monks can specialize as Windwalker for damage, Mistweaver for healing, or Brewmaster for tanking. The Pandaren starting experience will also be available.",
        "word_stats": {
          "original": 895,
          "summary": 32,
          "reduction_percent": 96.4
        }
      },
      "Evoker": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Demon Hunter": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Delves": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Raiding": {
        "summary": "Mogu'shan Vaults, the first raid tier for Mists of Pandaria Classic, opens on July 31st. This raid features 6 bosses and is available in 10-player and 25-player formats, with both Normal and Heroic difficulties. The raid is located in Kun Lai Summit and is designed for level 90 characters.",
        "word_stats": {
          "original": 895,
          "summary": 49,
          "reduction_percent": 94.5
        }
      },
      "M+": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "PvP": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "Open World": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 895,
          "summary": 6,
          "reduction_percent": 99.3
        }
      },
      "General": {
        "summary": "Mists of Pandaria Classic launches July 21, with a pre-patch on July 1. This update introduces the Pandaren race and Monk class. Players can earn a special mount in modern WoW by completing the Pandaren starting experience. The Mogu'shan Vaults raid opens on July 31. The content focuses on Mists of Pandaria Classic, not current retail expansions like The War Within.",
        "word_stats": {
          "original": 895,
          "summary": 61,
          "reduction_percent": 93.2
        }
      }
    }
  },
  {
    "id": "mists-of-pandaria-classic-a-profession-primer",
    "title": "Mists of Pandaria Classic: A Profession Primer",
    "date": "2025-06-25",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24215172/mists-of-pandaria-classic-a-profession-primer",
    "summaries": {
      "Warrior": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Mage": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Rogue": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Priest": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Paladin": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Hunter": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Warlock": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Death Knight": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Druid": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Monk": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Evoker": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Demon Hunter": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Delves": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "Raiding": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "M+": {
        "summary": "Please refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 6,
          "reduction_percent": 99.8
        }
      },
      "PvP": {
        "summary": "<ul><li>Blacksmithing, Leatherworking, and Tailoring recipes for PvP gear will require Spirit of Harmony to learn.</li><li>Blacksmiths can purchase PvP armor recipes from vendors in Shrine of Two Moons or Shrine of Seven Stars.</li><li>Leatherworkers can purchase PvP armor recipes from vendors in Shrine of Two Moons or Shrine of Seven Stars.</li></ul>",
        "word_stats": {
          "original": 3254,
          "summary": 49,
          "reduction_percent": 98.5
        }
      },
      "Open World": {
        "summary": "The provided blog post details profession changes and new features for Mists of Pandaria, which is not relevant to The War Within or later retail WoW content. \n\nPlease refer to the general summary.",
        "word_stats": {
          "original": 3254,
          "summary": 33,
          "reduction_percent": 99
        }
      },
      "General": {
        "summary": "This blog post details professions in Mists of Pandaria. Key features include:\n\n*   **Spirit of Harmony:** A new bind-on-pickup material used across professions for crafting epic items, recipes, and special bonuses.\n*   **Tools of the Trade:** Profession-specific tools will provide skill bonuses rather than being equipped.\n*   **New Recipes and Materials:** Introduces Golden Lotus, Ghost Iron, Trillium, Exotic Leather, and various new herbs.\n*   **Profession Specializations:** Cooking allows specialization in different \"Ways\" (Brew, Grill, Oven, Pot, Steamer, Wok).\n*   **Engineering Mounts:** Features new rocket mounts and the Blingtron 4000.\n*   **Archaeology:** Expanded dig sites and new fragment types for Mogu and Pandaren.",
        "word_stats": {
          "original": 3254,
          "summary": 102,
          "reduction_percent": 96.9
        }
      }
    }
  }
]