[
  {
    "id": "join-world-of-warcraft-at-gamescom-2025",
    "title": "Join World of Warcraft at gamescom 2025!",
    "date": "2025-06-23",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24215994/join-world-of-warcraft-at-gamescom-2025",
    "summary": "World of Warcraft is heading to gamescom 2025 in Cologne, Germany, from August 20-24. The WoW booth in Hall 8 will feature community celebrations including Mythic Dungeon and Arena Showcases, cosplay, and developer/creator meet-and-greets. Attendees can expect exclusive news and updates on the next Worldsoul Saga chapter, \"Midnight,\" directly from the developers, plus surprises. Those unable to attend can follow the official news site and social media for coverage.",
    "word_stats": {
      "original": 124,
      "summary": 69,
      "reduction_percent": 44.4
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>\n    World of Warcraft will be at <strong>gamescom 2025</strong> from August 20-24 in Cologne, Germany. Attendees can anticipate exclusive news and updates on <em>Midnight</em>, the next chapter of the Worldsoul Saga, directly from the development team. While the blog post highlights a Mythic Dungeon and Arena Showcase, it does not specify any content directly relevant to the Warrior class.\n</p>",
        "word_stats": {
          "original": 124,
          "summary": 60,
          "reduction_percent": 51.6
        }
      },
      "Mage": {
        "summary": "<p>World of Warcraft will be at <strong>gamescom 2025</strong> (August 20-24) in Cologne, Germany. Attendees can expect news and updates on <em>The Worldsoul Saga: Midnight</em> directly from the developers. While specific class content isn't detailed, the event will feature a Mythic Dungeon and Arena Showcase, offering potential insights relevant to <strong>Mages</strong> in Retail WoW and beyond.</p>",
        "word_stats": {
          "original": 124,
          "summary": 55,
          "reduction_percent": 55.6
        }
      },
      "Rogue": {
        "summary": "<p>At <b>gamescom 2025</b>, World of Warcraft will reveal exclusive news and updates on <b>Midnight</b>, the next chapter of the Worldsoul Saga. Rogues can anticipate potential class-relevant information during this event, which will feature a Mythic Dungeon and Arena Showcase.</p>",
        "word_stats": {
          "original": 124,
          "summary": 39,
          "reduction_percent": 68.5
        }
      },
      "Priest": {
        "summary": "<p>\nWorld of Warcraft will be at gamescom 2025 from August 20-24 in Cologne, Germany. Attendees can expect exclusive news and updates on the next expansion, <em>Midnight</em>, directly from the developers. While no specific Priest-related content is mentioned, the event promises general community celebration, including a Mythic Dungeon and Arena Showcase, which could potentially feature Priest gameplay.\n</p>",
        "word_stats": {
          "original": 124,
          "summary": 58,
          "reduction_percent": 53.2
        }
      },
      "Paladin": {
        "summary": "<p>World of Warcraft will be at <strong>gamescom 2025</strong>, August 20-24 in Cologne, Germany. Expect exclusive news and updates on <strong>Midnight</strong>, the next chapter of the Worldsoul Saga, directly from the developers. While specific class information for Paladins isn't detailed, the event will feature showcases and meet-and-greets, potentially offering insights relevant to all classes in Retail WoW.</p>",
        "word_stats": {
          "original": 124,
          "summary": 56,
          "reduction_percent": 54.8
        }
      },
      "Hunter": {
        "summary": "<p>World of Warcraft will be at <b>gamescom 2025</b> from August 20-24 in Cologne, Germany.</p>\n<p>Expect exclusive news and updates regarding <b>Midnight</b>, the next chapter of the Worldsoul Saga, directly from the development team. While the post doesn't mention specific class details, the focus on the upcoming expansion suggests potential content relevant to all classes, including Hunters.</p>\n<p>Activities include Mythic Dungeon and Arena Showcases, and Developer Meet and Greets.</p>",
        "word_stats": {
          "original": 124,
          "summary": 68,
          "reduction_percent": 45.2
        }
      },
      "Warlock": {
        "summary": "<p>World of Warcraft will be at gamescom 2025, August 20-24 in Cologne, Germany. Expect exclusive news and updates directly from the development team regarding the next chapter of the Worldsoul Saga, <strong>Midnight</strong>. While the post doesn't mention Warlocks specifically, these updates will cover content relevant to all classes in Retail WoW and future expansions.</p>",
        "word_stats": {
          "original": 124,
          "summary": 54,
          "reduction_percent": 56.5
        }
      },
      "Death Knight": {
        "summary": "<p>World of Warcraft will be at <b>gamescom 2025</b>, August 20-24 in Cologne, Germany. Attendees can expect exclusive news and updates on the next chapter of the Worldsoul Saga, <b>Midnight</b>. While the blog post does not specifically mention Death Knights, the event promises a Mythic Dungeon and Arena Showcase, which are core activities for the class.</p>",
        "word_stats": {
          "original": 124,
          "summary": 55,
          "reduction_percent": 55.6
        }
      },
      "Druid": {
        "summary": "<p>World of Warcraft will feature prominently at gamescom 2025, showcasing the upcoming <strong>Worldsoul Saga: Midnight</strong>. Attendees can expect developer insights and surprises. While the post doesn't specifically mention Druid-related content, the overall announcement of new information for the next chapter of WoW is relevant to all classes, including Druids, in the Retail game.</p>",
        "word_stats": {
          "original": 124,
          "summary": 53,
          "reduction_percent": 57.3
        }
      },
      "Monk": {
        "summary": "<p>World of Warcraft will be at Gamescom 2025, from August 20-24 in Cologne, Germany. Attendees can expect news and updates on the upcoming expansion, <em>Midnight</em>, directly from the development team. While the post doesn't specifically mention Monk-related content, the event will feature a Mythic Dungeon and Arena Showcase, which could potentially include discussions or gameplay relevant to all classes.</p>",
        "word_stats": {
          "original": 124,
          "summary": 59,
          "reduction_percent": 52.4
        }
      },
      "Evoker": {
        "summary": "<p>World of Warcraft will be at <strong>gamescom 2025</strong> from August 20-24 in Cologne, Germany. Attendees can expect exclusive news and updates on the next chapter of the World of Warcraft®: Worldsoul Saga—<strong>Midnight</strong>—directly from the development team.  The event will feature a Mythic Dungeon and Arena Showcase, which may be relevant to Evoker players.</p>",
        "word_stats": {
          "original": 124,
          "summary": 53,
          "reduction_percent": 57.3
        }
      },
      "Demon Hunter": {
        "summary": "<p>World of Warcraft heads to gamescom 2025 (August 20-24) for the <strong>Worlds</strong>oul Saga's next chapter, <em>Midnight</em>. Attendees can expect developer updates and surprises at the Hall 8 booth. While the blog post doesn't specifically mention Demon Hunter content, the focus on upcoming expansions and events is relevant to all classes in Retail WoW and The War Within and later.</p>",
        "word_stats": {
          "original": 124,
          "summary": 59,
          "reduction_percent": 52.4
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>World of Warcraft will be at Gamescom 2025, showcasing community events like a Mythic Dungeon and Arena Showcase. The event will feature exclusive news and updates on <strong>The War Within</strong> and the upcoming expansion <strong>Midnight</strong>, directly from the development team.</p>",
        "word_stats": {
          "original": 124,
          "summary": 40,
          "reduction_percent": 67.7
        }
      },
      "Raiding": {
        "summary": "<p>World of Warcraft will be at <strong>gamescom 2025</strong>, August 20-24 in Cologne, Germany.</p>\n<p>Attendees can expect <strong>exclusive news and updates</strong> on the upcoming Worldsoul Saga chapter, <strong>Midnight</strong>, directly from the development team. While the post mentions a Mythic Dungeon and Arena Showcase, it does not provide details on any specific raid content for <em>The War Within</em> or later expansions.</p>",
        "word_stats": {
          "original": 124,
          "summary": 59,
          "reduction_percent": 52.4
        }
      },
      "M+": {
        "summary": "<p>World of Warcraft will host a <strong>Mythic Dungeon and Arena Showcase</strong> at gamescom 2025, happening August 20-24 in Cologne, Germany. This event will feature exclusive news and updates on <strong>Midnight</strong>, the next chapter of the Worldsoul Saga, directly from the development team. Content relevant to Retail WoW and later is emphasized.</p>",
        "word_stats": {
          "original": 124,
          "summary": 51,
          "reduction_percent": 58.9
        }
      },
      "PvP": {
        "summary": "<p>World of Warcraft will feature an <b>Arena Showcase</b> at gamescom 2025, running August 20-24 in Cologne, Germany.</p>\n<p>Attendees can expect exclusive news and updates directly from the development team regarding the upcoming expansion, <i>The Worldsoul Saga: Midnight</i>.</p>",
        "word_stats": {
          "original": 124,
          "summary": 37,
          "reduction_percent": 70.2
        }
      },
      "Open World": {
        "summary": "<p>World of Warcraft will be at gamescom 2025, offering <b>exclusive news and updates</b> on <b>The Worldsoul Saga</b>, including <b>Midnight</b>. The event runs from August 20-24 in Cologne, Germany, featuring developer meet-and-greets and community celebrations. Updates will also be available on the official news site and social media for those unable to attend.</p>",
        "word_stats": {
          "original": 124,
          "summary": 52,
          "reduction_percent": 58.1
        }
      }
    }
  },
  {
    "id": "hotfixes-june-20-2025",
    "title": "Hotfixes: June 20, 2025",
    "date": "2025-06-21",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24201420/hotfixes-june-20-2025",
    "summary": "This World of Warcraft blog post details numerous hotfixes across various game versions, including The War Within, Cataclysm Classic, and Season of Discovery. Updates address class balance issues, item fixes, quest resolutions, and player versus player adjustments. Notable changes include class ability fixes for Paladins and Shamans, threat generation increases for tanks, and several PvP-specific tuning adjustments for classes like Hunters, Mages, and Warriors. Season of Discovery also received several specific bug fixes and balance adjustments.",
    "word_stats": {
      "original": 3838,
      "summary": 76,
      "reduction_percent": 98
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>Hotfixes for <b>The War Within</b> era have been released:</p>\n<ul>\n  <li><strong>Warrior:</strong></li>\n  <ul>\n    <li><strong>Arms:</strong> Whirlwind damage increased by 100%. Colossus Smash can no longer be parried.</li>\n    <li><strong>Fury:</strong> Whirlwind damage increased by 120%. Thunder Clap damage increased by 25%. Odyn’s Fury damage increased by 30%. Mountain Thane: Thunder Blast damage increased by 25%.</li>\n    <li><strong>Protection:</strong> Fixed a bug causing Shield Charge to deal damage extra times or to targets near their starting position.</li>\n  </ul>\n  <li><strong>General:</strong> Threat generation for all tank specializations increased by 15%.</li>\n  <li><strong>PvP:</strong> Arms Execute damage reduced by 15%; Rend damage increased by 15%. Wrecking Throw and Shattering Throw shield damage increases are 75% less effective.</li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 106,
          "reduction_percent": 97.2
        }
      },
      "Mage": {
        "summary": "<p>Here's a summary of the Mage-related hotfixes from the provided blog post:</p>\n\n<ul>\n  <li><b>Frost Mage:</b> All damage dealt by Frost Mages has been increased by 3% (does not affect PvP).</li>\n  <li><b>Fire Mage (PvP):</b> Pyroblast, Fire Blast, Fireball, and Scorch damage have been increased by 15-20% in PvP combat.</li>\n  <li><b>Mage PvP Talent:</b> The Overpowered Barrier talent for both Frostfire and Fire Mages now causes Blazing Barrier to reflect 40% of damage absorbed, down from 60%.</li>\n  <li><b>Mage PvP Talent:</b> Frostfire's Isothermic Core talent now causes Meteor to call down a Comet Storm at 200% effectiveness, reduced from 250%.</li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 97,
          "reduction_percent": 97.5
        }
      },
      "Rogue": {
        "summary": "<p>The latest hotfixes for World of Warcraft, relevant to The War Within and beyond, include a <strong>5% all damage increase for Subtlety Rogues</strong> in non-PvP content (May 27, 2025).</p>\n<p>Additionally, PvP-specific changes for Rogues include an increase to <strong>Combat Stamina</strong> for Outlaw Rogues, boosting Stamina by 18% in PvP combat (May 27, 2025).</p>\n<p>Other Rogue-related fixes include an issue preventing <strong>Blade Flurry</strong> from dealing increased damage to targets with the Fazed debuff, and fixes for Blade Flurry's target count and damage with the Deft Maneuvers talent (April 30, 2025). For Assassination, <strong>Kingsbane</strong> can no longer be parried (April 30, 2025). Season of Discovery notes mention that the <strong>Scarlet Enclave damage Rogue 2-piece set bonus</strong> will now behave consistently (May 22, 2025), and <strong>Carnage</strong> will no longer fall off prematurely with Cutthroat's Garrote (May 16, 2025).</p>",
        "word_stats": {
          "original": 3838,
          "summary": 135,
          "reduction_percent": 96.5
        }
      },
      "Priest": {
        "summary": "Here's a summary of the hotfixes relevant to Priests in Retail WoW:\n\n<ul>\n  <li><b>Discipline:</b> Resolved an issue with Power Word: Shield tracking on the Cooldown Manager to correctly show cooldowns instead of duration.</li>\n  <li><b>Holy:</b> Fixed an issue where Prayer of Healing could be displayed on the Cooldown Manager even when not talented into it.</li>\n  <li><b>Shadow:</b> Psychic Link now deals 35% of damage to targets afflicted by Vampiric Touch (was 30%). Halo damage increased by 30%. Voidweaver: Entropic Rift damage increased by 12%.</li>\n  <li><b>PvP (Discipline):</b> Power Word: Radiance healing is no longer reduced by 10% in PvP. Ultimate Penitence damage and healing increased by 35% in PvP.</li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 107,
          "reduction_percent": 97.2
        }
      },
      "Paladin": {
        "summary": "<p>Recent hotfixes for <span style=\"font-weight: bold;\">Paladins</span> in Retail WoW and The War Within include:</p>\n<ul>\n    <li><b>Templar</b>: Resolved an issue where <span style=\"font-style: italic;\">Divine Hammer</span> and <span style=\"font-style: italic;\">Shield of the Righteous</span> were not casting <span style=\"font-style: italic;\">Empyrean Hammer</span>.</li>\n    <li><b>Holy</b>: Increased healing for <span style=\"font-style: italic;\">Lightsmith: Blessing of the Forge</span> by 15% and <span style=\"font-style: italic;\">Lightsmith: Hammer and Anvil</span> by 20%.</li>\n    <li><b>Retribution</b>: Fixed an issue with the interaction between <span style=\"font-style: italic;\">Avenging Wrath</span> and <span style=\"font-style: italic;\">Radiant Glory</span>.</li>\n    <li><b>Protection</b>: Added support for <span style=\"font-style: italic;\">Sentinel</span> and several PvP talents to the Cooldown Manager.</li>\n    <li><b>Season of Discovery</b>: The Scarlet Enclave Protection 6-set bonus now correctly allows the use of <span style=\"font-style: italic;\">Avenging Wrath</span> while under the effects of Forbearance.</li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 118,
          "reduction_percent": 96.9
        }
      },
      "Hunter": {
        "summary": "<p>Recent hotfixes for World of Warcraft include updates relevant to Hunters:</p>\n<ul>\n    <li><strong>Survival Hunter:</strong> Explosive Shot and Fury of the Eagle damage have been increased by 15% and 25% respectively.</li>\n    <li><strong>Marksmanship Hunter:</strong> An issue preventing Hunters from dying while channeling Rapid Fire from keeping them in combat upon resurrecting has been fixed.</li>\n    <li><strong>Hunter PvP:</strong> Master's Call has been adjusted to correctly apply its effects to the Hunter and their pet, regardless of target. Command Pet now retains overridden spells in arenas. Survival Hunter's Raptor Strike and Mongoose Bite no longer fail to deal damage on targets in breakable crowd control, and Flanking Strike correctly fails to cast if the pet is rooted or crowd-controlled. Marksmanship Hunter's Spotter's Marks now correctly obey PvP multipliers.</li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 124,
          "reduction_percent": 96.8
        }
      },
      "Warlock": {
        "summary": "<p>Warlock hotfixes include:<p>\n<ul>\n<li>Destruction Warlocks: Specific Diabolist talents such as Ruination, Wicked Cleave, Chaos Salvo, and Felseeker received damage increases. Gloom of Nathreza was adjusted to increase single-target spell damage taken by Havoc targets.</li>\n<li>Hellcaller Warlocks: Fixed an issue where Vile Taint triggered Blackened Soul more than intended and a bug where Blackened Soul wouldn't stack correctly with rapid Soul Shard spender casts. Wither pandemic refresh issues were also addressed.</li>\n<li>Demonology Warlocks: Addressed UI issues with Shadow Bolt and Hand of Gul'dan appearing on the cooldown bar without the necessary talents, and glow issues with Hand of Gul'dan and Chaos Bolt when Demonic Art was active.</li>\n<li>PvP: Demon Skin's armor increase is now 30% more effective in PvP combat.</li>\n<li>Season of Discovery: The Naxxramas 4-piece damage bonus now correctly applies to Corruption from the Scarlet Enclave tank 2-piece, and the Scarlet Enclave Tank 4-piece heal from Corruption ticks now correctly occurs from the Naxxramas 4-piece instant tick.</li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 159,
          "reduction_percent": 95.9
        }
      },
      "Death Knight": {
        "summary": "<p>Recent hotfixes for <em>The War Within</em> and later have focused on class balance and PvE adjustments. While no direct Death Knight class changes are listed, all tank specializations saw a 15% increase in threat generation to improve their ability to hold aggro. In PvP, Death Knights received several buffs: Improved Death Strike is no longer reduced by 50%, Frost Strike and Obliterate damage were increased by 12%, and Unholy's Magus of the Dead Shadow Bolt damage is no longer reduced by 50%, with Festering Strike damage increased by 100%.</p>",
        "word_stats": {
          "original": 3838,
          "summary": 89,
          "reduction_percent": 97.7
        }
      },
      "Druid": {
        "summary": "<p>Druid class hotfixes primarily focus on UI elements for Retail WoW. <b>Guardian Druids</b> now have Bristling Fur and several PvP talents displayed on the Cooldown Manager, with Tooth and Claw added to Tracked Buffs. Maul only appears on the Cooldown Manager if Tooth and Claw or Ravage is known.</p>",
        "word_stats": {
          "original": 3838,
          "summary": 49,
          "reduction_percent": 98.7
        }
      },
      "Monk": {
        "summary": "Here are the hotfixes relevant to the Monk class:\n\n*   <b>Zen Flight</b> no longer restricts casting.\n*   Fixed an issue that caused physical damage modifiers to reduce the healing magical damage transfers through <b>Ancient Teachings</b>.\n*   Fixed an issue that caused <b>Aspect of Harmony</b> to not apply to targets with a healing absorb present.\n*   Fixed an issue that caused <b>Unity Within</b> to not automatically if no enemy targets are present when the channel ends for <b>Windwalker Monks</b>.\n*   (PvP) Fixed an issue that caused <b>Feather Feet</b> to not function with <b>Song of Chi-Ji</b>.",
        "word_stats": {
          "original": 3838,
          "summary": 94,
          "reduction_percent": 97.6
        }
      },
      "Evoker": {
        "summary": "<p>Recent hotfixes for World of Warcraft have introduced several changes impacting Evokers:</p>\n<ul>\n  <li><b>Augmentation Evoker:</b> The Nerub-ar Palace 2-piece set bonus now increases Upheaval damage by 15% (was 30%) and Eruption damage by 15% per stack (was 30%). Developers noted this set became stronger than intended due to recent buffs to Augmentation's personal damage.</li>\n  <li><b>Preservation Evoker:</b> Healing for all spells and abilities has been increased by 4% (excluding PvP). Specific healing buffs include Living Flame (+30%), Spiritbloom (+20%), and Echo's base healing (+100%).</li>\n  <li><b>Augmentation Evoker (Bug Fixes):</b> Addressed an issue where Mass Eruption would not benefit from other effects that increased Eruption's damage. Also fixed an issue where Mass Eruption and Bombardments could trigger from Eruptions cast by Overlord without the Breath of Eons talent.</li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 126,
          "reduction_percent": 96.7
        }
      },
      "Demon Hunter": {
        "summary": "<p>This blog post details hotfixes for various World of Warcraft content. For Demon Hunters, specific fixes include:</p>\n<ul>\n    <li><b>May 6, 2025:</b>\n        <ul>\n            <li><b>Demon Hunter (General):</b> Fixed an issue with the <i>Aldrachi Reaver</i> where <i>Art of the Glaive</i> stacks weren't correctly tracked on the Cooldown Manager.</li>\n            <li><b>Havoc:</b> Resolved a bug preventing <i>A Fire Inside</i> from dynamically updating the damage bonus for <i>Immolation Aura</i> based on Mastery.</li>\n        </ul>\n    </li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 68,
          "reduction_percent": 98.2
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>Here's a summary of the hotfixes relevant to Delves in The War Within and later:</p>\n<ul>\n  <li><strong>Delves:</strong>\n    <ul>\n      <li>Fixed an issue where the Big Wheel of Cheese would not grant experience to Brann.</li>\n      <li>Fixed an issue where some delve equipment was not requiring player level 80 to be equipped.</li>\n    </ul>\n  </li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 52,
          "reduction_percent": 98.6
        }
      },
      "Raiding": {
        "summary": "The provided blog post details several hotfixes relevant to raiding. Key changes include:\n\n*   **Tank Threat:** A 15% increase to all tank specializations' threat generation to address difficulties in gaining and holding threat.\n*   **Liberation of Undermine:**\n    *   Giga Bombs on Mythic difficulty now have a 30-second longer lifetime for Chrome King Gallywix.\n    *   The minimum player requirement for Fused and Tick-Tock Canisters was reduced to 1 on Normal and Heroic for Chrome King Gallywix.\n    *   Several bosses (Stix Bunkjunker, Scrapmaster, Sprocketmonger Lockenstock, One-Armed Bandit) had their health or abilities adjusted on Mythic and Heroic difficulties.\n*   **Darkflame Cleft:** An issue where a Shuffling Horror could fall through the world was fixed.\n*   **Operation: Mechagon - Workshop:** An issue preventing other D.0.G.s from casting Fiery Jaws when Junkyard D.0.G. was rooted has been addressed.",
        "word_stats": {
          "original": 3838,
          "summary": 134,
          "reduction_percent": 96.5
        }
      },
      "M+": {
        "summary": "<p>This blog post details hotfixes for World of Warcraft, with several entries relevant to M+ content:</p>\n<ul>\n    <li><b>Classes:</b> Addressed issues with Paladin's Divine Hammer/Shield of the Righteous, Shaman's Static Accumulation and Earth/Water Shield interactions with Therazane's Resilience.</li>\n    <li><b>Dungeons and Raids:</b> Fixed issues in Darkflame Cleft (Shuffling Horror falling through world, Wild Wallop visual) and Liberation of Undermine (Giga Bombs lifetime increased on Mythic, player count reduced for certain mechanics).</li>\n    <li><b>Items:</b> Resolved an issue with the D.I.S.C. belt's Cauterizing Bolts not hitting players outside the party.</li>\n    <li><b>Tank Threat:</b> Increased threat generation for all tank specs by 15%.</li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 97,
          "reduction_percent": 97.5
        }
      },
      "PvP": {
        "summary": "<p>PvP hotfixes primarily focus on class adjustments:</p>\n<ul>\n  <li><b>Druid:</b> Balance's Wrath damage increased in PvP.</li>\n  <li><b>Death Knight:</b> Improved Death Strike no longer reduced in PvP; Frost Strike and Obliterate damage increased in PvP; Unholy's Magus of the Dead Shadow Bolt damage no longer reduced in PvP; Festering Strike damage increased in PvP.</li>\n  <li><b>Mage:</b> Fire and Frostfire's Barrier reflection reduced; Fire's Pyroblast, Fire Blast, Fireball, Scorch, and Frostfire Bolt damage increased in PvP.</li>\n  <li><b>Priest:</b> Discipline's Power Word: Radiance healing no longer reduced in PvP; Ultimate Penitence damage and healing increased in PvP.</li>\n  <li><b>Rogue:</b> Outlaw's Combat Stamina increased in PvP.</li>\n  <li><b>Shaman:</b> Restoration's Earth Shield healing, Earthliving Weapon healing, Healing Rain healing, Surging Totem healing increased in PvP; Lively Totems now cast a free Chain Heal at higher effectiveness in PvP.</li>\n  <li><b>Warlock:</b> Demon Skin's armor increase more effective in PvP.</li>\n  <li><b>Warrior:</b> Arms' Execute damage reduced in PvP; Rend damage increased in PvP.</li>\n</ul>\n<p>UI change: Opposing Battleground names hidden until match start.</p>",
        "word_stats": {
          "original": 3838,
          "summary": 159,
          "reduction_percent": 95.9
        }
      },
      "Open World": {
        "summary": "<p>Recent hotfixes for <em>The War Within</em> and later address several gameplay elements:</p>\n<ul>\n    <li>Class balance adjustments for various specializations, including threat generation increases for tanks.</li>\n    <li>Fixes for item equip requirements and combat effects.</li>\n    <li>Improvements to the Lorewalking experience and quest progression on Exile's Reach.</li>\n    <li>Dungeon and raid adjustments, such as boss mechanics and player count requirements.</li>\n    <li>Various bug fixes for mounts, transmogrification, and UI elements.</li>\n</ul>",
        "word_stats": {
          "original": 3838,
          "summary": 66,
          "reduction_percent": 98.3
        }
      }
    }
  },
  {
    "id": "wow-weekly-the-legacy-of-arathor-content-update-is-now-live-and-more",
    "title": "WoW Weekly: The Legacy of Arathor Content Update is Now Live, and More!",
    "date": "2025-06-20",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24213952/wow-weekly-the-legacy-of-arathor-content-update-is-now-live-and-more",
    "summary": "World of Warcraft is buzzing with new content and events! The \"Legacy of Arathor\" update is live, introducing challenges like Overcharged Delves and a Combat Assistant. The \"Ghosts of K'aresh\" update is coming, featuring a new zone and campaign progress. WoW Classic's Phase 5 launches July 10th, enabling the Ahn'Qiraj opening. Enjoy Timewalking dungeons with a new mount reward, the Midsummer Fire Festival from June 21st to July 5th, and summer sales offering discounts on game time, expansions, and in-game items until June 30th.",
    "word_stats": {
      "original": 682,
      "summary": 84,
      "reduction_percent": 87.7
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>The <b>War Within</b> continues with the <i>Ghosts of K’aresh</i> update, featuring a new zone and campaign progression.  Additionally, Warriors can look forward to the Midsummer Fire Festival in 2025, which will include new activities and cosmetic drops in Khaz Algar.</p>",
        "word_stats": {
          "original": 682,
          "summary": 40,
          "reduction_percent": 94.1
        }
      },
      "Mage": {
        "summary": "<p>The <b>Legacy of Arathor</b> update is live, introducing challenges like <b>Overcharged Delves</b> and a new <b>Combat Assistant</b>. </p>\n\n<p>The <b>Ghosts of K'aresh</b> update for <b>The War Within</b> features a new zone and campaign continuation. </p>\n\n<p>A <b>Timewalking</b> event will occur each week for seven weeks, starting with Battle for Azeroth, featuring six new dungeons and a mount reward.</p>\n\n<p>The <b>Midsummer Fire Festival</b> returns June 21–July 5, with new content in Khaz Algar, including achievements and vendor items. </p>\n\n<p>Sales are available on <b>The War Within</b>, mounts, pets, toys, transmogs, game services, and <b>Cataclysm Classic</b> upgrades.</p>",
        "word_stats": {
          "original": 682,
          "summary": 95,
          "reduction_percent": 86.1
        }
      },
      "Rogue": {
        "summary": "<p>The blog post mentions new content and updates relevant to <em>The War Within</em>, including the \"Ghosts of K’aresh\" update, which features a new zone and continues the campaign. While no specific Rogue class mechanics are detailed, these updates will shape your adventures in Retail WoW and beyond.</p>",
        "word_stats": {
          "original": 682,
          "summary": 47,
          "reduction_percent": 93.1
        }
      },
      "Priest": {
        "summary": "<p>Priests in <span style=\"color: #800080;\">The War Within</span> can look forward to the upcoming <span style=\"font-weight: bold;\">Ghosts of K’aresh</span> content update, featuring a new zone and continuation of the campaign. The <span style=\"font-style: italic;\">Legacy of Arathor</span> update is live, introducing challenges like Overcharged Delves. The <span style=\"text-decoration: underline;\">Turbulent Timeways</span> event will offer new Timewalking dungeons and a mount for participation. Additionally, the <span style=\"color: #FF0000;\">Midsummer Fire Festival</span> returns with new activities and vendor items in Khaz Algar in 2025.</p>",
        "word_stats": {
          "original": 682,
          "summary": 78,
          "reduction_percent": 88.6
        }
      },
      "Paladin": {
        "summary": "<p>The <b>Legacy of Arathor</b> content update is now live, featuring <b>Overcharged Delves</b> and new assistants. The <b>Ghosts of K’aresh</b> update for The War Within introduces a new zone and continues the campaign. Paladins can participate in <b>Turbulent Timeways</b>, featuring new dungeons and a mount for achievement completion. The <b>Midsummer Fire Festival</b> will also arrive in Khaz Algar in 2025 with new rewards.</p>",
        "word_stats": {
          "original": 682,
          "summary": 62,
          "reduction_percent": 90.9
        }
      },
      "Hunter": {
        "summary": "<p>The <strong>Legacy of Arathor</strong> content update is live, offering challenges like <strong>Overcharged Delves</strong>.</p>\n<p>The <strong>Ghosts of K’aresh</strong> update introduces a new zone and continues <strong>The War Within</strong> campaign.</p>\n<p>The <strong>Midsummer Fire Festival</strong> (June 21–July 5) arrives in Khaz Algar with new faction achievements, vendor items, and cosmetic drops from Frost Lord Ahune.</p>\n<p>Sales are available on <strong>The War Within</strong>, mounts, pets, toys, transmogs, and game services until June 30, 2025.</p>",
        "word_stats": {
          "original": 682,
          "summary": 70,
          "reduction_percent": 89.7
        }
      },
      "Warlock": {
        "summary": "The provided blog post does not contain specific information directly relevant to the Warlock class in Retail WoW, The War Within, or later expansions. It covers content updates like \"Legacy of Arathor\" and \"Ghosts of K'aresh,\" a WoW Classic 20th Anniversary event, Timewalking, the Midsummer Fire Festival, and sales on game services and items.",
        "word_stats": {
          "original": 682,
          "summary": 54,
          "reduction_percent": 92.1
        }
      },
      "Death Knight": {
        "summary": "<p>The blog post details upcoming content for <em>The War Within</em> and later, specifically mentioning the <strong>Ghosts of K’aresh</strong> content update, which includes a new zone and continuation of The War Within campaign. While Death Knight specific details are absent, players preparing for future content can find information on new adventures and challenges.</p>",
        "word_stats": {
          "original": 682,
          "summary": 52,
          "reduction_percent": 92.4
        }
      },
      "Druid": {
        "summary": "Druids can experience new content in <em>The War Within</em> with the \"Ghosts of K'aresh\" update, featuring a new zone and campaign continuation. The Midsummer Fire Festival, running June 21–July 5, will include new activities and rewards in Khaz Algar, along with new faction achievements and vendor items. Players can also earn a new mount from the Turbulent Timeways event. Additionally, <em>The War Within</em> is 50% off until June 30.",
        "word_stats": {
          "original": 682,
          "summary": 69,
          "reduction_percent": 89.9
        }
      },
      "Monk": {
        "summary": "<p>The blog post highlights upcoming content and sales relevant to World of Warcraft, but does not contain specific information pertaining to the Monk class in Retail WoW, The War Within, or later expansions.</p>",
        "word_stats": {
          "original": 682,
          "summary": 33,
          "reduction_percent": 95.2
        }
      },
      "Evoker": {
        "summary": "<p>The blog post highlights upcoming content relevant to Retail WoW and beyond. The <strong>Ghosts of K'aresh</strong> update will feature a new zone and continue <strong>The War Within</strong> campaign. Additionally, the <strong>Midsummer Fire Festival</strong> will arrive in Khaz Algar in 2025 with new achievements, vendor items, and cosmetic drops.</p>",
        "word_stats": {
          "original": 682,
          "summary": 48,
          "reduction_percent": 93
        }
      },
      "Demon Hunter": {
        "summary": "<p>The blog post announces the upcoming <strong>Ghosts of K’aresh</strong> content update for <em>The War Within</em>, which includes a new zone and continues the campaign. It also highlights the <strong>Turbulent Timeways</strong> event featuring Timewalking dungeons and a new mount. The <strong>Midsummer Fire Festival</strong> returns in 2025 with new content in Khaz Algar and new rewards. Additionally, there are sales on <em>The War Within</em> and various in-game items.</p>",
        "word_stats": {
          "original": 682,
          "summary": 66,
          "reduction_percent": 90.3
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces <b>Overcharged Delves</b>, offering increased challenge. The <b>Ghosts of K'aresh</b> update continues The War Within campaign, featuring a new zone. Retail players can also participate in <b>Turbulent Timeways</b>, with six new Timewalking Dungeons and a mount reward.</p>",
        "word_stats": {
          "original": 682,
          "summary": 42,
          "reduction_percent": 93.8
        }
      },
      "Raiding": {
        "summary": "<p>The <a href=\"#\">Legacy of Arathor</a> content update is live, featuring challenges like Overcharged Delves. The upcoming <a href=\"#\">Ghosts of K’aresh</a> update for The War Within will introduce a new zone and campaign continuation. Additionally, WoW Classic's 20th Anniversary Phase 5 on July 10 will unlock the Ahn'Qiraj raids.</p>",
        "word_stats": {
          "original": 682,
          "summary": 48,
          "reduction_percent": 93
        }
      },
      "M+": {
        "summary": "<p>The \"Legacy of Arathor\" content update introduces <b>Overcharged Delves</b>, an increased challenge for M+ players. The upcoming \"Ghosts of K’aresh\" update continues <i>The War Within</i> campaign and features a new zone. Additionally, a new <b>Timewalking event</b> will offer six dungeons from Battle for Azeroth weekly, with a mount reward for completing achievements across five weeks.</p>",
        "word_stats": {
          "original": 682,
          "summary": 55,
          "reduction_percent": 91.9
        }
      },
      "PvP": {
        "summary": "<p>This blog post focuses on upcoming content and sales for World of Warcraft. While it mentions new zones and campaign progression for <em>The War Within</em>, there are no direct announcements or details regarding PvP content for Retail WoW, <em>The War Within</em>, or later expansions. The post primarily covers PvE updates and sales.</p>",
        "word_stats": {
          "original": 682,
          "summary": 52,
          "reduction_percent": 92.4
        }
      },
      "Open World": {
        "summary": "<p>The <b>Legacy of Arathor</b> update is live, featuring <b>Overcharged Delves</b> and the new <b>Combat Assistant</b>. The <b>Ghosts of K'aresh</b> update introduces an all-new zone and continues <i>The War Within</i> campaign.</p>\n\n<p>The <b>Midsummer Fire Festival</b> runs June 21–July 5, expanding to <b>Khaz Algar</b> in 2025 with new achievements and vendor items. A sale offers discounts on <i>The War Within</i>, mounts, pets, and more until June 30, 2025.</p>",
        "word_stats": {
          "original": 682,
          "summary": 66,
          "reduction_percent": 90.3
        }
      }
    }
  },
  {
    "id": "embrace-the-heat-during-the-midsummer-fire-festival",
    "title": "Embrace the Heat During the Midsummer Fire Festival",
    "date": "2025-06-20",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24213951/embrace-the-heat-during-the-midsummer-fire-festival",
    "summary": "The Midsummer Fire Festival returns June 21 - July 5, celebrating summer with various activities and rewards. New in 2025, the festival expands to Khaz Algar with new achievements and cosmetic gear. Players can earn Burning Blossoms by completing daily quests, fighting Frost Lord Ahune, and participating in activities like stealing flames from enemy cities and juggling torches. Dancing around ribbon poles grants an experience buff. The event concludes with a special \"Fire in the Sky\" spectacle.",
    "word_stats": {
      "original": 1797,
      "summary": 77,
      "reduction_percent": 95.7
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>The Midsummer Fire Festival is coming to Khaz Algar in 2025! Warriors can look forward to new faction achievements like \"Flame Keeper of Khaz Algar\" and \"Flame Warden of Khaz Algar.\" New transmog gear, including a Grand Helm, Mantle, and Belt of the Fire Festival, will be available. Additionally, new cosmetic drops from Frost Lord Ahune include polearms and staves, and a chance at the \"Frostscythe of Lord Ahune\" from his daily reward.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 73,
          "reduction_percent": 95.9
        }
      },
      "Mage": {
        "summary": "<p>The Midsummer Fire Festival, running June 21–July 5, introduces new cosmetic items and achievements relevant to Mages. New transmog pieces include the Grand Helm, Mantle, and Belt of the Fire Festival. Frost Lord Ahune drops cosmetic heads and two-handed staves, useful for transmog. In 2025, the event expands to Khaz Algar with new faction achievements. Mages can participate in the Ahune boss encounter for daily rewards and engage in activities like fire juggling and dancing around ribbon poles for buffs and achievements.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 82,
          "reduction_percent": 95.4
        }
      },
      "Rogue": {
        "summary": "<p>The Midsummer Fire Festival arrives with new content for <em>The War Within</em> and beyond, introducing achievements tied to Khaz Algar's zones: Azj-Kahet, Hallowfall, Isle of Dorn, and The Ringing Deeps. Rogues can aim for the \"Flame Keeper of Khaz Algar\" or \"Flame Warden of Khaz Algar\" meta-achievements. New cosmetic transmog items for Head, Shoulders, and Waist are available, along with cosmetic drops from Frost Lord Ahune, including the \"Crown of the Frost Lord\" and two-hand polearms/staves like \"Glazfuris, Scythe of the Deep Chill.\" Participating in Ahune's encounter via the Group Finder offers a daily reward.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 95,
          "reduction_percent": 94.7
        }
      },
      "Priest": {
        "summary": "<p>The Midsummer Fire Festival, running from June 21–July 5, introduces new achievements and cosmetic items relevant to Priests in <i>The War Within</i> and beyond. New faction achievements, such as \"Flame Keeper of Khaz Algar\" and \"Flame Warden of Khaz Algar,\" are available for honoring flames in the new zones.</p>\n\n<p>New transmog gear includes the <b>Grand Helm of the Fire Festival</b>, <b>Grand Mantle of the Fire Festival</b>, and <b>Grand Belt of the Fire Festival</b>. Cosmetic drops from Frost Lord Ahune feature the <b>Crown of the Frost Lord</b> and two-handed staves like <b>Glazfuris, Spire of the Deep Chill</b>.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 96,
          "reduction_percent": 94.7
        }
      },
      "Paladin": {
        "summary": "<p>The Midsummer Fire Festival, running from June 21–July 5, will introduce new achievements and cosmetic items for Khaz Algar. Players can earn faction-specific achievements like \"Flame Keeper of Khaz Algar\" and \"Flame Warden of Khaz Algar.\" New transmog items include the Grand Helm, Mantle, and Belt of the Fire Festival. Additionally, the holiday vendor will offer cosmetic drops from Frost Lord Ahune, such as the Crown of the Frost Lord and two-hand polearms/staves like Glazfuris and Rethfuras.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 77,
          "reduction_percent": 95.7
        }
      },
      "Hunter": {
        "summary": "<p>The Midsummer Fire Festival returns from June 21–July 5, introducing new content for <em>The War Within</em> and beyond.</p>\n<ul>\n  <li>New faction achievements, <em>Flame Keeper of Khaz Algar</em> (Horde) and <em>Flame Warden of Khaz Algar</em> (Alliance), can be earned by honoring flames in Khaz Algar's zones.</li>\n  <li>Holiday vendor will offer transmog items for head, shoulders, and waist slots.</li>\n  <li>Frost Lord Ahune drops new cosmetic polearms and staves.</li>\n  <li>Characters level 10+ can participate in the daily Ahune encounter for holiday loot.</li>\n  <li>Completing various \"Extinguishing\" and \"Honoring\" achievements across zones contributes to meta-achievements like <em>Flame Keeper/Warden of Khaz Algar</em>.</li>\n</ul>",
        "word_stats": {
          "original": 1797,
          "summary": 97,
          "reduction_percent": 94.6
        }
      },
      "Warlock": {
        "summary": "<p>The Midsummer Fire Festival arrives with new transmog gear and cosmetic drops from Frost Lord Ahune, including polearms and staves. New achievements in Khaz Algar will be available, requiring players to honor flames in its zones. The event includes daily quests for experience and gold, and players can earn Burning Blossoms to purchase items. The festival culminates with a unique event in the sky.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 64,
          "reduction_percent": 96.4
        }
      },
      "Death Knight": {
        "summary": "<p>The Midsummer Fire Festival arrives in 2025, introducing new content for <b>The War Within</b> and later. Death Knights can earn new faction achievements in Khaz Algar zones like Azj-Kahet and Hallowfall. The event also offers new transmog gear for head, shoulders, and waist slots. Players can obtain cosmetic drops from Frost Lord Ahune, including a new head piece and two-hand polearms/staves.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 61,
          "reduction_percent": 96.6
        }
      },
      "Druid": {
        "summary": "<p>The Midsummer Fire Festival returns June 21–July 5, bringing new content for The War Within and beyond. Druids can look forward to:</p>\n<ul>\n    <li>New faction achievements in Khaz Algar zones: Azj-Kahet, Hallowfall, Isle of Dorn, and The Ringing Deeps.</li>\n    <li>New transmog items like the Grand Helm/Mantle/Belt of the Fire Festival.</li>\n    <li>Cosmetic drops from Frost Lord Ahune, including the Crown of the Frost Lord and new two-hand polearms/staves.</li>\n    <li>The annual activities of honoring and desecrating bonfires across Azeroth and new lands for associated achievements.</li>\n    <li>The opportunity to earn pets like the Igneous Flameling and Frigid Frostling.</li>\n</ul>",
        "word_stats": {
          "original": 1797,
          "summary": 96,
          "reduction_percent": 94.7
        }
      },
      "Monk": {
        "summary": "<p>The Midsummer Fire Festival returns, bringing new achievements and transmog items to Khaz Algar in 2025. Monks can participate in various activities, including battling Frost Lord Ahune for rewards and dancing around ribbon poles for an experience buff. The event also features quests and opportunities to desecrate or honor bonfires across Azeroth and beyond, culminating in special meta-achievements for dedicated players.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 61,
          "reduction_percent": 96.6
        }
      },
      "Evoker": {
        "summary": "<p>The Midsummer Fire Festival, running June 21-July 5, is adding new content in Khaz Algar for <em>The War Within</em> and beyond. Evokers can earn new faction achievements by honoring flames in Azj-Kahet, Hallowfall, Isle of Dorn, and The Ringing Deeps, unlocking titles like \"Flame Keeper of Khaz Algar.\" New cosmetic transmog items for Head, Shoulders, and Waist are available from the holiday vendor. Frost Lord Ahune will also drop new cosmetic gear, including weapons like Glazfuris, Scythe of the Deep Chill and Rethfuras, Scorched Stave of Cinders.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 87,
          "reduction_percent": 95.2
        }
      },
      "Demon Hunter": {
        "summary": "<p>The Midsummer Fire Festival, running June 21–July 5, introduces new content for The War Within and beyond. This year, Khaz Algar will host the event, featuring new faction achievements like \"Flame Keeper of Khaz Algar\" and \"Flame Warden of Khaz Algar\" across its zones. New transmog items, including a Grand Helm, Mantle, and Belt of the Fire Festival, will be available. Players can also obtain cosmetic drops from Frost Lord Ahune, such as the Crown of the Frost Lord and new two-hand polearms and staves.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 85,
          "reduction_percent": 95.3
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The Midsummer Fire Festival returns June 21-July 5 with new content for <em>The War Within</em> and beyond. New achievements, <em>Flame Keeper of Khaz Algar</em> and <em>Flame Warden of Khaz Algar</em>, can be earned in the zones of Azj-Kahet, Hallowfall, Isle of Dorn, and The Ringing Deeps. New transmog items, including a Grand Helm, Mantle, and Belt, are available. Frost Lord Ahune drops new cosmetic items like the Crown of the Frost Lord and two-hand polearms/staves. Characters level 10+ can challenge Ahune daily via the Group Finder for a chance at holiday loot.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 92,
          "reduction_percent": 94.9
        }
      },
      "Raiding": {
        "summary": "<p>The Midsummer Fire Festival, running from June 21 to July 5, introduces new achievements and cosmetic items for <em>The War Within</em> and later. Players can earn faction-specific achievements in Khaz Algar's zones: Azj-Kahet, Hallowfall, Isle of Dorn, and The Ringing Deeps. New transmog pieces and cosmetic drops from Frost Lord Ahune, including a polearm and staff, are available. Players can also engage with Ahune via the Group Finder for daily rewards.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 71,
          "reduction_percent": 96
        }
      },
      "M+": {
        "summary": "The Midsummer Fire Festival, running from June 21–July 5, introduces new elements for The War Within and beyond. In 2025, Khaz Algar will feature new faction achievements for honoring flames in its zones. The holiday vendor will offer new transmog items, and Frost Lord Ahune will drop new cosmetic gear. Players can earn currency and buffs by completing daily quests, attending to bonfires across Azeroth, and participating in the Ahune boss encounter via the Group Finder.",
        "word_stats": {
          "original": 1797,
          "summary": 76,
          "reduction_percent": 95.8
        }
      },
      "PvP": {
        "summary": "<p>The Midsummer Fire Festival returns, including new content for <em>The War Within</em> and later expansions. Players can earn faction achievements by honoring flames in Khaz Algar zones: Azj-Kahet, Hallowfall, Isle of Dorn, and The Ringing Deeps. New transmog items, including a Grand Helm, Mantle, and Belt of the Fire Festival, are available. Players can also acquire cosmetic drops from Frost Lord Ahune, such as the Crown of the Frost Lord and new polearms and staves.</p>",
        "word_stats": {
          "original": 1797,
          "summary": 75,
          "reduction_percent": 95.8
        }
      },
      "Open World": {
        "summary": "<p>The Midsummer Fire Festival returns June 21 - July 5, introducing new content for <i>The War Within</i> and beyond.</p>\n<ul>\n    <li><p><b>Khaz Algar Expansion:</b> New faction achievements for honoring flames in Azj-Kahet, Hallowfall, Isle of Dorn, and The Ringing Deeps. New transmog items and cosmetic drops from Frost Lord Ahune.</p></li>\n    <li><p><b>Open World Activities:</b> Desecrate and honor bonfires across various zones, including Kul Tiras, Zandalar, and the Dragon Isles. These actions contribute to achievements and grant buffs.</p></li>\n    <li><p><b>Daily Quests & Boss:</b> Complete daily quests for rewards and participate in the Frost Lord Ahune encounter via Group Finder for loot.</p></li>\n</ul>",
        "word_stats": {
          "original": 1797,
          "summary": 98,
          "reduction_percent": 94.5
        }
      }
    }
  },
  {
    "id": "wowcast-immerse-yourself-in-the-ghosts-of-karesh-content-update",
    "title": "WoWCast: Immerse Yourself in the Ghosts of K’aresh Content Update",
    "date": "2025-06-18",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24215104/wowcast-immerse-yourself-in-the-ghosts-of-karesh-content-update",
    "summary": "The \"Ghosts of K’aresh\" update for World of Warcraft's The War Within campaign introduces the shattered world of K'aresh, home of the ethereals. Players will explore a new zone, the city hub Tazavesh, the Veiled Market, and the Manaforge Omega raid to confront Dimensius. New features include the upgradeable Reshii Wraps for \"Phase Diving,\" the Archival Assault delve, Ecological Succession system, and the Eco-Dome Al’dani dungeon. The update also brings class updates, new class sets tied to Hero Talents, and PvP enhancements.",
    "word_stats": {
      "original": 1151,
      "summary": 82,
      "reduction_percent": 92.9
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>The \"Ghosts of K'aresh\" update for <em>The War Within</em> brings new content relevant to Warriors, including:\n<ul>\n    <li><b>New Class Updates:</b> Focuses on new gameplay for several specializations, implying potential Warrior updates.</li>\n    <li><b>New Class Sets:</b> Features set bonuses aligned with Hero Talents, directly impacting Warrior gameplay.</li>\n    <li><b>New PvP Updates:</b> Includes PvP talent updates and a new outdoor PvP location, Vanquisher's Wake island.</li>\n</ul>\nThe expansion also continues the campaign, introduces a new zone (K'aresh), city hub (Tazavesh), raid (Manaforge Omega), artifact (Reshii Wraps), and more.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 84,
          "reduction_percent": 92.7
        }
      },
      "Mage": {
        "summary": "<p>The <em>Ghosts of K’aresh</em> update for <em>The War Within</em> features new class updates for multiple specializations, including those relevant to Mages. Players will also acquire new class sets with set bonuses that synergize with Hero Talents. The update continues the campaign, introduces a new zone (K’aresh), city hub (Tazavesh), and raid (Manaforge Omega). An upgradeable artifact, Reshii Wraps, will be obtainable, allowing for new gameplay mechanics like Phase Diving. Season 3 also brings a new dungeon, Eco-Dome Al’dani, and an updated dungeon pool.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 83,
          "reduction_percent": 92.8
        }
      },
      "Rogue": {
        "summary": "<p>The <em>Ghosts of K’aresh</em> update for The War Within brings new content relevant to Rogues. A new artifact, the <strong>Reshii Wraps</strong>, will be available. These allow transformation into an energy form for unique interactions, including <strong>Phase Diving</strong>. The Wraps will scale with players and can be used in the new raid, <strong>Manaforge Omega</strong>, delves, and open-world content. New <strong>Class Updates</strong> are promised for multiple specializations, and new <strong>Class Sets</strong> will feature set bonuses aligned with Hero Talents. PvP sees updates to talents and a new outdoor PvP zone.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 88,
          "reduction_percent": 92.4
        }
      },
      "Priest": {
        "summary": "<p>The \"Ghosts of K’aresh\" update for <em>The War Within</em> brings exciting content for Priests:</p>\n<ul>\n    <li><b>Class Updates:</b> Includes new gameplay for Shadow Priest.</li>\n    <li><b>New Class Sets:</b> Features set bonuses that align with your chosen Hero Talents.</li>\n</ul>",
        "word_stats": {
          "original": 1151,
          "summary": 37,
          "reduction_percent": 96.8
        }
      },
      "Paladin": {
        "summary": "<p>The <span style=\"color: #007bff;\">Ghosts of K’aresh</span> update for <span style=\"color: #28a745;\">The War Within</span> brings new class updates and class sets. New class sets will feature bonuses aligned with your chosen Hero Talents. Specific class updates are mentioned, but <span style=\"color: #dc3545;\">Paladin</span> is not among them.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 45,
          "reduction_percent": 96.1
        }
      },
      "Hunter": {
        "summary": "<p>The <b>Ghosts of K’aresh</b> update for <i>The War Within</i> introduces new Hunter-relevant content:</p>\n<ul>\n  <li>A new artifact, <b>Reshii Wraps</b>, allows transformation into an energy form for new interactions and a feature called <b>Phase Diving</b>, offering unique world elements.</li>\n  <li>The update includes <b>New Class Updates</b> and <b>New Class Sets</b>, with set bonuses aligning to Hero Talents.</li>\n  <li>PvP sees updates to several talents and a new outdoor PvP zone, <b>Vanquisher’s Wake island</b>.</li>\n</ul>",
        "word_stats": {
          "original": 1151,
          "summary": 71,
          "reduction_percent": 93.8
        }
      },
      "Warlock": {
        "summary": "<p>The upcoming <strong>Ghosts of K’aresh</strong> update for The War Within will bring new content relevant to Warlocks:</p>\n<ul>\n<li><strong>New Class Updates:</strong> Multiple classes will receive gameplay enhancements, potentially including Warlock specializations.</li>\n<li><strong>New Class Sets:</strong> Players can expect new gear sets with bonuses that synergize with their chosen Hero Talents.</li>\n</ul>",
        "word_stats": {
          "original": 1151,
          "summary": 50,
          "reduction_percent": 95.7
        }
      },
      "Death Knight": {
        "summary": "<p>The <i>Ghosts of K’aresh</i> update for <i>The War Within</i> brings updates for <b>Frost Death Knight</b> and <b>Unholy Death Knight</b> specializations.</p>\n<p>New class sets will feature set bonuses aligned with chosen Hero Talents, rather than class or specialization.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 37,
          "reduction_percent": 96.8
        }
      },
      "Druid": {
        "summary": "The upcoming \"Ghosts of K'aresh\" update for The War Within will bring several Druid-relevant changes. Players will encounter a new Ecological Succession system, where they help restore life to K'aresh's eco-domes by gathering creatures. Druids will also benefit from new Class Updates, with gameplay focused on several specializations, and new Class Sets featuring set bonuses aligned with Hero Talents. Additionally, a new dungeon, Eco-Dome Al'dani, will be added to the Season 3 dungeon pool.",
        "word_stats": {
          "original": 1151,
          "summary": 74,
          "reduction_percent": 93.6
        }
      },
      "Monk": {
        "summary": "<p>The <i>Ghosts of K’aresh</i> update for <i>The War Within</i> includes specific content relevant to Monks.</p>\n\n<p><b>Class Updates:</b> Brewmaster Monk is among the specializations receiving new gameplay updates.</p>\n\n<p><b>Class Sets:</b> New class gear sets will be introduced, with set bonuses tailored to chosen Hero Talents rather than class or specialization.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 49,
          "reduction_percent": 95.7
        }
      },
      "Evoker": {
        "summary": "<p>The <b>Ghosts of K’aresh</b> update for <i>The War Within</i> features new content relevant to Evokers. Players will experience a new zone, <b>K’aresh</b>, and continue the campaign. A new upgradeable artifact, the <b>Reshii Wraps</b>, allows interaction with the world in an energy form and is used for the new <b>Phase Diving</b> feature. Class updates are mentioned, focusing on new gameplay for several specializations, though Evoker is not explicitly listed among those receiving specific updates in this text. New class sets will align with Hero Talents.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 84,
          "reduction_percent": 92.7
        }
      },
      "Demon Hunter": {
        "summary": "Here's a summary focusing on Demon Hunter relevant information from the blog post:\n\n<p>The <em>Ghosts of K’aresh</em> update for <em>The War Within</em> introduces new class updates, including those for several specializations. Additionally, new class sets will be released, featuring set bonuses that align with chosen Hero Talents rather than class or specialization. This update continues <em>The War Within</em> campaign, introduces the new zone K’aresh, and brings back Tazavesh, the Veiled Market, as a city hub. Players can also expect updates to PvP talents and a new outdoor PvP location.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 89,
          "reduction_percent": 92.3
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The <em>Ghosts of K’aresh</em> update introduces <strong>The Archival Assault</strong>, a new Delve located within the Dragon Isles' Azure Vaults. This Delve features ethereal, ethereal pirate, and broker enemies. Players will utilize the new <strong>Reshii Wraps</strong> artifact to unlock special challenge gateways to bosses and challenge rooms within the Delve. This artifact will also be usable in the open world and the Manaforge Omega raid.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 64,
          "reduction_percent": 94.4
        }
      },
      "Raiding": {
        "summary": "<p>The \"Ghosts of K’aresh\" update for The War Within introduces <strong>Manaforge Omega</strong>, a new raid dungeon. Players will battle Shadow Guard Ethereals attempting to revive Dimensius, culminating in a cosmic confrontation with the Void Lord himself. The artifact, Reshii Wraps, will be usable within this raid. Additionally, the dungeon pool for The War Within Season 3 will include the new dungeon <strong>Eco-Dome Al’dani</strong> and the return of Tazavesh as a full mega-dungeon.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 72,
          "reduction_percent": 93.7
        }
      },
      "M+": {
        "summary": "<p>The <em>Ghosts of K’aresh</em> update for <em>The War Within</em> introduces <strong>Eco-Dome Al’dani</strong> as a new dungeon. The Season 3 dungeon pool will also feature returning dungeons, including Tazavesh (Streets of Wonder and So'leah's Gambit), and new class sets with set bonuses aligning to Hero Talents.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 45,
          "reduction_percent": 96.1
        }
      },
      "PvP": {
        "summary": "<p>The Ghosts of K’aresh update introduces <b>New PvP Updates</b>.</p>\n<p>Several PvP talents will receive updates. Additionally, a new World Quest on <b>Vanquisher’s Wake island</b> offers a dedicated location for outdoor PvP battles, accessible simply by enabling War Mode.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 38,
          "reduction_percent": 96.7
        }
      },
      "Open World": {
        "summary": "<p>The upcoming <i>Ghosts of K'aresh</i> update for <i>The War Within</i> introduces the new zone of <b>K'aresh</b>, a fragmented, void-touched world. Players will continue the campaign, explore the city hub of <b>Tazavesh, the Veiled Market</b>, and engage with new open-world content such as <b>Phase Diving</b>, which offers new creatures, objectives, and world quests. The update also includes a new Delve, <b>The Archival Assault</b>, a new system called <b>Ecological Succession</b>, and a new dungeon, <b>Eco-Dome Al'dani</b>. A new outdoor PvP location, <b>Vanquisher's Wake island</b>, is also added.</p>",
        "word_stats": {
          "original": 1151,
          "summary": 85,
          "reduction_percent": 92.6
        }
      }
    }
  },
  {
    "id": "dive-into-summer-and-save-up-to-50",
    "title": "Dive into Summer and Save up to 50%!",
    "date": "2025-06-17",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24215169/dive-into-summer-and-save-up-to-50",
    "summary": "World of Warcraft is offering a summer sale with up to 50% off. This includes a discount on \"The War Within\" expansion, various mounts, pets, toys, and transmogs for both modern and Classic WoW. Players can also save up to 30% on game services like name and race changes, and get 33% off Level 70 character boosts. Additionally, there are deals on \"Cataclysm Classic\" upgrades and classic WoW items. The sale ends June 30, 2025.",
    "word_stats": {
      "original": 636,
      "summary": 75,
      "reduction_percent": 88.2
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>WoW is offering discounts on <strong>The War Within</strong> expansion, with up to 50% off. Players can also save on mounts, pets, toys, and transmog sets. A 33% discount is available on Enhanced Level 70 Character Boosts. For those playing Cataclysm Classic, there are up to 50% off fiery upgrades, including the Blazing Heroic Pack with exclusive mounts and transmog for modern WoW characters.</p>",
        "word_stats": {
          "original": 636,
          "summary": 63,
          "reduction_percent": 90.1
        }
      },
      "Mage": {
        "summary": "<p>The latest World of Warcraft sale offers discounts on <strong>The War Within</strong> expansion, up to 50% off select mounts, pets, and transmogs, and up to 30% off game services. For Retail players, the sale includes transmog sets like the <strong>Diadem of the Spell-Keeper</strong> and the <strong>Fireplume Regalia</strong>, along with various mounts and pets.</p>",
        "word_stats": {
          "original": 636,
          "summary": 53,
          "reduction_percent": 91.7
        }
      },
      "Rogue": {
        "summary": "<p>The latest World of Warcraft sale offers significant discounts on <strong>The War Within</strong> expansion, with up to 50% off. Additionally, players can save on various mounts, pets, toys, and transmog appearances. Services like name, race, and faction changes are also discounted. A 33% discount is available for Level 70 Character Boosts. For <strong>Cataclysm Classic</strong>, discounts of up to 50% apply to upgrades, including mounts and transmog items. The sale concludes on June 30, 2025.</p>",
        "word_stats": {
          "original": 636,
          "summary": 74,
          "reduction_percent": 88.4
        }
      },
      "Priest": {
        "summary": "<p><b>The War Within</b> expansion is on sale for 50% off, offering a new adventure in Khaz Algar with new races and threats. Additionally, discounts are available on select mounts, pets, toys, and transmog appearances for modern <b>World of Warcraft</b>. Services like name and race changes also see up to a 30% discount. A Level 70 Character Boost is 33% off. For <b>Cataclysm Classic</b>, fiery upgrades and various items are up to 50% off.</p>",
        "word_stats": {
          "original": 636,
          "summary": 73,
          "reduction_percent": 88.5
        }
      },
      "Paladin": {
        "summary": "<p>The <em>War Within</em> expansion is on sale for 50% off, offering players access to new subterranean worlds, the Earthen, and the nerubian empire. Additionally, various mounts, pets, toys, and transmog items are available with discounts up to 50%. Game services like name and race changes are also reduced by up to 30%. An enhanced Level 70 Character Boost is 33% off.</p>",
        "word_stats": {
          "original": 636,
          "summary": 61,
          "reduction_percent": 90.4
        }
      },
      "Hunter": {
        "summary": "<p>Save big on <strong>World of Warcraft</strong> this summer! <strong>The War Within</strong> expansion is 50% off, offering new subterranean worlds and challenges. You can also get up to 50% off select mounts, pets, toys, and transmog appearances. Enhance your character with a 33% discount on Level 70 Character Boosts.</p>",
        "word_stats": {
          "original": 636,
          "summary": 48,
          "reduction_percent": 92.5
        }
      },
      "Warlock": {
        "summary": "<p>The War Within expansion is 50% off, offering new subterranean worlds, the Earthen race, and the nerubian empire. Additionally, there are discounts on various mounts, pets, and transmog items relevant to modern WoW. Specific items include the <strong>Runebound Firelord Skyriding mount</strong> and the <strong>Tabard of Flame transmog</strong>. Character services like name and race changes are also reduced.</p>",
        "word_stats": {
          "original": 636,
          "summary": 57,
          "reduction_percent": 91
        }
      },
      "Death Knight": {
        "summary": "<p>The latest World of Warcraft sale offers significant discounts for players interested in <em>The War Within</em>, with up to 50% off the expansion. Players can also find deals on various mounts, pets, toys, and transmog appearances for modern WoW. Additionally, there are discounts on character services like name and race changes, as well as a 33% discount on Level 70 Character Boosts.</p>",
        "word_stats": {
          "original": 636,
          "summary": 62,
          "reduction_percent": 90.3
        }
      },
      "Druid": {
        "summary": "<p>Save big this summer on <strong>The War Within</strong>, now 50% off. This expansion introduces new subterranean worlds, the Earthen race, the nerubian empire, and goblin culture. Discounts are also available on select mounts, pets, and transmog appearances relevant to Druids, such as the <strong>Auspicious Arborwyrm</strong>, <strong>Enchanted Fey Dragon</strong>, <strong>Sylverian Dreamer</strong>, and <strong>Tangled Dreamweaver</strong>. A 33% discount applies to Level 70 Character Boosts.</p>",
        "word_stats": {
          "original": 636,
          "summary": 62,
          "reduction_percent": 90.3
        }
      },
      "Monk": {
        "summary": "<p>The <a href=\"https://worldofwarcraft.blizzard.com/en-us/news/24094460/summer-sale-is-here\">World of Warcraft Summer Sale</a> offers discounts on <em>The War Within</em> expansion, with up to 50% off. Several mounts, pets, toys, and transmog appearances are also on sale, including the <strong>Auspicious Arborwyrm</strong> mount and <strong>Shu-zen, the Divine Sentinel</strong> mount, which have a jade aesthetic fitting for Monks.</p>",
        "word_stats": {
          "original": 636,
          "summary": 49,
          "reduction_percent": 92.3
        }
      },
      "Evoker": {
        "summary": "<p>The War Within is available for 50% off, offering new subterranean worlds, Earthen allies, and the threat of the Nerubian Empire. Additionally, there are discounts of up to 50% on select mounts, pets, toys, and transmogs. Notably, the \"Wings of Awakening\" and \"Waveborne Diplomat’s Regalia\" transmogs are on sale. A 33% discount is available on an Enhanced Level 70 Character Boost, and certain Cataclysm Classic upgrades are up to 50% off, including the \"Runebound Firelord Skyriding mount\" for modern WoW.</p>",
        "word_stats": {
          "original": 636,
          "summary": 80,
          "reduction_percent": 87.4
        }
      },
      "Demon Hunter": {
        "summary": "<p>\n  The <a href=\"#\">War Within</a> expansion is 50% off, offering new subterranean worlds, Earthen race, nerubian empire threat, and goblin culture.\n  Players can also save up to 50% on select mounts, pets, toys, and transmogs, including the <strong>Path of Illidan</strong> toy.\n  Additionally, there's a 33% discount on Enhanced Level 70 Character Boosts and up to 30% off game services like name and race changes, all relevant to <strong>Retail WoW</strong>.\n</p>",
        "word_stats": {
          "original": 636,
          "summary": 70,
          "reduction_percent": 89
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>Summer sales offer discounts on <em>The War Within</em>, featuring subterranean worlds, new races like the Earthen, and threats from the nerubian empire. The sale also includes various mounts, pets, toys, and transmog items for both modern and Classic WoW. Additionally, discounts are available on game services and character boosts.</p>",
        "word_stats": {
          "original": 636,
          "summary": 49,
          "reduction_percent": 92.3
        }
      },
      "Raiding": {
        "summary": "<p>This blog post highlights summer sales for World of Warcraft. While it doesn't directly mention raiding, it offers significant discounts on <strong>The War Within</strong> expansion, encouraging players to prepare for its subterranean adventures. Additionally, sales include mounts, pets, toys, and transmogs, which can be useful for character enhancement and personalization in modern WoW. Game services like race and faction changes, and character boosts are also discounted, potentially helping players optimize for future content.</p>",
        "word_stats": {
          "original": 636,
          "summary": 73,
          "reduction_percent": 88.5
        }
      },
      "M+": {
        "summary": "<p>This blog post highlights summer sales for World of Warcraft. While it details discounts on <strong>The War Within</strong> expansion, mounts, pets, transmogs, and game services like name/race changes, it does not contain any information directly relevant to M+ content or mechanics for Retail WoW or future expansions.</p>",
        "word_stats": {
          "original": 636,
          "summary": 47,
          "reduction_percent": 92.6
        }
      },
      "PvP": {
        "summary": "<p>The blog post announces summer sales for World of Warcraft, focusing on <b>The War Within</b> expansion (up to 50% off). It also highlights discounts on select mounts, pets, toys, and transmog appearances for modern WoW. Additionally, there are deals on game services like name and race changes (up to 30% off) and an Enhanced Level 70 Character Boost (33% off), which can aid players in preparing for PvP content.</p>",
        "word_stats": {
          "original": 636,
          "summary": 69,
          "reduction_percent": 89.2
        }
      },
      "Open World": {
        "summary": "<p>Dive into <b>The War Within</b> with up to 50% off, exploring subterranean worlds and new threats. The sale also features discounts on a variety of mounts, pets, toys, and transmog appearances for modern WoW. Additionally, players can save up to 30% on game services like name and race changes, and get an Enhanced Level 70 Character Boost at 33% off. Cataclysm Classic also sees upgrades with up to 50% off.</p>",
        "word_stats": {
          "original": 636,
          "summary": 70,
          "reduction_percent": 89
        }
      }
    }
  },
  {
    "id": "go-on-an-adventure-in-the-legacy-of-arathor-content-update-now-live",
    "title": "Go on an Adventure in the Legacy of Arathor Content Update—Now Live!",
    "date": "2025-06-17",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24208341/go-on-an-adventure-in-the-legacy-of-arathor-content-update-now-live",
    "summary": "The Legacy of Arathor update, launching June 17, introduces a new Arathi Highlands campaign, Lorewalker Cho's lore tours, challenging Overcharged Delves with new affixes, and UI assists like Assisted Highlight and Single-Button Assistant for easier class learning. Battle for Azeroth Timeways return, and the Greedy Emissary event brings back rewards including Tier 2 armor recolors.",
    "word_stats": {
      "original": 993,
      "summary": 55,
      "reduction_percent": 94.5
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, starting June 17, introduces a new campaign in the Arathi Highlands. For Warriors, the highlight is the potential inclusion of recolored classic Tier 2 armor sets obtainable through the Greedy Emissary event, returning the week of July 1. Additionally, new UI options like \"Assisted Highlight\" and \"Single-Button Assistant\" are available to help players manage rotations.</p>",
        "word_stats": {
          "original": 993,
          "summary": 60,
          "reduction_percent": 94
        }
      },
      "Mage": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces <b>Overcharged Delves</b> with new affixes and a trait tree. For Mages seeking assistance, the new <b>Assisted Highlight</b> can help with damage rotations, and the <b>Single-Button Assistant</b> can cast recommended damage abilities, including AoE. The update also features a new Arathi Highlands campaign and allows players to revisit lore through <b>Lorewalker Cho</b>.</p>",
        "word_stats": {
          "original": 993,
          "summary": 57,
          "reduction_percent": 94.3
        }
      },
      "Rogue": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces new UI options relevant to Rogues:</p>\n<ul>\n    <li><b>Assisted Highlight:</b> Highlights the next recommended ability for damage rotations, aiding specialization learning.</li>\n    <li><b>Single-Button Assistant:</b> A single button casts the next recommended damage ability, ideal for casual play or story focus.</li>\n</ul>\n<p>Additionally, Rogues can earn recolored Tier 2 armor sets during the <b>Greedy Emissary</b> event.</p>",
        "word_stats": {
          "original": 993,
          "summary": 59,
          "reduction_percent": 94.1
        }
      },
      "Priest": {
        "summary": "<p>The <strong>Legacy of Arathor</strong> update for Retail WoW brings new content and UI features. Priests, like all classes, can benefit from the new <strong>Assisted Highlight</strong> and <strong>Single-Button Assistant</strong> UI options, designed to help with ability rotation and accessibility. Additionally, Priests can engage with new lore through Lorewalker Cho and participate in Overcharged Delves. The update also features a new Arathi Highlands campaign and Timewalking with Battle for Azeroth dungeons. Tier 2 armor set recolors are also mentioned.</p>",
        "word_stats": {
          "original": 993,
          "summary": 77,
          "reduction_percent": 92.2
        }
      },
      "Paladin": {
        "summary": "<p>The upcoming \"Legacy of Arathor\" update introduces new content and features for Retail WoW.  While not directly class-specific, the update includes new UI options like the <strong>Assisted Highlight</strong> and <strong>Single-Button Assistant</strong>, which can aid players in learning or relearning specializations, potentially benefiting Paladins trying a new spec. Additionally, recolored Tier 2 armor sets will be available, including a Paladin set, via the Greedy Emissary event.</p>",
        "word_stats": {
          "original": 993,
          "summary": 65,
          "reduction_percent": 93.5
        }
      },
      "Hunter": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces new content for Hunters. Explore a new campaign in the <b>Arathi Highlands</b> and engage with <b>Overcharged Delves</b>. New UI features like <b>Assisted Highlight</b> and <b>Single-Button Assistant</b> are available to help manage rotations. The <b>Turbulent Timeways</b> will feature <b>Battle for Azeroth</b> dungeons and a new vendor. Additionally, recolored <b>Tier 2 armor sets</b>, including a Hunter set, will be available through the returning <b>Greedy Emissary</b> event.</p>",
        "word_stats": {
          "original": 993,
          "summary": 70,
          "reduction_percent": 93
        }
      },
      "Warlock": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces new content and features for Retail WoW. Warlocks can look forward to a new armor set recolor during the <b>Greedy Emissary</b> event. Additionally, new UI options like <b>Assisted Highlight</b> and <b>Single-Button Assistant</b> are being added to help players learn or refine their class rotations, including damage rotations.</p>",
        "word_stats": {
          "original": 993,
          "summary": 53,
          "reduction_percent": 94.7
        }
      },
      "Death Knight": {
        "summary": "<p>The <b>Legacy of Arathor</b> update for Retail WoW introduces new content. Death Knights can engage with the new <b>Arathi Highlands Campaign</b>, explore lore through <b>Lorewalking with Lorewalker Cho</b>, and tackle <b>Overcharged Delves</b>. Additionally, new UI options like the <b>Assisted Highlight</b> and <b>Single-Button Assistant</b> can help with combat rotations. Death Knights can also acquire recolored Tier 2 armor sets during the returning <b>Greedy Emissary</b> event.</p>",
        "word_stats": {
          "original": 993,
          "summary": 64,
          "reduction_percent": 93.6
        }
      },
      "Druid": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces UI assists for players, including <b>Assisted Highlight</b> for recommended abilities and a <b>Single-Button Assistant</b> for simplified combat. Druids can benefit from these new tools to learn rotations or play more casually. Additionally, new UI options are designed to help players learn a new class or specialization.</p>",
        "word_stats": {
          "original": 993,
          "summary": 52,
          "reduction_percent": 94.8
        }
      },
      "Monk": {
        "summary": "<p>The Legacy of Arathor update brings new content and UI features. While no specific Monk abilities or mechanics are detailed, the update includes a new UI option called \"Assisted Highlight\" and \"Single-Button Assistant\" which can help players learn or optimize damage rotations. Monk armor set recolors will be available through the Greedy Emissary event returning July 1st.</p>",
        "word_stats": {
          "original": 993,
          "summary": 57,
          "reduction_percent": 94.3
        }
      },
      "Evoker": {
        "summary": "<p>The Legacy of Arathor update introduces <strong>Overcharged Delves</strong> with new affixes and a trait tree, offering increased challenge and rewards. Evokers can benefit from new <strong>UI options</strong> like Assisted Highlight and Single-Button Assistant, which provide ability rotation guidance and simplified casting, aiding in learning new specializations or casual play.</p>",
        "word_stats": {
          "original": 993,
          "summary": 49,
          "reduction_percent": 95.1
        }
      },
      "Demon Hunter": {
        "summary": "<p>The <b>Legacy of Arathor</b> update brings new content to Retail WoW. Demon Hunters can earn new armor set recolors during the Greedy Emissary event, starting July 1st. The update also introduces UI enhancements like Assisted Highlight and Single-Button Assistant, which can help players optimize their damage rotations or experience content more casually, with the latter adding a small global cooldown between abilities.</p>",
        "word_stats": {
          "original": 993,
          "summary": 62,
          "reduction_percent": 93.8
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The <b>Legacy of Arathor</b> content update introduces <b>Overcharged Delves</b>, featuring six new Delves in Khaz Algar with increased challenge via a new affix. Players can engage with Titan enemies, more traps, and unlock traits in a new trait tree specific to Overcharged Delves, allowing for strategic use of traps.</p>",
        "word_stats": {
          "original": 993,
          "summary": 49,
          "reduction_percent": 95.1
        }
      },
      "Raiding": {
        "summary": "<p>The \"Legacy of Arathor\" content update introduces <b>Overcharged Delves</b>, featuring new affixes and challenges within six Khaz Algar Delves. Players can earn loot and unlock traits in a specialized trait tree to assist with traps.</p>",
        "word_stats": {
          "original": 993,
          "summary": 35,
          "reduction_percent": 96.5
        }
      },
      "M+": {
        "summary": "<p>The Legacy of Arathor update introduces <b>Overcharged Delves</b> in Khaz Algar, featuring new challenges with a Delve-specific affix and a new trait tree for Titan enemies. This update also adds <b>UI options</b> like Assisted Highlight and Single-Button Assistant to help players learn classes or specializations.</p>",
        "word_stats": {
          "original": 993,
          "summary": 45,
          "reduction_percent": 95.5
        }
      },
      "PvP": {
        "summary": "<p>The <span style=\"color: #DAA520;\">Legacy of Arathor</span> update includes a new Arathi Highlands campaign and Overcharged Delves.  New UI options, <span style=\"font-weight: bold;\">Assisted Highlight</span> and <span style=\"font-weight: bold;\">Single-Button Assistant</span>, are added to aid in learning classes.  Turbulent Timeways will feature Battle for Azeroth dungeons.</p>",
        "word_stats": {
          "original": 993,
          "summary": 43,
          "reduction_percent": 95.7
        }
      },
      "Open World": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces new content and features for Retail WoW. Players can engage in <b>Overcharged Delves</b> in Khaz Algar, offering increased challenge and new rewards. A new campaign set in the <b>Arathi Highlands</b> explores a conspiracy and faction-based storylines. Players can also revisit lore through <b>Lorewalking with Lorewalker Cho</b>, experiencing curated storylines. The update includes UI enhancements like <b>Assisted Highlight</b> and <b>Single-Button Assistant</b> to aid gameplay and accessibility.</p>",
        "word_stats": {
          "original": 993,
          "summary": 71,
          "reduction_percent": 92.8
        }
      }
    }
  },
  {
    "id": "take-a-timely-tour-through-the-turbulent-timeways",
    "title": "Take a Timely Tour Through the Turbulent Timeways",
    "date": "2025-06-17",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24209852/take-a-timely-tour-through-the-turbulent-timeways",
    "summary": "World of Warcraft's \"Turbulent Timeways\" event runs for seven weeks, starting and ending with Battle for Azeroth. It features six new Timewalking dungeons from BFA each week, plus dungeons from other expansions like Mists of Pandaria and Burning Crusade. Players gain an XP buff that stacks up to 30% and can earn a new Chrono Corsair mount by completing weekly objectives. Increased reputation gains and the chance for Heroic-level loot are also available.",
    "word_stats": {
      "original": 2011,
      "summary": 73,
      "reduction_percent": 96.4
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>A <strong>Turbulent Timeways</strong> event is coming, offering a week-long Timewalking bonus each week for seven weeks. Warriors can earn an experience buff, \"Knowledge of the Timeways,\" which stacks to \"Mastery of the Timeways\" for a 30% experience gain. This buff is account-wide, aiding alt leveling. Completing specific achievements during the event can reward the new <strong>Chrono Corsair</strong> mount. Enemies and loot scale to your level, and Timewalking dungeons offer a chance at Heroic drops and faction reputation. Battle for Azeroth dungeons are featured at the start and end of the event.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 91,
          "reduction_percent": 95.5
        }
      },
      "Mage": {
        "summary": "<p>A Timewalking event is live, featuring a rotating selection of dungeons from past expansions: Battle for Azeroth, Mists of Pandaria, The Burning Crusade, Warlords of Draenor, Legion, and Classic. Completing Timewalking dungeons grants a stacking experience buff, \"Knowledge of the Timeways,\" which can reach 30% with \"Mastery of the Timeways\" after four stacks. This is an excellent opportunity for leveling alts and obtaining a new mount, the Chrono Corsair, for completing specific achievements. Dungeons scale with player level, and there's a chance to acquire Heroic-difficulty loot and gain reputation bonuses.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 90,
          "reduction_percent": 95.5
        }
      },
      "Rogue": {
        "summary": "<p>The <span style=\"font-weight: bold;\">Turbulent Timeways</span> event offers a 7-week rotation of Timewalking dungeons. Rogues can participate in Battle for Azeroth, Mists of Pandaria, The Burning Crusade, Warlords of Draenor, Legion, and Classic Timewalking dungeons. Completing these dungeons grants a stacking experience buff, potentially reaching 30% with \"Mastery of the Timeways.\" A new mount, the Chrono Corsair, is available for completing specific Timewalking achievements. Dungeons scale to player level and offer a chance at Heroic loot, along with faction reputation bonuses.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 80,
          "reduction_percent": 96
        }
      },
      "Priest": {
        "summary": "<p>The <span style=\"font-weight: bold;\">Turbulent Timeways</span> event offers a special Timewalking bonus. For a limited time, completing the weekly Timewalking quest grants an increased reward. Players can also earn a stacking experience buff, \"Knowledge of the Timeways,\" which can transform into \"Mastery of the Timeways\" after four applications, providing a 30% experience increase. This buff is account-wide, aiding alt leveling. Achieving \"Mastery of the Timeways\" for five weeks earns the new <span style=\"font-weight: bold;\">Chrono Corsair mount</span>. Timewalking dungeons scale to your level and offer a 50% reputation bonus for the corresponding expansion.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 91,
          "reduction_percent": 95.5
        }
      },
      "Paladin": {
        "summary": "<p>The Timewalking event features a seven-week tour through past expansions, starting with Battle for Azeroth. Paladins can engage in six new Battle for Azeroth dungeons weekly. The event offers a stacking experience buff, \"Knowledge of the Timeways\" and \"Mastery of the Timeways,\" for leveling alts. A new mount, the Chrono Corsair, is available for completing a specific achievement. Loot scales to player level, and reputation gains are boosted for the corresponding expansion.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 72,
          "reduction_percent": 96.4
        }
      },
      "Hunter": {
        "summary": "<p>The Timewalking event offers Hunters a chance to earn a new mount, the Chrono Corsair, by achieving \"Mastery of the Timeways\" for five weeks. This involves gaining a stacking experience buff from Timewalking dungeons, increasing by 5% per application up to 30%. Loot and enemies scale to your level, with a chance for Heroic drops and increased reputation gains for relevant factions.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 62,
          "reduction_percent": 96.9
        }
      },
      "Warlock": {
        "summary": "<p>This blog post announces a Timewalking event featuring dungeons from various expansions, including Battle for Azeroth, Mists of Pandaria, Burning Crusade, Warlords of Draenor, Legion, and Classic.</p>\n\n<p>While no specific Warlock class changes are mentioned, Warlocks can participate in these Timewalking dungeons, benefiting from the \"Knowledge of the Timeways\" buff which increases experience gain. Completing five weeks of Timewalking can earn a new mount.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 64,
          "reduction_percent": 96.8
        }
      },
      "Death Knight": {
        "summary": "<p>\nThe latest World of Warcraft update introduces a <strong>Timewalking event</strong> featuring dungeons from various expansions. While specific class-related changes for Death Knights are not mentioned, players of this class can participate in these Timewalking dungeons to gain experience buffs and potentially earn new rewards, including a mount. The event also offers a reputation bonus for participating expansions.\n</p>",
        "word_stats": {
          "original": 2011,
          "summary": 59,
          "reduction_percent": 97.1
        }
      },
      "Druid": {
        "summary": "<p>The <span style=\"color: green;\">Turbulent Timeways</span> event features a 7-week Timewalking schedule, starting and ending with Battle for Azeroth. Druids can earn rewards by completing new Battle for Azeroth dungeons like <strong>Atal'Dazar</strong> and <strong>Waycrest Manor</strong>. An experience buff, \"Knowledge of the Timeways,\" stacks up to 30% and lasts through death, aiding alt leveling. A new mount, the Chrono Corsair, is obtainable by achieving \"Mastery of the Timeways\" for five weeks. The event also offers a 50% bonus to reputation gains from quests and creature kills for the corresponding expansion.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 88,
          "reduction_percent": 95.6
        }
      },
      "Monk": {
        "summary": "<p>The <a href=\"https://worldofwarcraft.blizzard.com/en-us/news/24096570/turbulent-timeways-returns\">Turbulent Timeways</a> event offers a significant experience boost for leveling alts. By participating in Timewalking dungeons weekly, players can earn the \"Mastery of the Timeways\" buff, which increases experience gains by 30%. Achieving this buff for five weeks grants a new mount.  The event features a rotating schedule of past expansion Timewalking dungeons, including Battle for Azeroth, Mists of Pandaria, The Burning Crusade, Warlords of Draenor, Legion, and Classic dungeons. Enemies and loot scale to player level, and reputation gains are increased for relevant factions.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 87,
          "reduction_percent": 95.7
        }
      },
      "Evoker": {
        "summary": "<p>This blog post details a 7-week Timewalking event, cycling through Battle for Azeroth, Mists of Pandaria, The Burning Crusade, Warlords of Draenor, Legion, and Classic dungeons. While Evokers are not specifically mentioned, the event offers a stacking buff, \"Knowledge of the Timeways,\" which increases experience gained from monsters and quests, capping at 30% after four applications. This buff is account-wide and beneficial for leveling alts. Players can earn a new mount by achieving \"Mastery of the Timeways\" for five weeks.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 80,
          "reduction_percent": 96
        }
      },
      "Demon Hunter": {
        "summary": "<p>The Timewalking event features a rotating selection of dungeons from past expansions, including <b>Battle for Azeroth</b>, <b>Mists of Pandaria</b>, <b>The Burning Crusade</b>, <b>Warlords of Draenor</b>, <b>Legion</b>, and <b>Classic</b>. Players can earn an experience buff that stacks up to 30% and work towards a new mount by completing the achievement for maintaining the buff for five weeks. Rewards from previous Turbulent Timeways events will also be available. While the text does not specifically mention Demon Hunters, the event benefits all classes by providing opportunities to level up alts and acquire gear.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 90,
          "reduction_percent": 95.5
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The Bronze Dragonflight has identified temporal disturbances, leading to a 7-week Timewalking event featuring dungeons from past expansions. This event focuses on Battle for Azeroth dungeons initially, with others like Mists of Pandaria, The Burning Crusade, Warlords of Draenor, Legion, and Classic included weekly. Players can earn experience buffs, a new mount by completing weekly achievements, and may find Heroic-level gear from scaled dungeons.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 64,
          "reduction_percent": 96.8
        }
      },
      "Raiding": {
        "summary": "<p>The <a href=\"#\">Turbulent Timeways</a> event brings a rotating schedule of Timewalking dungeons from previous expansions. Players can earn a stacking experience buff, a new mount for completing achievements, and a limited-time increased reward from the Timewalking quest. Loot and enemies scale to player level, with a chance for Heroic drops and increased reputation gains.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 54,
          "reduction_percent": 97.3
        }
      },
      "M+": {
        "summary": "<p>A 7-week Timewalking event features 6 new dungeons each week from various expansions. Players can earn a special cache of treasures by completing Timewalking quests. A stacking buff, \"Knowledge of the Timeways,\" increases experience gain and can be obtained by completing Timewalking dungeons. Earning this buff for five weeks grants the Chrono Corsair mount. Timewalking dungeons scale to player level, drop Heroic-level loot, and grant reputation bonuses for the corresponding expansion.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 71,
          "reduction_percent": 96.5
        }
      },
      "PvP": {
        "summary": "<p>The <b>Turbulent Timeways</b> event offers players a chance to revisit dungeons from previous expansions each week.</p>\n\n<p>While the event primarily focuses on PvE content, players can earn a new mount by completing specific Timewalking achievements over five weeks. Loot and enemies scale to player level, with chances to acquire Heroic-level gear and faction reputation bonuses.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 55,
          "reduction_percent": 97.3
        }
      },
      "Open World": {
        "summary": "<p>A <b>Turbulent Timeways</b> event is live for 7 weeks, featuring a different expansion's Timewalking dungeons each week. Players can earn a new mount by completing achievements. This event offers a 50% bonus to reputation gains from quests and mob kills for the featured expansion. Dungeons scale to player level and can drop Heroic-level loot. A special Timewalking quest provides an increased reward of a <span style=\"color: #3498db;\">Cache of Undermine Treasures</span>.</p>",
        "word_stats": {
          "original": 2011,
          "summary": 70,
          "reduction_percent": 96.5
        }
      }
    }
  },
  {
    "id": "wow-classic-20th-anniversary-edition-phase-5-launches-july-10",
    "title": "WoW Classic 20th Anniversary Edition Phase 5 Launches July 10",
    "date": "2025-06-16",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24213950/wow-classic-20th-anniversary-edition-phase-5-launches-july-10",
    "summary": "The War Effort begins July 10th, challenging players to gather vast resources to open the Gates of Ahn'Qiraj. Successfully completing this effort, culminating in ringing the Scarab Gong, grants access to the Ruins and Temple of Ahn'Qiraj raids. The first player to ring the gong receives the exclusive Black Qiraji Resonating Crystal mount. This event also unlocks new raid content, epic weapon choices, and powerful class armor sets.",
    "word_stats": {
      "original": 1199,
      "summary": 68,
      "reduction_percent": 94.3
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>Warriors can obtain two new armor sets in The War Within and later: <b>Battlegear of Unyielding Strength</b> and <b>Conqueror's Battlegear</b>.</p>\n\n<p>Battlegear of Unyielding Strength includes a ring, cloak, and 1H axe. Conqueror's Battlegear offers a full armor set: breastplate, crown, greaves, legguards, and spaulders.</p>\n\n<p>These sets are acquired through the Ruins of Ahn'Qiraj and Temple of Ahn'Qiraj raids, with items obtainable from bosses and by gaining reputation with the Brood of Nozdormu.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 72,
          "reduction_percent": 94
        }
      },
      "Mage": {
        "summary": "<p>Mages can obtain the <strong>Trappings of Vaulted Secrets</strong> set from the Ruins of Ahn'Qiraj, featuring a ring, cloak, and 1H sword. For the Temple of Ahn'Qiraj, Mages can earn the <strong>Enigma Vestments</strong> set, comprising boots, a circlet, leggings, robes, and shoulderpads.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 41,
          "reduction_percent": 96.6
        }
      },
      "Rogue": {
        "summary": "The War Effort begins July 10th, granting access to Ahn'Qiraj raids. Rogues can earn two new class armor sets: <span style=\"color: green;\">Emblems of Veiled Shadows</span> from Ruins of Ahn'Qiraj (Ring, Cloak, Dagger) and <span style=\"color: green;\">Deathdealer's Embrace</span> from Temple of Ahn'Qiraj (Boots, Helm, Spaulders, Leggings, Vest) through reputation and raid drops. Completing the \"Scepter of the Shifting Sands\" questline offers a chance at the Black Qiraji Resonating Crystal mount.",
        "word_stats": {
          "original": 1199,
          "summary": 69,
          "reduction_percent": 94.2
        }
      },
      "Priest": {
        "summary": "<p>The War Effort begins July 10th, requiring players to gather resources to unlock the Gates of Ahn'Qiraj, leading to the Ruins of Ahn'Qiraj and Temple of Ahn'Qiraj raids. Priests can earn the <strong>Finery of Infinite Wisdom</strong> set (ring, cloak, mace) from the Ruins of Ahn'Qiraj and the <strong>Garments of the Oracle</strong> set (boots, mantle, tiara, trousers, vestments) from the Temple of Ahn'Qiraj by gaining reputation with the Cenarion Circle and Brood of Nozdormu, respectively.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 74,
          "reduction_percent": 93.8
        }
      },
      "Paladin": {
        "summary": "<p>The War Effort event, starting July 10, involves contributing resources to unlock the Ahn'Qiraj raids. Paladins can earn two new class armor sets: </p>\n<ul>\n  <li><p><b>Battlegear of Eternal Justice</b> (Tier 2.5) from Ruins of Ahn'Qiraj, featuring a ring, cloak, and 1H sword.</p></li>\n  <li><p><b>Avenger's Battlegear</b> (Tier 3 equivalent) from Temple of Ahn'Qiraj, including breastplate, crown, greaves, leggings, and spaulders.</p></li>\n</ul>\n<p>Completing the \"Scepter of the Shifting Sands\" questline can also award the Black Qiraji Resonating Crystal mount.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 76,
          "reduction_percent": 93.7
        }
      },
      "Hunter": {
        "summary": "<p>The War Effort event begins July 10th, opening Ahn'Qiraj raids. Hunters can earn two new class armor sets:</p>\n<ul>\n  <li><strong>Trappings of the Unseen Path:</strong> Includes a ring, cloak, and 1H axe.</li>\n  <li><strong>Striker's Guard:</strong> A 5-piece set with helm, shoulders, chest, gloves, and leggings.</li>\n</ul>\n<p>These sets are obtained from the Ruins of Ahn'Qiraj and Temple of Ahn'Qiraj raids and by gaining reputation with the Cenarion Circle and Brood of Nozdormu.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 70,
          "reduction_percent": 94.2
        }
      },
      "Warlock": {
        "summary": "<p>For Warlocks, The War Effort signifies the opening of the Gates of Ahn'Qiraj, granting access to the Ruins of Ahn'Qiraj (20-player) and Temple of Ahn'Qiraj (40-player) raids.</p>\n\n<p>Players can contribute supplies to their faction's war effort. Completing the \"Scepter of the Shifting Sands\" questline and the \"Bang a Gong!\" quest is necessary to ring the gong and open the gates. Warlocks can earn the unique Tier 2.5 raid set, \"Doomcaller's Attire,\" from bosses in these raids and by gaining reputation with the Brood of Nozdormu.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 85,
          "reduction_percent": 92.9
        }
      },
      "Death Knight": {
        "summary": "<p>The War Effort begins July 10th, requiring faction-wide resource contributions to unlock Ahn'Qiraj raids. Death Knights can earn the <strong>Deathdealer's Embrace</strong> tier set from the Ruins of Ahn'Qiraj and the <strong>Deathdealer's Embrace</strong> (Tier 2.5) set by collecting tokens, class-specific idols, and scarabs from both Ahn'Qiraj raid instances and gaining reputation with the Brood of Nozdormu.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 55,
          "reduction_percent": 95.4
        }
      },
      "Druid": {
        "summary": "<p>Druids can earn two new class armor sets in preparation for Ahn'Qiraj content. The <strong>Symbols of Unending Life</strong> set (Ring, Cloak, 1H Mace) can be acquired from the Ruins of Ahn'Qiraj (20-player) by gaining Reputation with the Cenarion Circle. The <strong>Genesis Raiment</strong> (Boots, Helm, Shoulderpads, Trousers, Vest) is a Tier 2.5 set obtainable from the Temple of Ahn'Qiraj (40-player) by gaining Reputation with the Brood of Nozdormu and collecting specific raid tokens.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 72,
          "reduction_percent": 94
        }
      },
      "Monk": {
        "summary": "<p>The War Effort begins July 10th, allowing players to contribute supplies to open the Gates of Ahn'Qiraj, granting access to the Ruins of Ahn'Qiraj and Temple of Ahn'Qiraj raids. The first player to complete the \"Bang a Gong!\" quest earns the Black Qiraji Resonating Crystal mount.</p>\n\n<p>Completing the \"Scepter of the Shifting Sands\" questline and \"Bang a Gong!\" within a 10-hour window rewards the mount. Players who finish \"The Might of Kalimdor\" are eligible for an Epic weapon. Both Ahn'Qiraj raids offer new class armor sets. The Monk class can obtain the <span style=\"color: green;\"><b>Genesis Raiment</b></span> set from the Ruins of Ahn'Qiraj and the <span style=\"color: green;\"><b>Deathdealer's Embrace</b></span> set from the Temple of Ahn'Qiraj.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 114,
          "reduction_percent": 90.5
        }
      },
      "Evoker": {
        "summary": "<p>While this blog post details the War Effort for the opening of Ahn'Qiraj and the introduction of new raid content, <strong>it does not contain any information directly relevant to the Evoker class in Retail WoW, The War Within, or later expansions.</strong> The post focuses on classic era content and achievements.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 50,
          "reduction_percent": 95.8
        }
      },
      "Demon Hunter": {
        "summary": "<p>The War Effort begins July 10th, requiring players to contribute supplies to unlock the Ahn'Qiraj raids.  Upon completion of the \"Scepter of the Shifting Sands\" questline, the first player to ring the gong earns the Black Qiraji Resonating Crystal mount.  Both Ruins of Ahn'Qiraj and Temple of Ahn'Qiraj raids will be available, offering new class armor sets. Demon Hunters are not mentioned.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 62,
          "reduction_percent": 94.8
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The War Effort begins July 10th, requiring players to gather immense amounts of resources for their faction to unlock the Gates of Ahn'Qiraj. Upon completion, players can participate in the 20-player <b>Ruins of Ahn'Qiraj</b> and the 40-player <b>Temple of Ahn'Qiraj</b> raids. Completing the \"Bang a Gong!\" quest grants the Black Qiraji Resonating Crystal mount. Both raids offer new class armor sets obtainable through boss drops and reputation with the Cenarion Circle and Brood of Nozdormu.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 75,
          "reduction_percent": 93.7
        }
      },
      "Raiding": {
        "summary": "<p>The War Effort begins July 10, unlocking the <b>Ruins of Ahn'Qiraj</b> (20-player) and <b>Temple of Ahn'Qiraj</b> (40-player) raids. Players must gather resources to open the Gates of Ahn'Qiraj, with the first to complete the \"Bang a Gong!\" quest earning the Black Qiraji Resonating Crystal mount. Completing specific quest steps makes players eligible for an epic weapon. Both raids offer new class armor sets, including the Tier 2.5 set from Temple of Ahn'Qiraj.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 72,
          "reduction_percent": 94
        }
      },
      "M+": {
        "summary": "<p>This blog post announces the start of \"The War Effort\" on July 10, leading to the opening of the Ahn'Qiraj raids. While the post focuses on Classic WoW's Ahn'Qiraj content, it also details rewards such as the Black Qiraji Resonating Crystal mount and new class armor sets (Tier 2.5) obtainable from the 20-player Ruins of Ahn'Qiraj and 40-player Temple of Ahn'Qiraj raids.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 62,
          "reduction_percent": 94.8
        }
      },
      "PvP": {
        "summary": "<p>The War Effort begins July 10th, requiring players to gather resources for their faction to open the Gates of Ahn'Qiraj.</p>\n<p>The first player to complete the \"Bang a Gong!\" quest, after finishing the \"Scepter of the Shifting Sands\" questline, will earn the <b>Black Qiraji Resonating Crystal</b> mount.</p>\n<p>Upon ringing the gong, a 10-hour window opens for players to complete their quests and earn the mount. Completing the questline up to \"The Might of Kalimdor\" rewards an Epic weapon.</p>\n<p>Two new raid instances, Ruins of Ahn'Qiraj (20-player) and Temple of Ahn'Qiraj (40-player), will unlock, offering new class armor sets.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 98,
          "reduction_percent": 91.8
        }
      },
      "Open World": {
        "summary": "<p>The War Effort begins July 10, requiring players to turn in vast quantities of supplies to open the Gates of Ahn'Qiraj. This event grants access to the 20-player Ruins of Ahn'Qiraj and the 40-player Temple of Ahn'Qiraj raids. The first player to complete the \"Bang a Gong!\" quest after the server's War Effort completion will earn the unique Black Qiraji Resonating Crystal mount. Completing the associated questline also rewards players with epic weapon choices.</p>",
        "word_stats": {
          "original": 1199,
          "summary": 74,
          "reduction_percent": 93.8
        }
      }
    }
  },
  {
    "id": "wow-weekly-the-legacy-of-arathor-arrives-june-17-and-more",
    "title": "WoW Weekly: The Legacy of Arathor Arrives June 17, and More!",
    "date": "2025-06-13",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24213948/wow-weekly-the-legacy-of-arathor-arrives-june-17-and-more",
    "summary": "The \"Legacy of Arathor\" content update, launching June 17th, brings \"Overcharged Delves,\" Lorewalker Cho's Lorewalking, and new UI helpers like the Combat Assistant. The \"Rise of the Red Dawn\" story campaign features Faerin, Danath, and Geya'rah uncovering a conspiracy in the Arathi Highlands. Additionally, a short story, \"Faith & Flame,\" narrated by Faerin Lothar, is available.",
    "word_stats": {
      "original": 388,
      "summary": 56,
      "reduction_percent": 85.6
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>The <strong>Legacy of Arathor</strong> content update, live June 17, introduces <strong>Overcharged Delves</strong> and a new story campaign, <em>Rise of the Red Dawn</em>, set in the Arathi Highlands. <br>New UI options, <strong>Assisted Highlight</strong> and <strong>Single-Button Assistant</strong>, are also being added to aid players in learning classes or alternate characters, benefiting Warriors looking to explore new playstyles or improve accessibility.</p>",
        "word_stats": {
          "original": 388,
          "summary": 58,
          "reduction_percent": 85.1
        }
      },
      "Mage": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, launching June 17, introduces <b>Assisted Highlight and Single-Button Assistant</b> UI options. These features aim to help players learn new classes or alternate characters, potentially benefiting Mages exploring different specs or new players.</p>",
        "word_stats": {
          "original": 388,
          "summary": 37,
          "reduction_percent": 90.5
        }
      },
      "Rogue": {
        "summary": "<p>The <b>Legacy of Arathor</b> content update, launching June 17, introduces new UI options to assist players. The <b>Combat Assistant</b> and <b>Single-Button Assistant</b> aim to ease learning new classes or alts. This update also features the <b>Rise of the Red Dawn</b> story campaign in the Arathi Highlands, involving a conspiracy and faction-based viewpoints. While Rogues are not directly mentioned, these accessibility features could benefit any class.</p>",
        "word_stats": {
          "original": 388,
          "summary": 65,
          "reduction_percent": 83.2
        }
      },
      "Priest": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, launching June 17, introduces new UI options for <b>Priests</b>: the <b>Assisted Highlight</b> and <b>Single-Button Assistant</b>. These aim to lower the barrier for new players, those exploring alternate characters, or players seeking accessibility options. The update also features the \"Rise of the Red Dawn\" story campaign in the Arathi Highlands and a short story titled \"Faith & Flame\" featuring Faerin Lothar.</p>",
        "word_stats": {
          "original": 388,
          "summary": 65,
          "reduction_percent": 83.2
        }
      },
      "Paladin": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, live June 17, introduces new UI options: <b>Assisted Highlight</b> and <b>Single-Button Assistant</b>. These aim to lower the barrier for new players or those trying alternate characters, potentially benefiting Paladins learning their kit. The update also features the <b>Rise of the Red Dawn</b> story campaign in the Arathi Highlands and a short story, \"Faith & Flame,\" focusing on Faerin Lothar.</p>",
        "word_stats": {
          "original": 388,
          "summary": 64,
          "reduction_percent": 83.5
        }
      },
      "Hunter": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, launching June 17, introduces new UI options: <b>Assisted Highlight</b> and <b>Single-Button Assistant</b>. These features aim to help players learn new classes, like the Hunter, or explore alternate characters by simplifying gameplay, catering to new players, those trying new specs, or for accessibility.</p>",
        "word_stats": {
          "original": 388,
          "summary": 47,
          "reduction_percent": 87.9
        }
      },
      "Warlock": {
        "summary": "The <span style=\"font-weight: bold;\">Legacy of Arathor</span> content update, live June 17, introduces new UI options. The <span style=\"font-weight: bold;\">Assisted Highlight</span> and <span style=\"font-weight: bold;\">Single-Button Assistant</span> aim to help players learn new classes or alternate characters, continuing evolution from the Cooldown Manager. The update also features the <span style=\"font-weight: bold;\">Rise of the Red Dawn</span> story campaign in the Arathi Highlands.",
        "word_stats": {
          "original": 388,
          "summary": 59,
          "reduction_percent": 84.8
        }
      },
      "Death Knight": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, launching June 17, introduces new UI options: <b>Assisted Highlight</b> and <b>Single-Button Assistant</b>, designed to help players learn classes or alts. The update also features the <b>Rise of the Red Dawn</b> story campaign in the Arathi Highlands, where players join Faerin, Danath, and Geya'rah to uncover a conspiracy. This storyline offers branching viewpoints based on character faction.</p>",
        "word_stats": {
          "original": 388,
          "summary": 61,
          "reduction_percent": 84.3
        }
      },
      "Druid": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, launching June 17, introduces new content and UI assists. While the text doesn't specifically detail Druid changes, it mentions improvements like the <b>Combat Assistant</b> and <b>Single-Button Assistant</b>. These accessibility options are designed to help players learn new classes or characters, potentially benefiting Druids exploring new specializations or returning to the class.</p>",
        "word_stats": {
          "original": 388,
          "summary": 56,
          "reduction_percent": 85.6
        }
      },
      "Monk": {
        "summary": "<p>The upcoming <strong>Legacy of Arathor</strong> content update, launching June 17, introduces new UI options: <strong>Assisted Highlight</strong> and <strong>Single-Button Assistant</strong>. These features aim to ease the learning curve for new players or those trying alternate characters, including Monks. The update also features a new story campaign, \"Rise of the Red Dawn,\" and Overcharged Delves.</p>",
        "word_stats": {
          "original": 388,
          "summary": 53,
          "reduction_percent": 86.3
        }
      },
      "Evoker": {
        "summary": "The <b>Legacy of Arathor</b> content update, launching June 17, introduces <b>Assisted Highlight</b> and <b>Single-Button Assistant</b> UI options. These features aim to assist players in learning new classes or characters, enhancing accessibility and meaningful gameplay. The update also features the <b>Rise of the Red Dawn</b> story campaign, focusing on Faerin and new threats in the Arathi Highlands.",
        "word_stats": {
          "original": 388,
          "summary": 56,
          "reduction_percent": 85.6
        }
      },
      "Demon Hunter": {
        "summary": "<p>The <strong>Legacy of Arathor</strong> content update, launching June 17, introduces new challenges like <strong>Overcharged Delves</strong> and a story campaign, \"Rise of the Red Dawn,\" in the Arathi Highlands, featuring characters like Faerin.</p>\n\n<p>For accessibility and ease of learning new classes or alternate characters, the update includes new UI options: <strong>Assisted Highlight</strong> and <strong>Single-Button Assistant</strong>, building upon existing features like the Cooldown Manager.</p>",
        "word_stats": {
          "original": 388,
          "summary": 62,
          "reduction_percent": 84
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The <b>Legacy of Arathor</b> content update, launching June 17, introduces <b>Overcharged Delves</b>. This update also brings new UI options: the Assisted Highlight and Single-Button Assistant, designed to aid players in learning classes and accessibility.</p>",
        "word_stats": {
          "original": 388,
          "summary": 34,
          "reduction_percent": 91.2
        }
      },
      "Raiding": {
        "summary": "<p>The <b>Legacy of Arathor</b> content update, launching June 17, introduces <b>Overcharged Delves</b>, which may offer increased challenge. While not directly detailed, the update focuses on story campaigns and UI improvements designed to lower the barrier for new and returning players, potentially impacting the onboarding experience for those looking to engage with challenging content.</p>",
        "word_stats": {
          "original": 388,
          "summary": 53,
          "reduction_percent": 86.3
        }
      },
      "M+": {
        "summary": "<p>The <strong>Legacy of Arathor</strong> content update, live June 17, introduces <strong>Overcharged Delves</strong>, a new challenge type. Additionally, the update offers UI enhancements like the <strong>Combat Assistant and Single-Button Assistant</strong>, designed to help players learn new classes or characters. These accessibility options aim to lower the barrier to entry for various player types.</p>",
        "word_stats": {
          "original": 388,
          "summary": 52,
          "reduction_percent": 86.6
        }
      },
      "PvP": {
        "summary": "<p>The \"Legacy of Arathor\" content update, launching June 17, introduces a new story campaign in the Arathi Highlands focusing on a conflict between Stromgarde and Hammerfall. Players will experience branching viewpoints based on their character's faction, aiming to expose a conspiracy and defuse tensions.</p>",
        "word_stats": {
          "original": 388,
          "summary": 44,
          "reduction_percent": 88.7
        }
      },
      "Open World": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, launching June 17, introduces new content for <b>Retail WoW</b> players.</p>\n<p>Players can engage with a new storyline in the <b>Arathi Highlands</b>, focusing on a conspiracy threatening Stromgarde and Hammerfall. This story features branching viewpoints based on faction. Additionally, the update includes UI enhancements like the <b>Combat Assistant</b> and <b>Single-Button Assistant</b> to help players learn classes or alts.</p>",
        "word_stats": {
          "original": 388,
          "summary": 62,
          "reduction_percent": 84
        }
      }
    }
  },
  {
    "id": "legacy-of-arathor-update-notes",
    "title": "Legacy of Arathor Update Notes",
    "date": "2025-06-12",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24206706/legacy-of-arathor-update-notes",
    "summary": "The \"Legacy of Arathor\" update for World of Warcraft introduces a new campaign questline, \"Rise of the Red Dawn,\" offering faction-specific rewards. Players can also \"Lorewalk\" with Lorewalker Cho, revisiting Azeroth's history and earning unique toys. The update includes \"Overcharged Delves\" for increased challenge and loot, and new UI options like \"Assisted Highlight\" and \"Single-Button Assistant\" to aid players. Battle for Azeroth dungeons join the Timewalking rotation, and the Greedy Emissary returns with new rewards. Class adjustments and Timewalking dungeon tuning are also included.",
    "word_stats": {
      "original": 1389,
      "summary": 84,
      "reduction_percent": 94
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces new content for Warriors. A new campaign questline, <b>Rise of the Red Dawn</b>, is available in the Arathi Highlands. Warriors can also enhance their gameplay with new UI options like <b>Assisted Highlight</b> and <b>Single-Button Assistant</b>, designed to help with ability rotations. The update also brings <b>Overcharged Delves</b> with new challenges and rewards, and Battle for Azeroth Timewalking dungeons. Additionally, Warriors receive a new ability: <b>Recuperate</b>, which restores 50% of maximum health over 10 seconds.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 80,
          "reduction_percent": 94.2
        }
      },
      "Mage": {
        "summary": "<p>The latest World of Warcraft update introduces new UI options for Mages, including an <strong>Assisted Highlight</strong> feature that suggests your next ability based on your situation and resources. A <strong>Single-Button Assistant</strong> can cast these recommended abilities sequentially, offering a helpful tool for learning rotations or casual play. Additionally, Battle for Azeroth Timewalking dungeons are now available, offering new challenges and rewards.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 61,
          "reduction_percent": 95.6
        }
      },
      "Rogue": {
        "summary": "<p>The <span style=\"color: #ff0000;\">Legacy of Arathor</span> update brings a new campaign questline, \"Rise of the Red Dawn,\" with faction-specific rewards. Lorewalker Cho offers repeatable storylines focusing on Xal'atath, Ethereals, and The Lich King, with new toys as rewards. Overcharged Delves offer increased challenge and new loot, including a belt. New UI options like <span style=\"color: #0000ff;\">Assisted Highlight</span> and <span style=\"color: #0000ff;\">Single-Button Assistant</span> aim to help players learn rotations. Battle for Azeroth Timewalking dungeons are added. Rogues receive a new ability: <span style=\"color: #00ff00;\">Recuperate</span>, which restores 50% health over 10 seconds.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 90,
          "reduction_percent": 93.5
        }
      },
      "Priest": {
        "summary": "<p>The Legacy of Arathor update brings new content and features to World of Warcraft. For <strong>Priests</strong>, a new ability, <strong>Recuperate</strong>, has been added, allowing them to restore 50% of their health over 10 seconds by preparing food. Additionally, the UI now includes <strong>Assisted Highlight</strong> to suggest abilities and a <strong>Single-Button Assistant</strong> for automated spell casting, aimed at aiding new players or those learning new specializations. Timewalking dungeons have also been adjusted for a more authentic class experience, with increased enemy and boss health, and improved scaling for both lower- and higher-geared players.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 92,
          "reduction_percent": 93.4
        }
      },
      "Paladin": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces a new campaign questline, \"Rise of the Red Dawn,\" with faction-specific rewards. Players can also explore Azeroth's lore with Lorewalker Cho, revisiting stories of Xal'atath, Ethereals, and The Lich King. Additionally, new UI features like <b>Assisted Highlight</b> and <b>Single-Button Assistant</b> are available to aid players in learning ability rotations and specializations.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 57,
          "reduction_percent": 95.9
        }
      },
      "Hunter": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces new features relevant to Hunters.</p>\n\n<p><b>New UI Options:</b></p>\n<ul>\n  <li><b>Assisted Highlight:</b> Recommends the next ability based on situation and resources, aiding new players or those trying new specializations.</li>\n  <li><b>Single-Button Assistant:</b> Casts the next recommended ability, with a small GCD delay for learning and casual play. Can detect AoE usage.</li>\n</ul>\n\n<p><b>Classes:</b></p>\n<ul>\n  <li><b>New Ability: Recuperate</b> - Restores 50% health over 10 seconds.</li>\n</ul>\n\n<p><b>Timewalking Dungeons:</b></p>\n<ul>\n  <li>Enemy and boss health increased for more authentic encounters and class rotation practice.</li>\n  <li>Scaling adjusted for lower-geared players to be more damage-resistant and geared players to feel more impactful incoming damage.</li>\n  <li>Dungeons now drop Adventurer gear and reward more Timewarped Badges.</li>\n</ul>",
        "word_stats": {
          "original": 1389,
          "summary": 114,
          "reduction_percent": 91.8
        }
      },
      "Warlock": {
        "summary": "<p>The Legacy of Arathor update introduces several features relevant to Warlocks.  Lorewalker Cho offers repeatable storylines exploring the history of Xal'atath, the Ethereals, and The Lich King, with a toy granting a voice echo of Xal'atath upon defeating foes.  New UI options, Assisted Highlight and Single-Button Assistant, can aid in learning or executing damage rotations, including Area of Effect spells. Timewalking dungeons have adjusted difficulty scaling and drop Adventurer gear. The Greedy Emissary event returns with potential recolors of classic Tier 2 armor sets.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 84,
          "reduction_percent": 94
        }
      },
      "Death Knight": {
        "summary": "<p>The Legacy of Arathor update brings new content and features relevant to Death Knights. A new campaign questline, \"Rise of the Red Dawn,\" offers faction-specific rewards like tabards and titles. Players can delve into three repeatable Lorewalking storylines about Xal'atath, Ethereals, and The Lich King, with one specifically featuring The Lich King. Overcharged Delves introduce new challenges and rewards. The update also includes a new ability, \"Recuperate,\" which restores 50% health over 10 seconds. Timewalking dungeons will see adjusted difficulty scaling and increased rewards.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 84,
          "reduction_percent": 94
        }
      },
      "Druid": {
        "summary": "<p>The \"Legacy of Arathor\" update introduces <strong>new UI options</strong>, including \"Assisted Highlight\" and \"Single-Button Assistant,\" designed to help players, including Druids, learn their rotations and abilities. The blog post also mentions a new class ability, <strong>Recuperate</strong>, which restores 50% of maximum health over 10 seconds.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 45,
          "reduction_percent": 96.8
        }
      },
      "Monk": {
        "summary": "<p>The \"Legacy of Arathor\" update for Retail WoW introduces a new Monk ability, <strong>Recuperate</strong>, which restores 50% of maximum health over 10 seconds by allowing the Monk to rest and eat.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 31,
          "reduction_percent": 97.8
        }
      },
      "Evoker": {
        "summary": "<p>The <b>Evoker</b> class is not directly mentioned in the provided blog post regarding upcoming content for Retail WoW, The War Within, and beyond. Therefore, no specific content relevant to the Evoker class can be summarized from this text.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 38,
          "reduction_percent": 97.3
        }
      },
      "Demon Hunter": {
        "summary": "<p>The <a href=\"#\">Legacy of Arathor</a> update introduces several new features and content. For Demon Hunters specifically, the new UI options, <a href=\"#\">Assisted Highlight</a> and <a href=\"#\">Single-Button Assistant</a>, can help guide ability usage for new or returning players. Additionally, Timewalking dungeons will now feature adjusted difficulty scaling, increased enemy health, and drop \"Adventurer\" gear, providing a more authentic class experience.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 59,
          "reduction_percent": 95.8
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces <b>Overcharged Delves</b>, featuring six new locations in Khaz Algar with increased challenge and a new Delve-specific affix. Players can tackle Titan enemies and traps, unlock traits in a new tree, and earn rewards like the <b>OC91 Chariot</b> mount and the upgradeable <b>Durable Information Securing Container</b> belt.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 52,
          "reduction_percent": 96.3
        }
      },
      "Raiding": {
        "summary": "<p>The <a href=\"https://worldofwarcraft.blizzard.com/en-us/news/24091668/legacy-of-arathor-is-here\">Legacy of Arathor</a> update introduces \"Overcharged Delves\" with increased challenge and new affixes across six locations in Khaz Algar, offering new loot and a trait tree. Timewalking dungeons are also receiving adjustments to enemy health and scaling to provide a more authentic experience, encouraging players to learn their class rotations.  The update also brings UI enhancements like \"Assisted Highlight\" and \"Single-Button Assistant\" to help players with ability usage.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 70,
          "reduction_percent": 95
        }
      },
      "M+": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces <b>Overcharged Delves</b>, featuring six new Delves with increased challenge, a new Delve-specific affix, and rewards like a new mount and belt transmog. This update also brings <b>Assisted Highlight</b> and <b>Single-Button Assistant</b> UI options to aid players with ability rotations, and expands the <b>Timewalking</b> rotation to include Battle for Azeroth dungeons.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 56,
          "reduction_percent": 96
        }
      },
      "PvP": {
        "summary": "<p>The \"Legacy of Arathor\" update focuses on <a href=\"#overcharged-delves\">Overcharged Delves</a> with a new affix for increased challenge. Additionally, the blog details two new UI options: <strong>Assisted Highlight</strong>, which suggests abilities, and <strong>Single-Button Assistant</strong>, which casts them. These are designed to aid new players or those exploring new specializations, potentially offering a more casual experience with abilities.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 56,
          "reduction_percent": 96
        }
      },
      "Open World": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces the <b>Rise of the Red Dawn</b> campaign questline in the Arathi Highlands, offering faction-specific rewards. Players can revisit Azeroth's lore with <b>Lorewalker Cho</b> through repeatable storylines, earning unique toys. Six new <b>Overcharged Delves</b> in Khaz Algar present increased challenges and rewards, including a new mount and transmog. The update also brings new UI options, <b>Assisted Highlight</b> and <b>Single-Button Assistant</b>, to aid players. Additionally, <b>Battle for Azeroth</b> Timewalking dungeons are returning, alongside the Greedy Emissary event with enhanced Treasure Goblins.</p>",
        "word_stats": {
          "original": 1389,
          "summary": 85,
          "reduction_percent": 93.9
        }
      }
    }
  },
  {
    "id": "legacy-of-arathor-get-an-assist-with-new-ui-options",
    "title": "Legacy of Arathor: Get an Assist With New UI Options",
    "date": "2025-06-11",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24205457/legacy-of-arathor-get-an-assist-with-new-ui-options",
    "summary": "World of Warcraft's \"Legacy of Arathor\" update introduces two UI features to help players learn classes or alts:\n\n*   **Assisted Highlight:** Highlights recommended DPS abilities based on your character's situation.\n*   **Single-Button Assistant:** A single button that casts the next recommended damage ability, including AoE when appropriate.\n\nThese features aim to lower the barrier to entry for new or returning players, and offer accessibility options for a more casual experience.",
    "word_stats": {
      "original": 381,
      "summary": 70,
      "reduction_percent": 81.6
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>In the <strong>Legacy of Arathor</strong> update, Warriors can benefit from new UI assists. <strong>Assisted Highlight</strong> will recommend the next damage ability in your rotation, aiding new players or those trying new specializations. The <strong>Single-Button Assistant</strong> allows casting the next recommended damage ability with one button, including detecting AoE usage. These features focus on damage abilities and are designed for accessibility and a more casual experience.</p>",
        "word_stats": {
          "original": 381,
          "summary": 65,
          "reduction_percent": 82.9
        }
      },
      "Mage": {
        "summary": "<p>\n    The upcoming <strong>Legacy of Arathor</strong> update introduces two new UI options to aid players: <strong>Assisted Highlight</strong> and <strong>Single-Button Assistant</strong>.\n</p>\n<p>\n    <strong>Assisted Highlight</strong> suggests the next recommended damage ability based on your current situation and resources.\n</p>\n<p>\n    The <strong>Single-Button Assistant</strong> automates casting the next recommended damage ability, including AoE when appropriate, with a slight GCD increase.\n</p>\n<p>\n    These features are designed for new players, those trying new specializations, or players seeking additional guidance and accessibility.\n</p>",
        "word_stats": {
          "original": 381,
          "summary": 79,
          "reduction_percent": 79.3
        }
      },
      "Rogue": {
        "summary": "<p>The upcoming <strong>Legacy of Arathor</strong> update introduces two UI features beneficial to Rogues:</p>\n<ul>\n    <li><strong>Assisted Highlight:</strong> Recommends the next damage ability to use, aiding new players, spec changers, or those seeking guidance. It focuses on DPS abilities.</li>\n    <li><strong>Single-Button Assistant:</strong> Casts the next recommended damage ability sequentially, including AoE when appropriate. A slight GCD is added.</li>\n</ul>\n<p>These features aim to lower the barrier for new players and offer accessibility options.</p>",
        "word_stats": {
          "original": 381,
          "summary": 70,
          "reduction_percent": 81.6
        }
      },
      "Priest": {
        "summary": "<p>The <strong>Legacy of Arathor</strong> update introduces new UI aids for players. <strong>Assisted Highlight</strong> will recommend your next ability, focusing on damage rotation. <strong>Single-Button Assistant</strong> allows casting the next recommended damage ability with one button, including AoE detection. These features are designed to help new players, those trying new specs, or for a more casual experience. Both are optional accessibility features and will continue to evolve.</p>",
        "word_stats": {
          "original": 381,
          "summary": 65,
          "reduction_percent": 82.9
        }
      },
      "Paladin": {
        "summary": "<p>The <em>Legacy of Arathor</em> update introduces two new UI aids for learning classes and specializations. <strong>Assisted Highlight</strong> will show the next recommended damage ability, helping players with rotations. The <strong>Single-Button Assistant</strong> consolidates recommended damage abilities into one button, with a small GCD between casts, and can also detect AoE situations. Both features focus on DPS abilities and are designed for accessibility, aiming to lower the entry barrier for new or returning players.</p>",
        "word_stats": {
          "original": 381,
          "summary": 72,
          "reduction_percent": 81.1
        }
      },
      "Hunter": {
        "summary": "<p>The upcoming <b>Legacy of Arathor</b> update introduces two UI features beneficial for Hunters:</p>\n\n<ul>\n  <li><b>Assisted Highlight:</b> Highlights recommended damage abilities based on your current situation and resources, aiding new players, spec switchers, or those seeking guidance.</li>\n  <li><b>Single-Button Assistant:</b> A single button to cast the next recommended damage ability, including AoE when appropriate. A small GCD is added between casts.</li>\n</ul>\n\n<p>These options aim to lower the barrier to entry and improve accessibility for all players.</p>",
        "word_stats": {
          "original": 381,
          "summary": 75,
          "reduction_percent": 80.3
        }
      },
      "Warlock": {
        "summary": "<p>In the <strong>Legacy of Arathor</strong> update, two UI features are being introduced to assist players, including Warlocks:</p>\n\n<ul>\n  <li>\n    <strong>Assisted Highlight:</strong> This option highlights recommended damage abilities for your current specialization, aiding new players or those exploring different specs. It focuses on DPS abilities only.\n  </li>\n  <li>\n    <strong>Single-Button Assistant:</strong> For a more casual experience, this button casts the next recommended damage-dealing ability, including AoE when appropriate. A small global cooldown applies between uses.\n  </li>\n</ul>\n\n<p>These features aim to make learning and playing classes more accessible.</p>",
        "word_stats": {
          "original": 381,
          "summary": 86,
          "reduction_percent": 77.4
        }
      },
      "Death Knight": {
        "summary": "<p>The upcoming <b>Legacy of Arathor</b> update introduces two new UI options: <b>Assisted Highlight</b> and <b>Single-Button Assistant</b>. These features aim to help players learn new classes or specializations. Assisted Highlight will visually guide you to the next recommended damage ability. The Single-Button Assistant consolidates the recommended damage ability into a single button press, which also detects AoE usage. Both features focus on DPS abilities and are intended to be accessible, with the Single-Button Assistant adding a small GCD between actions. These additions are designed for players seeking guidance or a more casual experience.</p>",
        "word_stats": {
          "original": 381,
          "summary": 92,
          "reduction_percent": 75.9
        }
      },
      "Druid": {
        "summary": "<p>The Legacy of Arathor update introduces two new UI options for <span style=\"font-weight: bold;\">Druids</span> and other classes, aiming to improve accessibility:</p>\n<ul>\n    <li><span style=\"font-weight: bold;\">Assisted Highlight:</span> Recommends the next damage-dealing ability in your rotation.</li>\n    <li><span style=\"font-weight: bold;\">Single-Button Assistant:</span> Casts the next recommended damage ability, including AoE when appropriate.</li>\n</ul>\n<p>These features are designed to help new players, those trying new specializations, or players seeking casual gameplay assistance.</p>",
        "word_stats": {
          "original": 381,
          "summary": 67,
          "reduction_percent": 82.4
        }
      },
      "Monk": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces two new UI features to help players, including Monks:</p>\n<ul>\n  <li><b>Assisted Highlight:</b> Highlights the next recommended damage ability in your rotation, aiding new players or those trying a new specialization.</li>\n  <li><b>Single-Button Assistant:</b> A single button to cast the next recommended damage ability, with an added GCD between uses. It also detects when AoE is appropriate.</li>\n</ul>\n<p>These features are designed to be accessibility options to lower the barrier to entry for learning new classes or specializations.</p>",
        "word_stats": {
          "original": 381,
          "summary": 82,
          "reduction_percent": 78.5
        }
      },
      "Evoker": {
        "summary": "<p>The <strong>Legacy of Arathor</strong> update introduces two new UI features for <strong>Retail WoW</strong> players:</p>\n<ul>\n  <li><strong>Assisted Highlight:</strong> Recommends the next damage ability based on resources and the situation. Focuses on DPS abilities only.</li>\n  <li><strong>Single-Button Assistant:</strong> A button to cast the next recommended damage ability, including AoE when appropriate. A small GCD is added between abilities.</li>\n</ul>\n<p>These features aim to help players learn new classes or specializations, including the <strong>Evoker</strong>, or provide accessibility options.</p>",
        "word_stats": {
          "original": 381,
          "summary": 74,
          "reduction_percent": 80.6
        }
      },
      "Demon Hunter": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces two new UI features for all classes, including Demon Hunter, to aid in learning or relearning specs:</p>\n<ul>\n  <li><b>Assisted Highlight:</b> Highlights the next recommended DPS ability based on your situation and resources. It does not include buffs, healing, or mitigation.</li>\n  <li><b>Single-Button Assistant:</b> A single button to cast the next recommended damage ability, including AOE when appropriate. A small GCD is added between casts.</li>\n</ul>\n<p>These features aim to improve accessibility and lower the entry barrier for players.</p>",
        "word_stats": {
          "original": 381,
          "summary": 83,
          "reduction_percent": 78.2
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The Legacy of Arathor update introduces UI enhancements for new and returning players. <strong>Assisted Highlight</strong> visually guides ability usage for damage rotations. The <strong>Single-Button Assistant</strong> casts the next recommended damage ability with a small GCD, and also detects AoE opportunities. Both aim to lower the barrier to entry for various player types.</p>",
        "word_stats": {
          "original": 381,
          "summary": 52,
          "reduction_percent": 86.4
        }
      },
      "Raiding": {
        "summary": "<p>The Legacy of Arathor update introduces two new UI features aimed at easing the learning curve for players: <strong>Assisted Highlight</strong> and <strong>Single-Button Assistant</strong>. Assisted Highlight suggests the next recommended damage ability based on your character's situation. The Single-Button Assistant, on the other hand, allows players to cast the next recommended damage ability with a single button press. These features are intended to assist new players or those exploring new specializations, though they primarily focus on DPS abilities.</p>",
        "word_stats": {
          "original": 381,
          "summary": 77,
          "reduction_percent": 79.8
        }
      },
      "M+": {
        "summary": "<p>The Legacy of Arathor update introduces UI enhancements for players new to a class or spec. <strong>Assisted Highlight</strong> guides DPS rotations by highlighting recommended abilities. The <strong>Single-Button Assistant</strong> allows casting the next recommended damage ability with a single click, featuring a slight GCD increase. Both are designed to aid players seeking guidance or accessibility, with a focus on DPS abilities and evolving over time.</p>",
        "word_stats": {
          "original": 381,
          "summary": 64,
          "reduction_percent": 83.2
        }
      },
      "PvP": {
        "summary": "<p>The Legacy of Arathor update introduces <strong>Assisted Highlight</strong>, which suggests the next recommended <strong>DPS ability</strong> in your rotation. This feature is intended for new players or those exploring new specializations. The <strong>Single-Button Assistant</strong> allows casting recommended damage abilities with a single button, with a slight global cooldown penalty. Both are designed to lower the barrier to entry and are focused on Retail WoW content.</p>",
        "word_stats": {
          "original": 381,
          "summary": 64,
          "reduction_percent": 83.2
        }
      },
      "Open World": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces two UI features to assist players:</p>\n\n<ul>\n  <li><b>Assisted Highlight:</b> Highlights the next recommended damage ability based on your character's resources and situation. It's designed for new players, alts, or those seeking guidance on rotations.</li>\n  <li><b>Single-Button Assistant:</b> A single button that casts the next recommended damage ability in sequence. It also detects when to use AoE or multi-target spells in the open world. A small GCD is added between abilities.</li>\n</ul>\n\n<p>These features aim to lower the barrier for new players and those exploring alts, providing accessibility for more casual gameplay.</p>",
        "word_stats": {
          "original": 381,
          "summary": 96,
          "reduction_percent": 74.8
        }
      }
    }
  },
  {
    "id": "join-faerin-in-the-rise-of-the-red-dawn-story-campaign",
    "title": "Join Faerin in the Rise of the Red Dawn Story Campaign",
    "date": "2025-06-10",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24209850/join-faerin-in-the-rise-of-the-red-dawn-story-campaign",
    "summary": "A new questline, \"Rise of the Red Dawn,\" is now available in the Arathi Highlands for Level 80 characters. Players will join Faerin Lothar, Danath, and Geya'rah to uncover a conspiracy threatening the peace between Stromgarde and Hammerfall. The story offers branching viewpoints based on faction, with rewards including faction-specific tabards, the Lamplighter's Pauldrons transmog, and unique achievements and titles like \"<Name> of Stromgarde\" or \"<Name> of Hammerfall.\" The content update, \"Legacy of Arathor,\" launches June 17th.",
    "word_stats": {
      "original": 293,
      "summary": 77,
      "reduction_percent": 73.7
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>The \"Rise of the Red Dawn\" questline, set in the Arathi Highlands for level 80 characters, involves a new enemy threatening the peace. Players will join Faerin, Danath, and Geya'rah to uncover a conspiracy. Upon completion, Warriors can earn faction-specific tabards (Stromgarde or Hammerfall) and the \"Lamplighter's Pauldrons\" transmog, along with the \"Rise of the Red Dawn\" achievement and a faction-themed title.</p>",
        "word_stats": {
          "original": 293,
          "summary": 62,
          "reduction_percent": 78.8
        }
      },
      "Mage": {
        "summary": "<p>The blog post \"Rise of the Red Dawn\" details a new questline in the Arathi Highlands, launching with the <em>The War Within: Legacy of Arathor</em> update on June 17. Players will encounter Faerin Lothar and uncover a conspiracy.  While the post mentions faction-specific rewards like tabards, achievements, and titles, it does not contain any specific information relevant to the Mage class in Retail WoW or future expansions.</p>",
        "word_stats": {
          "original": 293,
          "summary": 67,
          "reduction_percent": 77.1
        }
      },
      "Rogue": {
        "summary": "<p>The <span style=\"font-weight: bold;\">\"Rise of the Red Dawn\"</span> questline in <span style=\"font-weight: bold;\">The War Within: Legacy of Arathor</span> launches June 17th. Rogues can engage with this new <span style=\"font-weight: bold;\">Level 80</span> story in the Arathi Highlands, dealing with a conspiracy and faction tensions. Completing the quest awards faction-specific tabards (Stromgarde or Hammerfall) and the <span style=\"font-weight: bold;\">\"Rise of the Red Dawn\"</span> achievement and title, along with the <span style=\"font-weight: bold;\">Lamplighter's Pauldrons</span> transmog. This content update deepens Faerin Lothar's story, with additional lore available through the short story \"<span style=\"font-weight: bold;\">Faith & Flame</span>\" and the audio novella \"<span style=\"font-weight: bold;\">Heartlands</span>.\"</p>",
        "word_stats": {
          "original": 293,
          "summary": 99,
          "reduction_percent": 66.2
        }
      },
      "Priest": {
        "summary": "<p>The <i>Rise of the Red Dawn</i> questline, set in Arathi Highlands and relevant to <b>The War Within</b>, offers rewards for all players. While no class-specific content for Priest is mentioned, upon completion, players can earn faction-specific tabards (Stromgarde for Alliance, Hammerfall for Horde). Additionally, the quest \"Past Glory\" grants the Lamplighter's Pauldrons transmog and a unique title, like \"<Name> of Stromgarde\" or \"<Name> of Hammerfall.\"</p>",
        "word_stats": {
          "original": 293,
          "summary": 65,
          "reduction_percent": 77.8
        }
      },
      "Paladin": {
        "summary": "<p>The \"Rise of the Red Dawn\" questline in <span style=\"font-weight: bold;\">The War Within</span> features Faerin Lothar, a character described as wielding the Sacred Flame. Players can earn transmog shoulders inspired by Faerin's appearance and faction-specific tabards. Additionally, a short story titled \"Faith & Flame,\" narrated by Faerin Lothar, delves further into her narrative.</p>",
        "word_stats": {
          "original": 293,
          "summary": 53,
          "reduction_percent": 81.9
        }
      },
      "Hunter": {
        "summary": "<p>The blog post announces the \"Rise of the Red Dawn\" questline in Arathi Highlands, launching with <i>The War Within</i>'s Legacy of Arathor update on June 17th. Hunters can earn faction-specific tabards (Stromgarde or Hammerfall) and the Lamplighter's Pauldrons transmog. Completing the quest grants the \"Rise of the Red Dawn\" achievement and a unique title.</p>",
        "word_stats": {
          "original": 293,
          "summary": 54,
          "reduction_percent": 81.6
        }
      },
      "Warlock": {
        "summary": "<p>The blog post announces the <b>\"Rise of the Red Dawn\"</b> questline in <em>The War Within: Legacy of Arathor</em>, launching June 17. Warlocks can participate by receiving a quest from Faerin Lothar in Dornogal. This Level 80 content explores a conspiracy in the Arathi Highlands with faction-specific rewards. Completing \"Past Glory\" grants the Lamplighter's Pauldrons transmog and a new title, such as \"<Name> of Stromgarde\" for Alliance or \"<Name> of Hammerfall\" for Horde.</p>",
        "word_stats": {
          "original": 293,
          "summary": 72,
          "reduction_percent": 75.4
        }
      },
      "Death Knight": {
        "summary": "<p>The \"Rise of the Red Dawn\" questline, available at level 80 in the Arathi Highlands, involves exposing a conspiracy threatening Stromgarde and Hammerfall.  Alliance characters receive the <strong>Stromgarde Tabard</strong>, while Horde characters earn the <strong>Hammerfall Tabard</strong>. Completing the \"Past Glory\" quest rewards the <strong>Lamplighter's Pauldrons</strong> transmog and faction-specific titles like \"<Name> of Stromgarde\" or \"<Name> of Hammerfall\".  This content is part of The War Within expansion and launches June 17th.</p>",
        "word_stats": {
          "original": 293,
          "summary": 70,
          "reduction_percent": 76.1
        }
      },
      "Druid": {
        "summary": "<p>The blog post details the <strong>Rise of the Red Dawn</strong> questline launching June 17th. While it doesn't mention specific Druid abilities or mechanics, it highlights new content relevant to <strong>The War Within</strong>, featuring:</p>\n<ul>\n  <li>A new storyline in the Arathi Highlands with faction-specific viewpoints.</li>\n  <li>Rewards including faction tabards (Stromgarde or Hammerfall) and the \"Lamplighter's Pauldrons\" transmog.</li>\n  <li>Achievements and titles: \"<Name> of Stromgarde\" or \"<Name> of Hammerfall\".</li>\n  <li>Further lore through the short story \"Faith & Flame\" and audio novella \"Heartlands\".</li>\n</ul>",
        "word_stats": {
          "original": 293,
          "summary": 80,
          "reduction_percent": 72.7
        }
      },
      "Monk": {
        "summary": "<p>This blog post details the <strong>\"Rise of the Red Dawn\"</strong> questline in <em>The War Within: Legacy of Arathor</em>, launching June 17. While it doesn't directly mention Monk class specifics, players can earn faction-specific tabards (Stromgarde for Alliance, Hammerfall for Horde), the Lamplighter's Pauldrons transmog, and a unique title like \"&lt;Name&gt; of Stromgarde\" or \"&lt;Name&gt; of Hammerfall.\" The narrative involves Faerin Lothar and events in the Arathi Highlands.</p>",
        "word_stats": {
          "original": 293,
          "summary": 67,
          "reduction_percent": 77.1
        }
      },
      "Evoker": {
        "summary": "<p>The blog post \"Rise of the Red Dawn\" announces a new <span style=\"color: #4CAF50;\">Evoker</span>-relevant questline in <span style=\"color: #2196F3;\">The War Within</span>, launching June 17th. Players will join <span style=\"color: #FF9800;\">Faerin Lothar</span> in the Arathi Highlands to expose a conspiracy and defuse tensions between Stromgarde and Hammerfall. Completing the questline grants faction-specific tabards and transmog items inspired by Faerin, along with the achievement and title \"<span style=\"color: #FFEB3B;\">Name</span> of Stromgarde\" or \"<span style=\"color: #FFEB3B;\">Name</span> of Hammerfall.\"  A short story, \"Faith & Flame,\" narrated by Faerin's voice actor, is also available.</p>",
        "word_stats": {
          "original": 293,
          "summary": 89,
          "reduction_percent": 69.6
        }
      },
      "Demon Hunter": {
        "summary": "<p>The \"Rise of the Red Dawn\" questline, available in <span style=\"color: #FFA500;\">The War Within</span>, is set in the Arathi Highlands for Level 80 characters. While the blog post doesn't specifically mention Demon Hunter abilities or unique class mechanics, players can earn faction-specific tabards (Stromgarde or Hammerfall) and the \"Lamplighter's Pauldrons\" transmog. The content update, \"Legacy of Arathor,\" launches June 17.</p>",
        "word_stats": {
          "original": 293,
          "summary": 60,
          "reduction_percent": 79.5
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The blog post \"Rise of the Red Dawn\" details a new storyline quest in the Arathi Highlands, available at level 80. Players will aid Faerin Lothar, Danath, and Geya'rah in exposing a conspiracy. Rewards include faction-specific tabards (Stromgarde Tabard for Alliance, Hammerfall Tabard for Horde), the Lamplighter's Pauldrons transmog, and the \"Rise of the Red Dawn\" achievement with a faction-themed title (e.g., \"Name of Stromgarde\"). The update, \"The War Within: Legacy of Arathor,\" launches June 17.</p>",
        "word_stats": {
          "original": 293,
          "summary": 76,
          "reduction_percent": 74.1
        }
      },
      "Raiding": {
        "summary": "<p>This blog post details the \"Rise of the Red Dawn\" questline in <em>The War Within</em>, set in the Arathi Highlands. While not directly about raiding, it introduces new lore and characters relevant to the expansion's narrative. Completing the questline rewards faction-specific tabards and transmog shoulders.</p>",
        "word_stats": {
          "original": 293,
          "summary": 45,
          "reduction_percent": 84.6
        }
      },
      "M+": {
        "summary": "<p>The \"Rise of the Red Dawn\" questline in <em>The War Within</em>'s \"Legacy of Arathor\" update involves a new storyline in the Arathi Highlands. While the blog post does not explicitly mention M+ content, it details faction-specific rewards like tabards and transmog shoulder pieces. The update launches June 17.</p>",
        "word_stats": {
          "original": 293,
          "summary": 48,
          "reduction_percent": 83.6
        }
      },
      "PvP": {
        "summary": "<p>The \"Rise of the Red Dawn\" questline in <em>The War Within</em>'s \"Legacy of Arathor\" update introduces new faction-specific storylines in the Arathi Highlands. Players can earn faction tabards (Stromgarde Tabard for Alliance, Hammerfall Tabard for Horde), the \"Lamplighter's Pauldrons\" transmog, and unique titles such as \"<Name> of Stromgarde\" or \"<Name> of Hammerfall.\" This content is set to launch on June 17.</p>",
        "word_stats": {
          "original": 293,
          "summary": 61,
          "reduction_percent": 79.2
        }
      },
      "Open World": {
        "summary": "<p>\n  The \"Rise of the Red Dawn\" questline, available in the Arathi Highlands from Faerin Lothar outside Stonelight Rest, offers a new open-world storyline for Level 80 characters in <i>The War Within</i> expansion. Players will uncover a conspiracy affecting Stromgarde and Hammerfall, with branching narratives based on faction. Completing the quest rewards faction-specific tabards and the \"Lamplighter's Pauldrons\" transmog.\n</p>",
        "word_stats": {
          "original": 293,
          "summary": 60,
          "reduction_percent": 79.5
        }
      }
    }
  },
  {
    "id": "warcraft-short-story-faith-flame",
    "title": "Warcraft Short Story: \"Faith & Flame\"",
    "date": "2025-06-10",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24209851/warcraft-short-story-faith-flame",
    "summary": "World of Warcraft is releasing a new short story, \"Faith & Flame,\" featuring Faerin Lothar as she answers a call to brave the darkness with Anduin and outlanders. The story, written by L.L. McKinney and illustrated by Zoltan Boros, will be narrated by Paris Blu. Readers can download the PDF and continue Faerin's journey in the \"Rise of the Red Dawn\" story campaign with The War Within: Legacy of Arathor on June 17. Additionally, a 5-part audio novella, \"Heartlands,\" by Adam Christopher and narrated by Chris Metzen is available for those catching up on The War Within's narrative.",
    "word_stats": {
      "original": 162,
      "summary": 98,
      "reduction_percent": 39.5
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>This blog post focuses on a short story, \"Faith & Flame,\" featuring Faerin Lothar.  It announces that Faerin will be involved in the \"Rise of the Red Dawn\" story campaign, which arrives with <b>The War Within: Legacy of Arathor</b> on June 17.  Additionally, it mentions the \"Heartlands\" audio novella as part of the catch-up experience for The War Within story.</p>",
        "word_stats": {
          "original": 162,
          "summary": 60,
          "reduction_percent": 63
        }
      },
      "Mage": {
        "summary": "This blog post focuses on the upcoming short story \"Faith & Flame\" and the \"Rise of the Red Dawn\" story campaign in *The War Within: Legacy of Arathor*, arriving June 17. While the narrative features Faerin Lothar, a character who answers a \"call deep within her,\" the provided text does not mention any specific abilities, spells, or mechanics relevant to the Mage class in Retail WoW or future expansions.",
        "word_stats": {
          "original": 162,
          "summary": 69,
          "reduction_percent": 57.4
        }
      },
      "Rogue": {
        "summary": "<p>The blog post announces a new short story, \"Faith & Flame,\" featuring Faerin Lothar, a character who will be present in <strong>The War Within: Legacy of Arathor</strong>, arriving June 17th. This indicates Faerin Lothar's narrative importance in the upcoming expansion. No specific Rogue class mechanics or abilities are mentioned.</p>",
        "word_stats": {
          "original": 162,
          "summary": 49,
          "reduction_percent": 69.8
        }
      },
      "Priest": {
        "summary": "<p>Faerin Lothar, driven by an internal calling, departs Hallowfall with Anduin and outlanders for a new adventure.</p>\n<p>Her story, \"Faith & Flame,\" is available as a fireside telling. Faerin's journey continues in the \"Rise of the Red Dawn\" story campaign with <em>The War Within: Legacy of Arathor</em>, launching June 17.</p>",
        "word_stats": {
          "original": 162,
          "summary": 50,
          "reduction_percent": 69.1
        }
      },
      "Paladin": {
        "summary": "<p>Faerin Lothar, driven by a calling to face darkness, departs Hallowfall with Anduin. Her story, \"Faith & Flame,\" penned by L. L. McKinney and illustrated by Zoltan Boros, will be shared in a fireside telling. Players can follow Faerin's journey in the <em>The War Within: Legacy of Arathor</em> story campaign, launching June 17th.</p>",
        "word_stats": {
          "original": 162,
          "summary": 53,
          "reduction_percent": 67.3
        }
      },
      "Hunter": {
        "summary": "<p>While the blog post primarily focuses on the character Faerin Lothar and the narrative of <em>The War Within: Legacy of Arathor</em>, it does not contain any specific information or updates relevant to the Hunter class in Retail WoW or later expansions.</p>",
        "word_stats": {
          "original": 162,
          "summary": 41,
          "reduction_percent": 74.7
        }
      },
      "Warlock": {
        "summary": "<p>Faerin Lothar, drawn to darkness, embarks on a new journey with Anduin in \"Faith & Flame.\" This story, written by L. L. McKinney and illustrated by Zoltan Boros, will be part of The War Within: Legacy of Arathor expansion arriving June 17.</p>",
        "word_stats": {
          "original": 162,
          "summary": 42,
          "reduction_percent": 74.1
        }
      },
      "Death Knight": {
        "summary": "<p>A new short story, \"Faith & Flame,\" featuring Faerin Lothar, is available. Faerin's journey continues in \"The War Within: Legacy of Arathor\" on June 17. The blog also mentions the audio novella \"Heartlands\" for those catching up on The War Within's story.</p>",
        "word_stats": {
          "original": 162,
          "summary": 42,
          "reduction_percent": 74.1
        }
      },
      "Druid": {
        "summary": "<p>The blog post announces a new short story, \"Faith & Flame,\" featuring Faerin Lothar's journey with Anduin and outlanders. It also mentions the \"Rise of the Red Dawn\" story campaign, arriving with <strong>The War Within: Legacy of Arathor</strong> on June 17. Additionally, an audio novella titled \"Heartlands\" is available for those catching up on <strong>The War Within</strong> story.</p>",
        "word_stats": {
          "original": 162,
          "summary": 58,
          "reduction_percent": 64.2
        }
      },
      "Monk": {
        "summary": "<p>This blog post discusses the upcoming short story \"Faith & Flame\" featuring Faerin Lothar and her call to brave the darkness. While Faerin's journey is detailed, the post contains no specific information relevant to the Monk class in Retail WoW, The War Within, or later expansions.</p>",
        "word_stats": {
          "original": 162,
          "summary": 46,
          "reduction_percent": 71.6
        }
      },
      "Evoker": {
        "summary": "<p>The blog post announces the short story <strong>\"Faith & Flame,\"</strong> featuring Faerin Lothar. Faerin feels a call to brave darkness and will leave Hallowfall with Anduin. The story is available as a PDF and will be narrated by Paris Blu.  Furthermore, Faerin's journey will continue in the <strong>Rise of the Red Dawn</strong> story campaign with <em>The War Within: Legacy of Arathor</em>, launching on June 17.  A 5-part audio novella, \"Heartlands,\" is also mentioned for those catching up on <em>The War Within</em> story.</p>",
        "word_stats": {
          "original": 162,
          "summary": 82,
          "reduction_percent": 49.4
        }
      },
      "Demon Hunter": {
        "summary": "<p>Faerin Lothar, a character with a calling to brave darkness, will be featured in a new short story, <strong>\"Faith & Flame.\"</strong> This story, relevant to <em>The War Within: Legacy of Arathor</em> arriving June 17th, will have a fireside telling. Players can also embark on a legendary audio novella, \"Heartlands,\" to catch up on <em>The War Within</em> story.</p>",
        "word_stats": {
          "original": 162,
          "summary": 57,
          "reduction_percent": 64.8
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>This blog post introduces Faerin Lothar and her journey with Anduin in <em>The War Within: Legacy of Arathor</em>, launching June 17th. It also promotes a new short story, \"Faith & Flame,\" featuring Faerin, and an audio novella, \"Heartlands,\" for players catching up on <em>The War Within</em>'s narrative.</p>",
        "word_stats": {
          "original": 162,
          "summary": 47,
          "reduction_percent": 71
        }
      },
      "Raiding": {
        "summary": "<p>The blog post announces the short story <strong>\"Faith & Flame\"</strong> featuring Faerin Lothar. This story is relevant to <strong>Raiding</strong> as Faerin's journey with Anduin and outlanders is detailed. Her bravery and preparation will be further explored in the <strong>Rise of the Red Dawn</strong> story campaign, arriving with <strong>The War Within: Legacy of Arathor</strong> on June 17. This campaign will likely set the stage for future raid content.</p>",
        "word_stats": {
          "original": 162,
          "summary": 67,
          "reduction_percent": 58.6
        }
      },
      "M+": {
        "summary": "<p>This blog post announces a new short story, \"Faith & Flame,\" featuring Faerin Lothar. It details Faerin's journey with Anduin and outlanders, and her call to brave the darkness. The story will be available as a PDF download and narrated by Paris Blu. Players will experience Faerin's further adventures in \"The War Within: Legacy of Arathor\" arriving June 17th. The post also mentions the audio novella \"Heartlands\" as part of the catch-up content for \"The War Within.\"</p>",
        "word_stats": {
          "original": 162,
          "summary": 77,
          "reduction_percent": 52.5
        }
      },
      "PvP": {
        "summary": "The provided blog post details a new short story, \"Faith & Flame,\" and mentions the story campaign \"Rise of the Red Dawn\" arriving with <span style=\"font-weight: bold;\">The War Within: Legacy of Arathor</span> on June 17. It also introduces an audio novella, \"Heartlands,\" as part of catching up with The War Within story. <span style=\"font-weight: bold;\">No specific PvP content or changes for Retail WoW, The War Within, or later expansions are mentioned in this text.</span>",
        "word_stats": {
          "original": 162,
          "summary": 74,
          "reduction_percent": 54.3
        }
      },
      "Open World": {
        "summary": "<p>The blog post announces the short story <strong>\"Faith & Flame\"</strong> featuring Faerin Lothar's journey with Anduin and the outlanders. Faerin's story continues in <strong>The War Within: Legacy of Arathor</strong>, arriving June 17, where players can discover if she is prepared for her upcoming challenges.</p>",
        "word_stats": {
          "original": 162,
          "summary": 44,
          "reduction_percent": 72.8
        }
      }
    }
  },
  {
    "id": "wow-weekly-the-legacy-of-arathor-and-more",
    "title": "WoW Weekly: The Legacy of Arathor, and More!",
    "date": "2025-06-06",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24209848/wow-weekly-the-legacy-of-arathor-and-more",
    "summary": "The \"Legacy of Arathor\" content update for World of Warcraft goes live on June 17th. It introduces Overcharged Delves with new challenges and loot, Lorewalking with Lorewalker Cho to revisit iconic lore moments, and the Dastardly Duos event (June 3-July 14) featuring boss encounters. A Dastardly Duos Creator Clash event will also take place on June 7th. New assistants are also mentioned to aid players.",
    "word_stats": {
      "original": 555,
      "summary": 65,
      "reduction_percent": 88.3
    },
    "classSummaries": {
      "Warrior": {
        "summary": "The \"Legacy of Arathor\" update, live June 17, brings new challenges and lore. For Warriors, the update introduces <span style=\"font-weight:bold;\">Overcharged Delves</span>, featuring new affixes and loot across six locations in Khaz Algar. Players can also participate in <span style=\"font-weight:bold;\">Dastardly Duos</span>, a level 80 activity in the Demolition Dome with exclusive rewards. A special <span style=\"font-weight:bold;\">Dastardly Duos Creator Clash</span> event will also take place on June 7.",
        "word_stats": {
          "original": 555,
          "summary": 66,
          "reduction_percent": 88.1
        }
      },
      "Mage": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, live June 17, offers new content relevant to Mages. Engage with <b>Lorewalking</b>, revisiting iconic lore moments with Lorewalker Cho, focusing on Xal'atath, Ethereals, and The Lich King. Additionally, prepare for <b>Overcharged Delves</b> across Khaz Algar, featuring a new Delve-specific affix to increase challenges and rewards within locations like the Isle of Dorn and Hallowfall. You can begin by picking up the quest \"Titanic Rumblings\" from your Adventure Journal.</p>",
        "word_stats": {
          "original": 555,
          "summary": 73,
          "reduction_percent": 86.8
        }
      },
      "Rogue": {
        "summary": "<p>The \"Legacy of Arathor\" update, launching June 17, introduces new challenges for Rogues in Retail WoW.</p>\n\n<p>Players can engage in <strong>Overcharged Delves</strong>, featuring a new Delve-specific affix for increased difficulty and loot. Additionally, the <strong>Dastardly Duos</strong> event allows players level 80+ to battle iconic duos, with a Creator Clash showcase on June 7.</p>",
        "word_stats": {
          "original": 555,
          "summary": 53,
          "reduction_percent": 90.5
        }
      },
      "Priest": {
        "summary": "<p>The <strong>Legacy of Arathor</strong> update, launching June 17, introduces <strong>Overcharged Delves</strong> across Khaz Algar. These Delves feature a new affix, increasing challenge and offering unique loot. Players can also experience <strong>Lorewalking</strong> with Lorewalker Cho, revisiting key Azerothian lore through curated questlines. Additionally, a new event, <strong>Dastardly Duos</strong>, allows players to battle iconic duos in the Demolition Dome, with a Creator Clash event scheduled for June 7.</p>",
        "word_stats": {
          "original": 555,
          "summary": 66,
          "reduction_percent": 88.1
        }
      },
      "Paladin": {
        "summary": "<p>The \"Legacy of Arathor\" update, launching June 17, introduces <strong>Overcharged Delves</strong> with a new affix for increased challenge and loot. Additionally, players can experience <strong>Lorewalking</strong>, revisiting Azeroth's lore, and participate in <strong>Dastardly Duos</strong>, a new arena event from June 3 to July 14, featuring duels against legendary bosses. A Creator Clash event for Dastardly Duos is scheduled for June 7.</p>",
        "word_stats": {
          "original": 555,
          "summary": 60,
          "reduction_percent": 89.2
        }
      },
      "Hunter": {
        "summary": "<p>The <b>Legacy of Arathor</b> update goes live June 17th.</p>\n\n<p>Hunters can engage in <b>Overcharged Delves</b>, featuring a new Delve-specific affix and six new locations in Khaz Algar. These can be completed multiple times and are identifiable on the map. A quest chain starting with \"Titanic Rumblings\" unlocks access.</p>\n\n<p>Additionally, Hunters level 80 and above can participate in <b>Dastardly Duos</b>, a new event running from June 3rd to July 14th, involving battles against pairs of bosses. A Creator Clash showcase for this event is scheduled for June 7th.</p>",
        "word_stats": {
          "original": 555,
          "summary": 87,
          "reduction_percent": 84.3
        }
      },
      "Warlock": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, live June 17, introduces <b>Overcharged Delves</b> with a new affix and loot. Players level 10+ can experience <b>Lorewalking</b> with Lorewalker Cho, focusing on Xal'atath, Ethereals, and the Lich King. Additionally, <b>Dastardly Duos</b>, a PvP event featuring boss pairings, is available from June 3 to July 14 for level 80 characters. A special Creator Clash for this event airs June 7.</p>",
        "word_stats": {
          "original": 555,
          "summary": 65,
          "reduction_percent": 88.3
        }
      },
      "Death Knight": {
        "summary": "<p>The <b>Legacy of Arathor</b> update goes live June 17, featuring <b>Overcharged Delves</b> with a new affix and loot. Players level 10+ can experience new <b>Lorewalking</b> storylines focusing on Xal'atath, Ethereals, and The Lich King. Additionally, <b>Dastardly Duos</b>, a new event for Level 80 players, allows solo or group battles against iconic bosses from June 3 to July 14.</p>",
        "word_stats": {
          "original": 555,
          "summary": 58,
          "reduction_percent": 89.5
        }
      },
      "Druid": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, launching June 17, introduces <b>Overcharged Delves</b> for increased challenge and loot in Khaz Algar. Additionally, <b>Lorewalking</b> with Lorewalker Cho allows players to revisit iconic lore moments. A separate event, <b>Dastardly Duos</b>, runs June 3-July 14, featuring boss battles with exclusive rewards. A Creator Clash for Dastardly Duos airs June 7.</p>",
        "word_stats": {
          "original": 555,
          "summary": 55,
          "reduction_percent": 90.1
        }
      },
      "Monk": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, launching June 17, introduces <b>Overcharged Delves</b> with a new affix and loot. Players can also experience <b>Lorewalking</b> with Lorewalker Cho, revisiting Azeroth's lore through curated questlines. Additionally, <b>Dastardly Duos</b>, a level 80 event featuring boss battles in the Demolition Dome, runs from June 3 to July 14. A Creator Clash for Dastardly Duos airs June 7.</p>",
        "word_stats": {
          "original": 555,
          "summary": 61,
          "reduction_percent": 89
        }
      },
      "Evoker": {
        "summary": "<p>The <b>Legacy of Arathor</b> content update, launching June 17, introduces <b>Overcharged Delves</b> with a new affix and six locations across Khaz Algar. Players level 10+ can also experience <b>Lorewalking</b> with Lorewalker Cho, exploring three storylines related to Xal'atath, Ethereals, and The Lich King. Level 80 characters can participate in <b>Dastardly Duos</b> from June 3 to July 14 in the Demolition Dome for solo or group battles with unique rewards.</p>",
        "word_stats": {
          "original": 555,
          "summary": 69,
          "reduction_percent": 87.6
        }
      },
      "Demon Hunter": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, launching June 17, introduces new challenges and lore. Demon Hunters can participate in <b>Overcharged Delves</b>, featuring a new Delve-specific affix and six new locations in Khaz Algar. Additionally, players level 10+ can experience <b>Lorewalking</b> with Lorewalker Cho, exploring storylines related to Xal'atath, Ethereals, and The Lich King.</p>",
        "word_stats": {
          "original": 555,
          "summary": 52,
          "reduction_percent": 90.6
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The <b>Legacy of Arathor</b> update, launching June 17, introduces <b>Overcharged Delves</b>. These six new Delves across Khaz Algar will feature a <b>Delve-specific affix</b> that amps up the challenge and offers new loot. Two daily Bountiful Delves will have the Overcharged Affix. Access is granted via a quest chain starting with \"Titanic Rumblings\" from the Adventure Journal, followed by \"Titan Consoles\" from Dagran Thaurissan II in Dornogal.</p>",
        "word_stats": {
          "original": 555,
          "summary": 66,
          "reduction_percent": 88.1
        }
      },
      "Raiding": {
        "summary": "<p>The <b>Legacy of Arathor</b> content update introduces <b>Overcharged Delves</b>, featuring six new Delves across Khaz Algar with a Delve-specific affix to amp up the challenge and offer new loot. Two Bountiful Delves daily will have the Overcharged Affix. Additionally, <b>Dastardly Duos</b> is a new event where players can battle villainous duos solo or in groups at level 80 for exclusive rewards. A special Creator Clash event for Dastardly Duos will be broadcast on June 7.</p>",
        "word_stats": {
          "original": 555,
          "summary": 75,
          "reduction_percent": 86.5
        }
      },
      "M+": {
        "summary": "<p>The Legacy of Arathor update introduces <b>Overcharged Delves</b>, featuring six new Delves across Khaz Algar with a unique Delve-specific affix. Two daily Delves will have the Overcharged Affix, with increased challenge and rewards. Players can access these via a quest chain starting with \"Titanic Rumblings\" in their Adventure Journal. Additionally, the update includes \"Dastardly Duos,\" a new PvP event for level 80 characters running from June 3 to July 14, accessible through Xyggie Marou.</p>",
        "word_stats": {
          "original": 555,
          "summary": 74,
          "reduction_percent": 86.7
        }
      },
      "PvP": {
        "summary": "<p>The upcoming <b>Legacy of Arathor</b> update introduces <b>Dastardly Duos</b>, a new PvP-like event running from June 3 to July 14. Players level 80 can queue solo or in groups to battle villainous duos in the Demolition Dome for exclusive rewards. A special <b>Dastardly Duos Creator Clash</b> will also be broadcast on June 7, showcasing top players in a cage-match showdown.</p>",
        "word_stats": {
          "original": 555,
          "summary": 60,
          "reduction_percent": 89.2
        }
      },
      "Open World": {
        "summary": "<p>The <b>Legacy of Arathor</b> update launches June 17, introducing <b>Overcharged Delves</b> across Khaz Algar, featuring a new Delve-specific affix and increased challenge. Players can also experience <b>Lorewalking</b> with Lorewalker Cho in Azeroth, revisiting iconic lore moments through curated questlines. Additionally, <b>Dastardly Duos</b>, a new event in the Demolition Dome, allows players to battle legendary boss duos for rewards. The update also includes a <b>Creator Clash</b> showcase for Dastardly Duos.</p>",
        "word_stats": {
          "original": 555,
          "summary": 69,
          "reduction_percent": 87.6
        }
      }
    }
  },
  {
    "id": "its-electric-power-up-with-overcharged-delves",
    "title": "It’s Electric: Power Up with Overcharged Delves!",
    "date": "2025-06-06",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24206305/its-electric-power-up-with-overcharged-delves",
    "summary": "The \"Legacy of Arathor\" update introduces six new \"Delves\" in Khaz Algar, featuring an \"Overcharged\" affix for increased challenge and rewards. Players can equip the \"Durable Information Storage Container\" belt, enhanced with \"Miniature Titan Discs\" found in Delves. These discs grant unique abilities, and collecting \"Titan Disc Shards\" allows for upgrading the \"Overcharged Titan Console\" with powerful boons. Completing achievements in Overcharged Delves rewards a new mount and toy.",
    "word_stats": {
      "original": 1112,
      "summary": 69,
      "reduction_percent": 93.8
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>The <a href=\"https://www.worldofwarcraft.com/en-us/news/24084767/legacy-of-arathor-content-update-notes\">Legacy of Arathor</a> content update introduces six new Delves in Khaz Algar. Players can acquire a new belt, the <a href=\"https://www.wowhead.com/item=210064/durable-information-storage-container\">Durable Information Storage Container</a>, which can be upgraded and enhanced with Miniature Titan Discs found in Delves. These discs grant unique abilities like <a href=\"https://www.wowhead.com/spell=508186/spark-burst\">Spark Burst</a> (Haste) and <a href=\"https://www.wowhead.com/spell=508187/static-charge\">Static Charge</a> (Versatility). Additionally, Warrior players can unlock powerful boons from the Overcharged Titan Console, offering passive benefits such as increased Mastery, Stamina, and even a chance for Titanic Pyroblast.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 81,
          "reduction_percent": 92.7
        }
      },
      "Mage": {
        "summary": "<p>The new \"Legacy of Arathor\" content update introduces six Delves with an \"Overcharged Affix\" for increased challenge and rewards. Mages can acquire a <strong>Durable Information Storage Container</strong> belt that can be further enhanced with <strong>Miniature Titan Discs</strong> found in Delves. These discs grant unique abilities like \"Charged Bolts\" (Nature damage to random enemies) or \"Critical Chain\" (increasing Critical Strike). Players can also unlock console boons, including a potential \"Titanic Pyroblast\" that stuns and deals Fire damage.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 76,
          "reduction_percent": 93.2
        }
      },
      "Rogue": {
        "summary": "<p>\nThe upcoming <em>Legacy of Arathor</em> content update introduces six new Delves in Khaz Algar, featuring a new \"Overcharged\" Affix. Rogues can obtain the <strong>Durable Information Storage Container</strong> belt from a quest chain. This belt can be upgraded and equipped with <strong>Miniature Titan Discs</strong> found in Delves, granting abilities like <strong>Charged Bolts</strong>, <strong>Charged Crystal</strong>, <strong>Spark Burst</strong> (Haste), and <strong>Static Charge</strong> (Versatility). Players can also use Titan Disc Shards to unlock console boons, including potential critical strike increases and mastery boosts.\n</p>",
        "word_stats": {
          "original": 1112,
          "summary": 81,
          "reduction_percent": 92.7
        }
      },
      "Priest": {
        "summary": "<p>The <em>Legacy of Arathor</em> update introduces Delves with an \"Overcharged\" affix. Priests can benefit from a new legendary belt, the <strong>Durable Information Storage Container</strong>, which can be upgraded and socketed with <strong>Miniature Titan Discs</strong>. These discs grant unique abilities such as:</p>\n<ul>\n  <li><strong>Cauterizing Bolts:</strong> Chance for your spells to heal allies.</li>\n  <li><strong>Charged Touch:</strong> Chance for your heals to jump to low-health targets.</li>\n  <li><strong>Critical Chain:</strong> Chance to increase Critical Strike.</li>\n  <li><strong>Electric Current:</strong> Grants increasing Mastery.</li>\n  <li><strong>Spark Burst:</strong> Chance to grant Haste.</li>\n  <li><strong>Static Charge:</strong> Chance to grant Versatility.</li>\n</ul>\n<p>Additionally, players can unlock passive boons from the <strong>Overcharged Titan Console</strong>, including stat increases and combat-enhancing effects.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 104,
          "reduction_percent": 90.6
        }
      },
      "Paladin": {
        "summary": "<p>The upcoming <b>Legacy of Arathor</b> content update introduces <b>Delves</b> with an <b>Overcharged Affix</b>. Paladins can equip the <b>Durable Information Storage Container</b>, a belt that can be upgraded with <b>Miniature Titan Discs</b> found in Delves. These discs grant unique abilities and passive bonuses, such as increased critical strike, mastery, or chance for spells to heal allies. Additionally, Paladins can unlock powerful boons via the <b>Overcharged Titan Console</b>, with options like a stunning Pyroblast or a defensive shield.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 76,
          "reduction_percent": 93.2
        }
      },
      "Hunter": {
        "summary": "<p>The new <em>Legacy of Arathor</em> content update introduces six Delves in Khaz Algar. Hunters can acquire a <strong>Durable Information Storage Container</strong> belt, which offers stat bonuses and a Prismatic Slot.</p>\n\n<p>This belt can be upgraded and enhanced with <strong>Miniature Titan Discs</strong> found in Delves. These discs unlock abilities like <strong>Spark Burst</strong> (Haste) and <strong>Static Charge</strong> (Versatility).</p>\n\n<p>Additionally, a new Titan Console allows the creation of <strong>Titan Discs</strong> to unlock powerful boons, including passive buffs like <strong>Titanic Pyroblast</strong> and <strong>Overcharged Empowerment</strong>.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 80,
          "reduction_percent": 92.8
        }
      },
      "Warlock": {
        "summary": "<p>The upcoming content update introduces <strong>Delves</strong>, challenging instances within Khaz Algar. Warlocks can enhance their performance in these Delves through the <strong>Overcharged Console</strong>. By collecting <strong>Titan Disc Shards</strong>, Warlocks can craft <strong>Titan Discs</strong> to unlock powerful boons. These boons include abilities that increase stats like Haste and Versatility, offer defensive shields, or provide damage-boosting effects.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 55,
          "reduction_percent": 95.1
        }
      },
      "Death Knight": {
        "summary": "<p>The <a href=\"https://worldofwarcraft.blizzard.com/en-us/news/24060784/the-war-within-delves-update\">Legacy of Arathor</a> content update introduces six new Delves. A new \"Overcharged\" affix can increase difficulty, with specific Delves offering this challenge daily. Players can earn a unique belt, the <strong>Durable Information Storage Container</strong>, which can be upgraded and slotted with <strong>Miniature Titan Discs</strong> found in Delves. These discs grant special abilities like <strong>Charged Bolts</strong> (Nature damage) or <strong>Critical Chain</strong> (Crit chance increase). Furthermore, players can use <strong>Titan Discs</strong> to unlock powerful boons at the Overcharged Titan Console, enhancing their performance in Delves.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 85,
          "reduction_percent": 92.4
        }
      },
      "Druid": {
        "summary": "<p>The <i>Legacy of Arathor</i> content update introduces six new <b>Delves</b> across Khaz Algar. Druids can benefit from a new gear system involving a <b>Durable Information Storage Container</b> belt, which can be upgraded and customized with <b>Miniature Titan Discs</b> found in Delves.</p>\n\n<p>These discs grant various buffs such as <b>Spark Burst</b> (Haste) and <b>Static Charge</b> (Versatility). Additionally, Druids can invest in the <b>Overcharged Titan Console</b> to unlock powerful boons like <b>Titanic Pyroblast</b> and <b>Titanic Frenzy</b>, enhancing their combat capabilities in these challenging new instances.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 83,
          "reduction_percent": 92.5
        }
      },
      "Monk": {
        "summary": "<p>Monks in The War Within can engage with new content featuring Titan machinery. Players can enhance their gameplay with a special belt, the <b>Durable Information Storage Container</b>, which provides stat bonuses and a Prismatic Slot. This belt can be further augmented with <b>Miniature Titan Discs</b> found in Delves. These discs, when inserted into the belt, grant abilities such as:</p>\n<ul>\n    <li><b>Spark Burst</b>: Grants Haste.</li>\n    <li><b>Static Charge</b>: Increases Versatility.</li>\n    <li><b>Charged Bolts</b>: Can strike enemies.</li>\n    <li><b>Cauterizing Bolts</b>: Can heal allies.</li>\n    <li><b>Critical Chain</b>: Increases Critical Strike.</li>\n    <li><b>Electric Current</b>: Increases Mastery.</li>\n    <li><b>Energy Shield</b>: Grants a damage-absorbing shield.</li>\n</ul>\n<p>Additional boons can be unlocked via the Overcharged Titan Console using collected Titan Disc Shards.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 109,
          "reduction_percent": 90.2
        }
      },
      "Evoker": {
        "summary": "<p>The <a href=\"https://worldofwarcraft.blizzard.com/en-us/news/24056479/the-war-within-legacy-of-arathor-developer-preview-series-delves\">Legacy of Arathor</a> content update introduces six new Delves in Khaz Algar. Players can enhance their experience with a new Delve-specific Affix called \"Overcharged,\" and earn new loot. A quest chain starting from the Adventure Journal unlocks access to the Overcharged Console, allowing the use of <a href=\"https://worldofwarcraft.blizzard.com/en-us/news/24056479/the-war-within-legacy-of-arathor-developer-preview-series-delves\">Titan Discs</a> to unlock powerful boons. The Durable Information Storage Container (DISC) belt, obtained through this questline, can be upgraded and equipped with Miniature Titan Discs that grant unique abilities like \"Spark Burst\" (Haste) and \"Static Charge\" (Versatility), enhancing gameplay.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 89,
          "reduction_percent": 92
        }
      },
      "Demon Hunter": {
        "summary": "<p>The <em>Legacy of Arathor</em> content update introduces six new <a href=\"#delves\">Delves</a> for players to explore in Khaz Algar. Demon Hunters can enhance their gameplay through the new \"Overcharged\" affix, which can be applied to Delves for increased challenge and rewards. Players will acquire a new belt, the <strong>Durable Information Storage Container</strong>, which can be upgraded and augmented with <strong>Miniature Titan Discs</strong> found within Delves. These discs grant unique abilities such as <em>Spark Burst</em> (Haste) and <em>Static Charge</em> (Versatility), allowing for further customization and power boosts. Additionally, a new progression system using Titan Disc Shards allows players to unlock potent passive buffs at the <strong>Overcharged Titan Console</strong>, including stat increases and unique damage or defensive effects.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 115,
          "reduction_percent": 89.7
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The <i>Legacy of Arathor</i> content update introduces six new Delves across Khaz Algar.  Two daily Delves will feature the <b>Overcharged Affix</b>, offering increased challenge and loot.  Players can enhance their Delve experience by unlocking boons at the <b>Overcharged Titan Console</b> using Titan Discs, crafted from Titan Disc Shards collected within Delves.  A new quest chain rewards the <b>Durable Information Storage Container</b> belt, which can be upgraded and equipped with Miniature Titan Discs found in various Delves to grant unique abilities.  Completing Overcharged Delves rewards achievements for a new mount and toy.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 91,
          "reduction_percent": 91.8
        }
      },
      "Raiding": {
        "summary": "<p>The <strong>Legacy of Arathor</strong> content update introduces six new <strong>Delves</strong> with an <strong>Overcharged Affix</strong>, increasing challenge and rewards. Players can earn a <strong>Durable Information Storage Container</strong> belt with a Prismatic Slot, upgradeable weekly to item level 701. This belt accepts <strong>Miniature Titan Discs</strong>, found at the end of Delves, which grant various combat bonuses like increased crit, haste, or defensive shields. Additionally, collecting <strong>Titan Disc Shards</strong> allows players to unlock powerful boons via the <strong>Overcharged Titan Console</strong>. Completing Overcharged Delve achievements awards a new mount and toy.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 87,
          "reduction_percent": 92.2
        }
      },
      "M+": {
        "summary": "<p>The upcoming <b>Legacy of Arathor</b> update introduces six new Delves in Khaz Algar, featuring an \"Overcharged\" affix. Completing these Delves grants access to the <b>Overcharged Console</b>, where players can upgrade their <b>Durable Information Storage Container</b> belt using Titan Disc Shards. This belt provides stat bonuses and a Prismatic Slot. Miniature Titan Discs, found at the end of select Delves, can be inserted into the belt to grant unique abilities like <b>Charged Bolts</b> or <b>Spark Burst</b>. Completing specific achievements in Overcharged Delves rewards a mount and toy.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 86,
          "reduction_percent": 92.3
        }
      },
      "PvP": {
        "summary": "<p>The \"Legacy of Arathor\" content update introduces six new <a href=\"https://www.google.com/search?q=wow+delves\">Delves</a> in Khaz Algar. Two daily \"Overcharged Delves\" feature a new affix. Players can upgrade a special belt, the Durable Information Storage Container, with Miniature Titan Discs found in Delves. These discs grant various stat and ability bonuses, such as increased Versatility, Critical Strike, or a chance to stun enemies. Completing Overcharged Delve achievements rewards a new mount and toy.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 70,
          "reduction_percent": 93.7
        }
      },
      "Open World": {
        "summary": "<p>The <i>Legacy of Arathor</i> content update introduces six new Delves in Khaz Algar, featuring a challenging \"Overcharged\" affix. Players can power up their Durable Information Storage Container belt by collecting Miniature Titan Discs from Delve chests to unlock powerful boons via the Overcharged Titan Console. Completing Overcharged Delves grants achievements, a new mount, and a toy.</p>",
        "word_stats": {
          "original": 1112,
          "summary": 56,
          "reduction_percent": 95
        }
      }
    }
  },
  {
    "id": "go-lorewalking-with-the-help-of-lorewalker-cho",
    "title": "Go Lorewalking With the Help of Lorewalker Cho",
    "date": "2025-06-04",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24210000/go-lorewalking-with-the-help-of-lorewalker-cho",
    "summary": "The \"Legacy of Arathor\" update introduces a new \"Lorewalking\" feature in World of Warcraft. Players level 10 and above can meet Lorewalker Cho in Stormwind, Orgrimmar, or Dornogal to experience three curated storylines: Xal'atath, the Ethereals, and The Lich King. These journeys combine existing quests with new content, offering unique toys like the \"Echo of Xal'atath\" and \"Royal Visage\" as rewards. Players can repeat these experiences and ask Cho questions to learn more about Azeroth's history.",
    "word_stats": {
      "original": 537,
      "summary": 76,
      "reduction_percent": 85.8
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>The \"Legacy of Arathor\" content update introduces a new <span style=\"color: #FFD700;\">Lorewalking</span> feature. Warriors level 10 and above can visit Lorewalker Cho in capital cities to experience three curated storylines: Xal'atath, Ethereals, and The Lich King. Completing these questlines offers unique rewards, including the <span style=\"color: #FFD700;\">Royal Visage toy</span>, allowing Warriors to take on Arthas Menethil's appearance. These experiences can be repeated and paused.</p>",
        "word_stats": {
          "original": 537,
          "summary": 64,
          "reduction_percent": 88.1
        }
      },
      "Mage": {
        "summary": "<p>Mages in Retail WoW can engage with <b>Lorewalker Cho</b> to experience three curated storylines: <b>Xal'atath</b>, <b>Ethereals</b>, and <b>The Lich King</b>. These lore journeys offer new quests and rewards, including the <b>Echo of Xal'atath</b> toy that echoes with glee on kills. Players can repeat these experiences and revisit them anytime.</p>",
        "word_stats": {
          "original": 537,
          "summary": 49,
          "reduction_percent": 90.9
        }
      },
      "Rogue": {
        "summary": "<p>The <b>Legacy of Arathor</b> update allows Rogues (level 10+) to experience curated lore through <b>Lorewalking</b>. Players can visit Lorewalker Cho in capital cities to delve into three storylines: Xal'atath, Ethereals, and The Lich King. Completing these questlines rewards unique toys:</p>\n<ul>\n  <li><b>Echo of Xal’atath, Blade of the Black Empire:</b> A toy that causes Xal'atath's voice to echo upon defeating foes.</li>\n  <li><b>K’aresh Memory Crystal:</b> A toy to transform into a K’areshi.</li>\n  <li><b>Royal Visage:</b> A toy to assume the visage of Arthas Menethil.</li>\n</ul>\n<p>These experiences can be repeated, and progress can be paused and resumed.</p>",
        "word_stats": {
          "original": 537,
          "summary": 94,
          "reduction_percent": 82.5
        }
      },
      "Priest": {
        "summary": "The \"Legacy of Arathor\" update introduces <span style=\"color: #DA70D6;\">Lorewalking</span>, allowing players level 10+ to revisit key Azerothian lore.  Priests can experience three curated storylines: <span style=\"color: #87CEEB;\">Xal'atath</span>, <span style=\"color: #ADD8E6;\">Ethereals</span>, and <span style=\"color: #B0C4DE;\">The Lich King</span>.  Completing these offers unique rewards like the <span style=\"color: #DA70D6;\">Echo of Xal'atath</span> toy.  Lorewalker Cho guides these repeatable experiences, accessible via a UI element.",
        "word_stats": {
          "original": 537,
          "summary": 60,
          "reduction_percent": 88.8
        }
      },
      "Paladin": {
        "summary": "<p>The <b>Legacy of Arathor</b> content update introduces new <b>Lorewalking</b> quests with Lorewalker Cho.  Paladins can now revisit iconic lore moments, including storylines focused on <b>The Lich King</b>.  Completing this specific questline rewards the <b>Royal Visage</b> toy, allowing players to take on the appearance of Arthas Menethil. These lore experiences are repeatable.</p>",
        "word_stats": {
          "original": 537,
          "summary": 51,
          "reduction_percent": 90.5
        }
      },
      "Hunter": {
        "summary": "<p>The <em>Legacy of Arathor</em> update introduces a new \"Lorewalking\" feature, allowing players level 10+ to revisit Azeroth's history with Lorewalker Cho. Hunters can choose from three storylines focused on Xal'atath, Ethereals, or The Lich King. Completing these offers unique rewards, including the <strong>Echo of Xal'atath</strong> toy, which provides vocalizations upon defeating foes.</p>",
        "word_stats": {
          "original": 537,
          "summary": 52,
          "reduction_percent": 90.3
        }
      },
      "Warlock": {
        "summary": "<p>The \"Legacy of Arathor\" update introduces a new feature allowing players level 10+ to revisit lore through Lorewalker Cho.</p>\n\n<p>Warlocks can now delve into three curated storylines:</p>\n<ul>\n  <li><b>Xal'atath:</b> Explore the history of the Harbinger, formerly the Blade of the Black Empire.</li>\n  <li><b>Ethereals:</b> Learn about the mysterious travelers.</li>\n  <li><b>The Lich King:</b> Discover the tale of Arthas Menethil.</li>\n</ul>\n\n<p>Completing these storylines rewards Warlocks with unique toys, including the <b>Echo of Xal'atath</b>, which causes her voice to echo upon killing foes.</p>",
        "word_stats": {
          "original": 537,
          "summary": 80,
          "reduction_percent": 85.1
        }
      },
      "Death Knight": {
        "summary": "<p>The \"Legacy of Arathor\" content update introduces a new \"Lorewalking\" feature.  Death Knights (level 10+) can visit Lorewalker Cho in capital cities to experience three curated storylines: Xal'atath, Ethereals, and The Lich King. Completing these grant unique toys: the <strong>Echo of Xal’atath, Blade of the Black Empire</strong> toy, the <strong>K’aresh Memory Crystal</strong> toy, and the <strong>Royal Visage</strong> toy, which grants Arthas Menethil's appearance.</p>",
        "word_stats": {
          "original": 537,
          "summary": 63,
          "reduction_percent": 88.3
        }
      },
      "Druid": {
        "summary": "<p>The <em>Legacy of Arathor</em> content update introduces Lorewalking experiences for players level 10+. Visit Lorewalker Cho in capital cities to delve into three curated storylines: Xal'atath, Ethereals, and The Lich King. These journeys include new and existing quests, offering unique rewards like the <strong>Echo of Xal’atath</strong> toy, which echoes her voice upon defeating foes. Players can repeat these lore sessions and exit at any time, with progress resetting if a new story is started before completion.</p>",
        "word_stats": {
          "original": 537,
          "summary": 76,
          "reduction_percent": 85.8
        }
      },
      "Monk": {
        "summary": "<p>The \"Legacy of Arathor\" update introduces <b>Lorewalking</b>, allowing players level 10+ to revisit Azeroth's lore. Monks can experience three storylines curated by Lorewalker Cho, focusing on Xal'atath, Ethereals, and The Lich King. Completing these questlines rewards unique toys such as the <b>Echo of Xal'atath, Blade of the Black Empire</b>, which echoes her voice on kills, and the <b>Royal Visage</b>, transforming the player into Arthas Menethil. These lore experiences are repeatable.</p>",
        "word_stats": {
          "original": 537,
          "summary": 70,
          "reduction_percent": 87
        }
      },
      "Evoker": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces <b>Lorewalking</b>. Players level 10+ can visit Lorewalker Cho in Stormwind, Orgrimmar, or Dornogal to experience three curated storylines about Xal'atath, Ethereals, and The Lich King. These repeatable quests offer rewards including the <b>Echo of Xal'atath</b>, <b>K'aresh Memory Crystal</b>, and <b>Royal Visage</b> toys. Lorewalker Cho acts as a guide, and players can exit or pause the experience at any time.</p>",
        "word_stats": {
          "original": 537,
          "summary": 65,
          "reduction_percent": 87.9
        }
      },
      "Demon Hunter": {
        "summary": "<p>The <b>Legacy of Arathor</b> content update introduces a new \"Lorewalking\" feature, allowing players level 10+ to revisit three curated storylines:</p>\n<ul>\n  <li><p><b>Xal'atath:</b> Explore the history of this enigmatic figure, formerly the Blade of the Black Empire.</p></li>\n  <li><p><b>Ethereals:</b> Learn more about these mysterious travelers.</p></li>\n  <li><p><b>The Lich King:</b> Delve into the tale of Arthas Menethil.</p></li>\n</ul>\n<p>Completing these repeatable quests grants rewards including unique toys: the <b>Echo of Xal'atath</b>, a <b>K'areshi appearance</b>, and a <b>Royal Visage toy</b> resembling Arthas.</p>",
        "word_stats": {
          "original": 537,
          "summary": 77,
          "reduction_percent": 85.7
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "<p>The <i>Legacy of Arathor</i> update introduces <b>Lorewalking</b>, a new feature allowing players level 10+ to revisit Azeroth's history with Lorewalker Cho.</p>\n\n<p>Players can choose from three curated storylines:</p>\n<ul>\n  <li><b>Xal'atath:</b> Explores the history of the Harbinger.</li>\n  <li><b>Ethereals:</b> Delves into the lore of these mysterious beings.</li>\n  <li><b>The Lich King:</b> Focuses on Arthas Menethil's story.</li>\n</ul>\n\n<p>Rewards include unique toys: the <i>Echo of Xal’atath</i>, <i>K’aresh Memory Crystal</i>, and <i>Royal Visage</i>. Lorewalking can be repeated and paused.</p>",
        "word_stats": {
          "original": 537,
          "summary": 74,
          "reduction_percent": 86.2
        }
      },
      "Raiding": {
        "summary": "<p>This blog post details the \"Lorewalking\" feature in World of Warcraft's <i>Legacy of Arathor</i> content update, focused on Retail WoW. Players can revisit and learn about key lore moments related to <b>Xal'atath</b>, the <b>Ethereals</b>, and <b>The Lich King</b>.  While not directly related to raiding mechanics, these curated storylines offer new quests and lore-focused toys. The feature allows players to repeat these experiences, with progress reset if a new storyline is started before completion. Players cannot progress other quests while actively lorewalking.</p>",
        "word_stats": {
          "original": 537,
          "summary": 81,
          "reduction_percent": 84.9
        }
      },
      "M+": {
        "summary": "<p>The \"Legacy of Arathor\" content update introduces <b>Lorewalking</b>, allowing players level 10+ to revisit three curated storylines: Xal'atath, Ethereals, and The Lich King. Interact with Lorewalker Cho in capital cities to access these quests, which include new and existing content. Rewards include unique toys such as the Echo of Xal'atath, K'aresh Memory Crystal, and Royal Visage. Players can repeat these lore experiences and pause them to resume later, but progressing other quests while Lorewalking is unavailable.</p>",
        "word_stats": {
          "original": 537,
          "summary": 76,
          "reduction_percent": 85.8
        }
      },
      "PvP": {
        "summary": "<p>The <b>Legacy of Arathor</b> content update introduces <b>Lorewalker Cho</b>, offering players three new storylines focusing on Xal'atath, the Ethereals, and The Lich King. These repeatable quest experiences provide new lore. Completing them rewards players with unique toys:</p>\n<ul>\n  <li><b>Echo of Xal’atath, Blade of the Black Empire</b> toy: Xal'atath's voice echoes when killing foes.</li>\n  <li><b>K’aresh Memory Crystal</b> toy: Allows players to assume the appearance of a K'areshi.</li>\n  <li><b>Royal Visage</b> toy: Lets players take on the visage of Arthas Menethil.</li>\n</ul>\n<p>These lore-focused activities do not directly mention or impact PvP gameplay.</p>",
        "word_stats": {
          "original": 537,
          "summary": 90,
          "reduction_percent": 83.2
        }
      },
      "Open World": {
        "summary": "<p>The <b>Legacy of Arathor</b> update introduces <b>Lorewalking</b>, a new open-world experience for characters level 10+.</p>\n<p>Players can visit Lorewalker Cho in capital cities (Stormwind, Orgrimmar, Dornogal) to embark on three curated storylines focusing on <b>Xal’atath</b>, the <b>Ethereals</b>, and <b>The Lich King</b>. These include existing and new quests.</p>\n<p>Rewards include unique toys: <b>Echo of Xal’atath, Blade of the Black Empire</b>, the <b>K’aresh Memory Crystal</b>, and the <b>Royal Visage</b> toy.</p>\n<p>Lorewalker Cho acts as a guide and can be revisited to continue learning. These experiences are repeatable.</p>",
        "word_stats": {
          "original": 537,
          "summary": 85,
          "reduction_percent": 84.2
        }
      }
    }
  },
  {
    "id": "presenting-the-dastardly-duos-creator-clash-coming-june-7",
    "title": "Presenting the Dastardly Duos Creator Clash Coming June 7!",
    "date": "2025-06-04",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24208339/presenting-the-dastardly-duos-creator-clash-coming-june-7",
    "summary": "World of Warcraft presents the Dastardly Duos Creator Clash on Saturday, June 7th, starting at 10 AM PDT. Top guilds Echo and Liquid will battle in a cage match at the Undermine's Demolition Dome. They'll face Azeroth's villains in a three-round competition to earn points and claim the Warcraft-Weight World Champion title. Watch the action live on Twitch and YouTube.",
    "word_stats": {
      "original": 227,
      "summary": 60,
      "reduction_percent": 73.6
    },
    "classSummaries": {
      "Warrior": {
        "summary": "<p>The <strong>Dastardly Duos Creator Clash</strong> showcases top guilds, <em>Echo</em> and <em>Liquid</em>, battling in the <em>Undermine's Demolition Dome</em>. This event features a cage-match format with three rounds of competition. While the specific classes involved are not detailed, the Warriors from these prominent guilds will be participating. Tune in live on Twitch and YouTube on June 7th to witness the action.</p>",
        "word_stats": {
          "original": 227,
          "summary": 59,
          "reduction_percent": 74
        }
      },
      "Mage": {
        "summary": "<p>The blog post announces the <b>Dastardly Duos Creator Clash</b> event on June 7th, a competitive showcase featuring guilds Echo and Liquid in a cage-match showdown. While the post mentions Azeroth's heroes and villainous menaces, it does not specify any particular class, including Mage, participating in this Retail WoW event or any content relevant to The War Within and later.</p>",
        "word_stats": {
          "original": 227,
          "summary": 59,
          "reduction_percent": 74
        }
      },
      "Rogue": {
        "summary": "<p>The Dastardly Duos Creator Clash is a live event featuring two guilds, Echo and Liquid, competing in the Undermine's Demolition Dome.  This showcase pits their rosters against \"villainous menaces\" across three rounds to earn points. The event will be broadcast on Twitch and YouTube on Saturday, June 7th, starting at 10:00 am PDT. Specific Rogue class relevance is not detailed in this announcement.</p>",
        "word_stats": {
          "original": 227,
          "summary": 63,
          "reduction_percent": 72.2
        }
      },
      "Priest": {
        "summary": "<p>The blog post <strong>does not mention</strong> any specific content relevant to the Priest class for Retail WoW, The War Within, or later expansions.</p>",
        "word_stats": {
          "original": 227,
          "summary": 23,
          "reduction_percent": 89.9
        }
      },
      "Paladin": {
        "summary": "<p>The provided text does not contain any information directly relevant to the Paladin class in World of Warcraft, Retail, The War Within, or later expansions. It focuses on a competitive event called the \"Dastardly Duos Creator Clash\" featuring guilds Echo and Liquid in the Demolition Dome.</p>",
        "word_stats": {
          "original": 227,
          "summary": 46,
          "reduction_percent": 79.7
        }
      },
      "Hunter": {
        "summary": "The blog post announces the <b>Dastardly Duos Creator Clash</b>, a competitive event featuring teams from Echo and Liquid battling in the Undermine's Demolition Dome. While it mentions \"Azeroth's most headstrong heroes\" and \"fiercest fighters,\" <b>no specific class information, including for Hunters, is provided</b>. The event focuses on guild vs. guild competition and will be broadcast live on Twitch and YouTube on Saturday, June 7.",
        "word_stats": {
          "original": 227,
          "summary": 64,
          "reduction_percent": 71.8
        }
      },
      "Warlock": {
        "summary": "<p>The Dastardly Duos Creator Clash is a special event featuring two top guilds, Echo and Liquid, battling in the Demolition Dome. The showcase, airing live on Twitch and YouTube on Saturday, June 7th, involves intense cage matches against Azeroth's villains.  Points are awarded for match wins across three rounds.  The text does not mention specific Warlock class details or future content beyond the event itself.</p>",
        "word_stats": {
          "original": 227,
          "summary": 65,
          "reduction_percent": 71.4
        }
      },
      "Death Knight": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 227,
          "summary": 1,
          "reduction_percent": 99.6
        }
      },
      "Druid": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 227,
          "summary": 1,
          "reduction_percent": 99.6
        }
      },
      "Monk": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 227,
          "summary": 1,
          "reduction_percent": 99.6
        }
      },
      "Evoker": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 227,
          "summary": 1,
          "reduction_percent": 99.6
        }
      },
      "Demon Hunter": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 227,
          "summary": 1,
          "reduction_percent": 99.6
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 227,
          "summary": 1,
          "reduction_percent": 99.6
        }
      },
      "Raiding": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 227,
          "summary": 1,
          "reduction_percent": 99.6
        }
      },
      "M+": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 227,
          "summary": 1,
          "reduction_percent": 99.6
        }
      },
      "PvP": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 227,
          "summary": 1,
          "reduction_percent": 99.6
        }
      },
      "Open World": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 227,
          "summary": 1,
          "reduction_percent": 99.6
        }
      }
    }
  },
  {
    "id": "steel-your-nerves-for-dastardly-duos",
    "title": "Steel Your Nerves for Dastardly Duos",
    "date": "2025-06-03",
    "original_url": "https://worldofwarcraft.blizzard.com/news/24209846/steel-your-nerves-for-dastardly-duos",
    "summary": "[SUMMARY_FAILED]",
    "word_stats": {
      "original": 700,
      "summary": 1,
      "reduction_percent": 99.9
    },
    "classSummaries": {
      "Warrior": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Mage": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Rogue": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Priest": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Paladin": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Hunter": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Warlock": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Death Knight": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Druid": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Monk": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Evoker": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Demon Hunter": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      }
    },
    "contentTypeSummaries": {
      "Delves": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Raiding": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "M+": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "PvP": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      },
      "Open World": {
        "summary": "[SUMMARY_FAILED]",
        "word_stats": {
          "original": 700,
          "summary": 1,
          "reduction_percent": 99.9
        }
      }
    }
  }
]